{
    "title": "TSIC คืออะไร ?",

    "image1Description": "การจัดประเภทมาตรฐานอุตสาหกรรมของประเทศไทย",

    "image2Description": "ภาพจาก กรมการปกครอง กระทรวงมหาดไทย",

    "section1": {
        "heading": "SIC",
        "content": "SIC ย่อมาจาก Thailand Standard Industrial Classification คือการจัดประเภทมาตรฐานอุตสาหกรรมของประเทศไทย เป็นเครื่องมือสำคัญที่พัฒนาโดยสำนักงานสถิติแห่งชาติ (National Statistical Office: NSO) เพื่อช่วยจัดระเบียบข้อมูลทางเศรษฐกิจและอุตสาหกรรมของประเทศไทย ระบบนี้ใช้ในการจัดหมวดหมู่กิจกรรมทางเศรษฐกิจต่างๆ โดยยึดตามลักษณะของงานหรือบริการที่ธุรกิจและองค์กรดำเนินการ ซึ่งช่วยให้การวิเคราะห์ข้อมูล การวางแผนเชิงนโยบาย และการบริหารจัดการในภาคเศรษฐกิจและสังคมเป็นไปอย่างถูกต้องและเป็นมาตรฐาน"
    },

    "section2": {
        "heading": "TSIC",
        "content": "TSIC ถูกพัฒนาขึ้นโดยอิงตามระบบ ISIC (International Standard Industrial Classification) ของสหประชาชาติ ซึ่งเป็นมาตรฐานระดับสากลในการจัดหมวดหมู่กิจกรรมทางเศรษฐกิจ"
    },

    "section3": {
        "heading": "การแบ่งหมวดหมู่กิจกรรมทางเศรษฐกิจ",
        "description": "TSIC แบ่งกิจกรรมทางเศรษฐกิจออกเป็นหมวดหมู่ย่อยดังนี้",
        "list": [
            "หมวดใหญ่ (Sections): เป็นกลุ่มอุตสาหกรรมที่ใหญ่ที่สุด แบ่งเป็น 21 หมวดใหญ่ แทนด้วยตัวอักษร 1 ตัว (A - U)",
            "หมวดย่อย (Divisions): จำแนกย่อยจากหมวดใหญ่ แบ่งเป็น 88 หมวดย่อย แทนด้วยเลขรหัสตัวที่ 1 - 2",
            "หมู่ใหญ่ (Groups): จำแนกย่อยจากหมวดย่อย แบ่งเป็น 243 หมู่ใหญ่ แทนด้วยเลขรหัสตัวที่ 1 - 3",
            "หมู่ย่อย (Classes): จำแนกย่อยจากหมู่ใหญ่ แบ่งเป็น 441 หมู่ย่อย แทนด้วยเลขรหัสตัวที่ 1 - 4",
            "กิจกรรม (Activities): เป็นหน่วยที่เล็กที่สุด จำแนกจากหมู่ย่อย แบ่งเป็น 1,091 กิจกรรม แทนด้วยเลขรหัสตัวที่ 1 - 5"
        ]
    },

    "section4": {
        "heading": "การนำเอา TSIC ไปใช้งาน",
        "description": "TSIC มีการนำไปใช้งานในหลายด้าน ทั้งภาครัฐและเอกชน รวมถึงองค์กรระหว่างประเทศ ตัวอย่างการใช้งานที่สำคัญ",
        "list": [
            "การจัดเก็บข้อมูลทางสถิติ: TSIC ช่วยให้การเก็บรวบรวมข้อมูลเป็นไปอย่างมีมาตรฐาน เช่น การสำรวจภาวะเศรษฐกิจ การจ้างงาน หรือการลงทุนในอุตสาหกรรมต่างๆ",
            "การบริหารจัดการทะเบียนธุรกิจ: หน่วยงานภาครัฐ เช่น กรมพัฒนาธุรกิจการค้า ใช้ TSIC ในการจัดหมวดหมู่ธุรกิจเพื่อความสะดวกในการออกใบอนุญาตและติดตามการดำเนินกิจการ",
            "การวางแผนเชิงนโยบาย: รัฐบาลใช้ TSIC ในการวิเคราะห์ข้อมูลเพื่อวางแผนและพัฒนานโยบายเศรษฐกิจ เช่น การกำหนดเขตพัฒนาเศรษฐกิจพิเศษ หรือการส่งเสริมอุตสาหกรรมเป้าหมาย",
            "การวิจัยและวิเคราะห์ทางเศรษฐกิจ: นักวิจัยและนักวิชาการใช้ TSIC ในการวิเคราะห์แนวโน้มเศรษฐกิจหรือประสิทธิภาพของอุตสาหกรรมต่างๆ เพื่อสร้างความรู้และข้อเสนอแนะ"
        ]
    },

    "imageSection": {
        "heading02": "ค้นหาประเภทธุรกิจ (TSIC) ได้แล้ว ที่ https://tsic.dbd.go.th/",
        "heading03": "ตัวอย่างข้อมูลหมวดใหญ่",
        "heading04": "ตัวอย่างข้อมูลหมวดย่อย"
    },

    "section5": {
        "heading": "สำหรับข้อมูลเพิ่มเติมเกี่ยวกับ TSIC สามารถค้นหาได้ที่ https://tsic.dbd.go.th/"
    },

    "section6": {
        "heading": "เลขประจำตัวประชาชน 13 หลักของเราปลอดภัยแค่ไหน ?",
        "content": "สำหรับบทความเรื่อง TSIC ก็จบไปแล้วครับ หวังว่าบทความนี้จำทำให้ใครหลายๆคน รู้จัก TSIC และสามารถนำไปใช้ประโยชน์ได้สักนิดดดด ก็ยังดี สำหรับ Developer ตัวน้อยๆคนนี้ก็หวังว่า TSIC คงจะมีประโยชน์บ้างแหละ ไม่ตอนนี้ก็อนาคตอันยาวไกล แล้วพบกันใน 5 4 3 2 …"
    }
}