{
    "title": "สรุปหนังสือ Four Perfectionists",
    "image1Description": "FOUR PERFECTIONISTS",
    "image2Description": "Agenda",
    "image3Description": "บทที่ 1 แด่ผู้ที่เหนื่อยล้ากับการแสวงหาความสมบูรณ์แบบ",
    "image4Description": "ความอยากสมบูรณ์แบบ",
    "image5Description": "มีความสุข VS ไม่มีความสุข",
    "image6Description": "บทที่ 2 คนแสวงหาความสมบูรณ์แบบถือกำเนิดได้อย่างไร",
    "image7Description": "เราเองเป็นคนแสวงหาความสมบูรณ์แบบ",
    "image8Description": "กังวลถึงความผิดพลาดมากเกินไป",
    "image9Description": "นิสัยชอบจัดระเบียบ",
    "image10Description": "ความคาดหวังสูงของพ่อแม่",
    "image11Description": "มาตรฐานความสำเร็จที่สูง",
    "image12Description": "ความสงสัยในสิ่งที่ทำ",
    "image13Description": "บทที่ 3 คนแสวงหาความสมบูรณ์แบบ 4 ประเภท",
    "image14Description": "ที่ตั้งแห่งการประเมิน การมุ่งเน้นการควบคุมตนเอง",
    "image15Description": "คนแสวงหาความสมบูรณ์แบบ 4 ประเภท",
    "image16Description": "แสวงหาการยอมรับ อ่านสถานการณ์เก่ง",
    "image17Description": "ชื่นชอบความระทึก มักทำงานในนาทีสุดท้าย",
    "image18Description": "ปลอดภัยไว้ก่อน เหมือนเสื้อเกราะกันกระสุน",
    "image19Description": "มุ่งเน้นการเติบโต",
    "image20Description": "บทที่ 4 เปลี่ยนเป็นคนแสวงหาความสมบูรณ์แบบที่ยอดเยี่ยม",
    "image21Description": "การเปลี่ยนแปลง",
    "image22Description": "ประเภทแสวงหาการยอมรับ",
    "image23Description": "ประเภทชอบความระทึก",
    "image24Description": "ประเภทปลอดภัยไว้ก่อน",
    "image25Description": "ประเภทมุ่งเน้นการเติบโต",
    "image26Description": "คนแสวงหาความสมบูรณ์แบบ 4 ประเภท",
    "image27Description": "แสวงหาความสมบูรณ์แบบ",
    "section1": {
        "heading": "แด่คุณ…… ที่อยากให้ทุกอย่างเพอร์เฟกต์",
        "content": "FOUR PERFECTIONISTS แด่คุณ…. ที่อยากให้ทุกอย่างเพอร์เฟกต์ เป็นหนังสืออีกเล่มที่ผมเลือกอ่านเพราะคิดว่าตนเองเป็นคนที่คลั่งความสมบูรณ์แบบ แต่ไม่รู้ว่าการเป็นคนที่ต้องการความสมบูรณ์แบบนั้น เป็นสิ่งที่ดี หรือไม่ดีกันแน่ จึงเกิดคำถามต่างๆตามมามากมาย เช่น ประเภทของคนที่แสวงหาความสมบูรณ์แบบมีกี่ประเภท เราจัดอยู่ในประเภทไหน แล้วเราจะใช้ประโยชน์จากการเป็นคนที่คลั่งความสมบูรณ์แบบได้อย่างไร"
    },
    "section2": {
        "heading": "ทำความรู้จักกับตนเอง",
        "content": "ในบทความนี้เราจะมาทำความรู้จักกับตนเอง ทำความรู้จักกับความสมบูรณ์แบบของตนเอง เพื่อเปลี่ยนเป็นคนที่แสวงหาความสมบูรณ์แบบที่ยอดเยี่ยมกัน โดยหัวข้อที่ผมสรุปมาให้มีทั้งหมด 4 หัวข้อ คือ แด่ผู้เหนื่อยล้ากับการแสวงหาความสมบูรณ์แบบ คนแสวงหาความสมบูรณ์แบบถือกำเนินได้อย่างไร คนแสวงหาความสมบูรณ์แบบ 4 ประเภทมีอะไรบ้าง การเปลี่ยนเป็นคนที่แสวงหาความสมบูรณ์แบบที่ยอดเยี่ยม"
    },
    "section3": {
        "heading": "บทที่ 1",
        "content": "ในบทที่ 1 เราจะมาสำรวจการแสวงหาความสมบูรณ์แบบของเพอร์เฟกชันนิสต์กัน"
    },
    "section4": {
        "heading": "ความอยากสมบูรณ์แบบ",
        "content01": "ต้องทำให้ดีกว่าคนอื่น ห้ามทำพลาดเด็ดขาด ต้องสมบูรณ์แบบที่สุด",
        "content02": "คนแสวจหาความสมบูรณ์แบบมักล้มเหลวเพราะตั้งเป้าหมายสูงเกินไป เมื่อทำไม่สำเร็จก็โทษตัวเอง ส่งผลให้ตกสู่ภาวะซึมเศร้า",
        "content03": "จากแบบสำรวจพนักงาน 7 ใน 10 คน เป็นคนแสวจหาความสมบูรณ์แบบ และเชื่อว่าการเป็นเพอร์เฟกชันนิสต์มีผลเชิงบวกต่อประสิทธิภาพการทำงาน",
        "content04": "แต่ ** พนักงานออฟฟิศร้อยล่ะ 75.9 ตอบว่า “ไม่”",
        "content05": "เมื่อเจอคำถามว่า “การเป็นเพอร์เฟกชับนิสต์ทำให้มีความสุขหรือหรือไม่”"
    },
    "section5": {
        "heading": "คนที่แสวงหาความสมบูรณ์แบบ ที่ไม่มีความสุข",
        "content": "ใคนที่อาจพูดว่า “ถ้าขึ้นรถไฟฟ้าใต้ดินแทนที่จะนั่งแท็กซี่ก็คงไม่ต้องเจอปัญหาหรอก” แม้สาเหตุเกิดจากปัจจัยภายนอก เขาก็ยังโทษตัวเองอยู่ดี เขาอาจะเป็นคนแสวงหาความสมบูรณ์แบบ ที่ไม่มีความสุข"
    },
    "section6": {
        "heading": "แสวงหาความสมบูรณ์แบบ ที่มีความสุข",
        "description": "คนที่แสวงหาความสมบูรณ์แบบ ที่มีความสุข",
        "list": [
            "ใช้ความสมบูรณ์แบบเพื่อบรรลุเป้าหมาย | ไม่จดจ่อกับความผิดพลาด",
            "ยืดหยุ่นในกระบวนการบรรลุเป้าหมาย | ควบคุมแรงขับเคลื่อนของตน",
            "มองความล้มเหลวในเชิงบวก | อาจไม่ได้คะแนนเต็ม แต่แก้โจทย์ได้"
        ]
    },
    "section7": {
        "heading": "บทที่ 2",
        "content": "ในบทที่ 2 เราจะมาดูถึงปัจจัย 5 ประการที่ทำให้คุณกลายเป็นคนแสวงหาความสมบูรณ์แบบ"
    },
    "section8": {
        "heading": "เราเองเป็นคนแสวงหาความสมบูรณ์แบบ",
        "description": "ปัจจัยที่กระตุ้นให้เกิดความสมบูรณ์แบบ",
        "list": [
            "กังวลถึงความผิดพลาดมากเกินไป",
            "นิสัยชอบจัดระเบียบ",
            "ความคาดหวังสูงของพ่อแม่",
            "มาตรฐานความสำเร็จสูง",
            "ความสงสัยในสิ่งที่ทำ"
        ]
    },
    "section9": {
        "heading": "ประการที่ 1 กังวลถึงความผิดพลาดมากเกินไป",
        "content01": "ก.อาจเสียเวลาแก้ไขการสะกดคำผิดเล็กๆน้อยๆ จนลืมเรื่องสำคัญกว่า คือการส่งงานให้ตรงเวลา",
        "content02": "ข.วางแผนวันหยุดอย่างสมบูรณ์แบบ เพราะกลัวว่าจะไม่สมบูรณ์แบบ"
    },
    "section10": {
        "heading": "ความกลัวว่าจะทำผิดพลาด",
        "description": "ความกลัวว่าจะทำผิดพลาดแบ่งเป็น 2 ประเภท",
        "list": [
            "พยายามอย่างเต็มที่เพื่อไม่ให้ทำผิดซ้ำ",
            "หมกมุ่นและกังวลมากเกิดไปว่าจะทำผิดพลาดซ้ำ"
        ]
    },
    "section11": {
        "heading": "ประการที่ 2 นิสัยชอบจัดระเบียบ",
        "description": "นิสัยชอบจัดระเบียบ",
        "list": [
            "วาดไม้กางเขนก่อนเข้าห้องสัมภาษณ์",
            "ยืนหวดไม้หลายครั้งก่อนการแข่ง",
            "หมุนปากกาแล้วทำข้อสอบได้",
            "จัดโต๊ะทำงานก่อนเขียนรายงาน",
            "คิดไม่ออก เช็คแว่นก่อนละกัน",
            "ถูกเร่งจนไม่มีเวลาจัดโต๊ะ | ทำให้รู้สึกสูญเสียการควบคุม",
            "จัดโต๊ะจนลืมไปว่าเป้าหมายคืออะไร และหมดพลังงาน"
        ]
    },
    "section12": {
        "heading": "ประการที่ 3 ความคาดหวังสูงของพ่อแม่",
        "description": "ความคาดหวังสูงของพ่อแม่",
        "list": [
            "30 จาก 37 คน ตอบว่า ความสมบูรณ์แบบของตนมาจากพ่อแม่",
            "ลูกทำได้แค่นี้เหรอ (ประม่า เพราะไม่ได้ตามมาตรฐานของพ่อแม่)",
            "ข้อสอบ 80 คะแนน กับ อารมณ์ที่ละเอียดอ่อนบนใบหน้าพ่อแม่",
            "ข้อสอบ100 คะแนน กับ อารมณ์ที่เปลี่ยนไปของพ่อแม่"
        ]
    },
    "section13": {
        "heading": "ประการที่ 4 มาตรฐานความสำเร็จที่สูง",
        "description": "มาตรฐานความสำเร็จที่สูง",
        "list": [
            "มาตรฐานของตนเอง vร มาตรฐานของคนอื่นที่ฉันคิด",
            "เคยถูกเพื่อนล้อเรื่องการแต่งกาย คุณอาจยังยังกังวลเรื่องการแต่งกาย",
            "มัวไล่ตามเป้าหมายที่ไม่รู้ว่า ใช่ของฉันหรือเปล่า",
            "สำหรับคนแสวงหาความสมบูรณ์แบบที่ทำตามมาตรฐานความสำเร็จที่สูงของตนเอง ความคิดเห็นของคนอื่นก็เป็นแค่ “ข้อเสนอแนะ”"
        ]
    },
    "section14": {
        "heading": "ประการที่ 5 ความสงสัยในสิ่งที่ทำ",
        "description": "ความสงสัยในสิ่งที่ทำ",
        "list": [
            "“ทำแบบนี้ได้ไหมนะ” หรือ “นี่ดีที่สุดแล้วจริงเหรอ”",
            "เมื่อได้ยิน “เตียมตัว — ไป”..”เมื่อกี้เราได้ยินเสียงปล่อยตัวใช่ไหมนะ”",
            "มีโอกาศได้ 40,000 บาท 100 เปอร์เซ็นต์",
            "มีโอกาศได้ 50,000 บาท 80 เปอร์เซ็นต์"
        ]
    },
    "section15": {
        "heading": "จากตัวเลือกดังกล่าว",
        "content": "จะมีคนที่ เกิดการสงสัย เพื่อไม่ให้เสียผลประโยชน์ และมีคนที่ กล้าได้กล้าเสีย เชื่อในความสามารถและควาบยืดหยุ่นของตนเอง"
    },
    "section16": {
        "heading": "บทที่ 3",
        "content": "บทที่ 3 เราจะเรียนรู้เกี่ยวกับจุดเริ่มต้นของการเข้าใจความสมบูรณ์แบบของตนเองและผู้อื่น"
    },
    "section17": {
        "heading": "ที่ตั้งแห่งการประเมิน การมุ่งเน้นการควบคุมตนเอง",
        "content": "สิ่งที่เราใช้สำหรับแบ่งคนที่แสวงหาความสมบูรณ์แบบ คือ ที่ตั้งแห่งการประเมิน และ มุ่งเน้นการควบคุมตนเอง"
    },
    "section18": {
        "heading": "ที่ตั้งแห่งการประเมิน",
        "description": "ที่ตั้งแห่งการประเมิน แบ่งออกเป็น 2 ประเภท",
        "list": [
            "ภายใน => มุ่งเน้นค่านิยมของตน / การประเมินตนเองตามวิธีของตนเอง",
            "ภายนอก => มุ่งเน้นที่ปฏิกิริยาการตัดสินของคนอื่น / ประเมินตนเองจากการตัดสินของคนอื่น"
        ]
    },
    "section19": {
        "heading": "มุ่งเน้นการควบคุมตนเอง",
        "description": "มุ่งเน้นการควบคุมตนเอง แบ่งออกเป็น 2 ประเภท",
        "list": [
            "พัฒนา => กระตือรือร้นชอบความท้าทาย / เหนื่อยหน่อยแต่เดี๋ยวก็ได้พัก",
            "ป้องกัน => หลีกเลี่ยงความเสียงที่คาดเดา / ไม่ทำโครงการใหม่ไม่อยากถูกเกลียจ"
        ]
    },
    "section20": {
        "heading": "คนแสวงหาความสมบูรณ์แบบ 4 ประเภท",
        "content": "การแบ่งคนที่แสวงหาความสมบูรณ์แบบจาก ที่ตั้งแห่งการประเมิน และ มุ่งเน้นการควบคุมตนเอง สามารถแบ่งคนแสวงหาความสมบูรณ์แบบได้ 4 ประเภท ดังนี้"
    },
    "section21": {
        "heading": "แสวงหาการยอมรับ",
        "content": "ที่ตั้งแห่งการประเมินภายนอก x เน้นพัฒนา"
    },
    "section22": {
        "heading": "ชอบความระทึก",
        "content": "ที่ตั้งแห่งการประเมินภายนอก x เน้นป้องกัน"
    },
    "section23": {
        "heading": "ปลอดภัยไว้ก่อน",
        "content": "ที่ตั้งแห่งการประเมินภายใน x เน้นป้องกัน"
    },
    "section24": {
        "heading": "มุ่งเน้นการเติบโต",
        "content": "ที่ตั้งแห่งการประเมินภายใน x เน้นพัฒนา"
    },
    "section25": {
        "heading": "ประเภทที่ 1 แสวงหาการยอมรับ",
        "description": "แสวงหาการยอมรับ อ่านสถานการณ์เก่ง",
        "list": [
            "ดูแลและรักษาความสัมพันธ์ ถามสารทุกข์สุขดิบ เพื่อให้ไม่ห่างเหิน",
            "จะดีใจถ้าได้ยิน “ไม่มีใครทำได้นอกจากคุณ” “งานนี้ขาดคุณไม่ได้เลย”",
            "เมื่อเจอปัญหาเพียงเล็กน้อย จะผิดหวังและเศร้าทันที่",
            "จงกล้าที่จะปฏิเสธ คิดถึงสิ่งที่อีกฝ่ายขอให้ถี่ถ้วน",
            "แสดงตัวตนที่แท้จริง คุณจะได้รับความไว้วางใจมากยิ่งขึ้งขึ้น"
        ]
    },
    "section26": {
        "heading": "ประเภทที่ 2 ชื่นชอบความระทึก",
        "description": "ชื่นชอบความระทึก มักทำงานในนาทีสุดท้าย",
        "list": [
            "รอให้มีอารมณ์ 100 % แล้วค่อยทำ แต่เวลานั้นก็ไม่เคยมีอยู่จริง",
            "ได้รับงาน 6 เดือน จะทำตอน 2 เดือนสุดท้าย และถ้าไม่ทันก็จะเทงาน",
            "คุ้นเคยกับการวิ่งระยะสั้น แต่วิ่งมาราธอนได้แย่มาก",
            "พัฒนา “มุมมองด้านเวลา” การประมาณการเวลา",
            "มีภาพชัดเจนว่าต้องทำอะไร เมื่อไหร่ ความไม่แน่นอนก็จะลดลง"
        ]
    },
    "section27": {
        "heading": "ประเภทที่ 3 ปลอดภัยไว้ก่อน",
        "description": "ปลอดภัยไว้ก่อน เหมือนเสื้อเกราะกันกระสุน",
        "list": [
            "เดินทางไปต่างประเทศ ด้วยแผนการเดินทางอันสมบูรณ์",
            "หากต้องส่งเมล จะเน้นที่เนื้อหา โดยลืมถึงความรู้สึกของผู้รับสาร",
            "ไม่เคยล้มเหลวเพราะระมัดระวังเสมอ แต่เศร้าเพราะไม่เคยรู้สึกตื่นเต้น",
            "ลดความระมัดระวังให้เหมาะสม ตื่นเต้นกับงานมากขึ้น",
            "แสดงออกในบางครั้ง เพราะนั่นเป็นลักษณะของมนุษย์"
        ]
    },
    "section28": {
        "heading": "ประเภทที่ 4 มุ่งเน้นการเติบโต",
        "description": "มุ่งเน้นการเติบโต",
        "list": [
            "ตื่นเต้นมากเมื่อเริ่มงานใหม่ ไม่ลังเลที่จะเผชิญความท้าย",
            "ไล่ตามเป้าหมายที่ไม่แน่นอน ท้าทายตนเองประจำ และไม่จิตตก",
            "ความภาคภูมิใจในตนเองจะป้องกันไม่ให้ทัศนคติของคนอื่นมาทำลาย",
            "ควร “นิยมความขัดแย้ง”ในระดับที่เหมาะสม",
            "อย่าแสดงความเบื่อหน่าย ให้แสดงถึงความเห็นอกเห็นใจ"
        ]
    },
    "section29": {
        "heading": "บทที่ 4",
        "content": "บทที่ 4 เราจะเรียนรู้เกี่ยวกับแนวทางปฏิบัติเพื่อการเปลี่ยนแปลงและการเติบโต"
    },
    "section30": {
        "heading": "การเปลี่ยนแปลง",
        "description": "แนวทางเพื่อการเปลี่ยนแปลงและการเติบโต",
        "list": [
            "บันทึกเหตุการณ์ที่มีผลต่อการแสวงหาความสมบูรณ์แบบ",
            "แสดงอารมณ์เชิงบวก และเชิงลบ",
            "ถ้าย้อนกลับไปได้คุณจะมอบ “คำพูดให้กำลังใจ”อะไรแก่ตัวเอง"
        ]
    },
    "section31": {
        "heading": "ประเภทแสวงหาการยอมรับ",
        "description": "ประเภทแสวงหาการยอมรับ ควร จดจ่อที่ใจของตัวเองมากกว่าคนอื่น",
        "list": [
            "อธิบายสิ่งที่คุณ “ชอบ” อย่างละเอียด เขียนอย่างละเอียด แล้วจัดหมวดหมู่",
            "เขียนสิ่งที่คุณทำได้ดีและต้องการปรับปรุงในอนาคต"
        ]
    },
    "section32": {
        "heading": "ประเภทชอบความระทึก",
        "description": "ประเภทชอบความระทึก ควร พัฒนาการรับรู้เวลาที่สมจริง",
        "list": [
            "จดเวลาที่คาดว่าต้องใช้ในการทำงาน และระยะเวลาที่ต้องใช้ทำงานจริง",
            "พิจารณาถึงสาเหตุของความคลาดเคลื่อนอย่างรอบคอบ",
            "เรียบรู้และลดความคลาดเคลื่อน และพยายามไม่ให้เกิดซ้อน",
            "เตียมแผนการอย่างละเอียด ที่ไม่เกิน 15 นาที"
        ]
    },
    "section33": {
        "heading": "ประเภทปลอดภัยไว้ก่อน",
        "description": "ประเภทปลอดภัยไว้ก่อน ควร แสดงความรอบคอบอย่างยืนหยุ่นมากขึ้น",
        "list": [
            "มองย้อนกลับไป เพื่อหาสาเหตุที่ทำให้คุณพลาดโอกาศนั้นไป",
            "ฝึกคำพูดที่เน้นพัฒนา"
        ]
    },
    "section34": {
        "heading": "ประเภทมุ่งเน้นการเติบโต",
        "description": "ประเภทมุ่งเน้นการเติบโต ควร การสร้างความสัมพันธ์กับผู้อื่น",
        "list": [
            "รับฟังประสบการณ์และความคิดเห็นของคนอื่นอื่น",
            "รักษาทัศนคติที่เป็นมิตรหรือเป็นบวกต่อคนอื่น",
            "ตอบสนองคนอื่นอย่างซื่อสัตย์"
        ]
    },
    "section35": {
        "heading": "สรุป",
        "content": "สรุปคนแสวงหาความสมบูรณ์แบบ 4 ประเภท"
    },
    "section36": {
        "heading": "แสวงหาการยอมรับ",
        "description": "คนแสวงหาความสมบูรณ์แบบประเภท แสวงหาการยอมรับ",
        "list": [
            "ที่ตั้งแห่งการประเมินภายนอก x เน้นพัฒนา",
            "เป็นที่ชื่นชอบของคนอื่นได้ง่าย",
            "แต่มีระดับการแสวงหาความสมบูรณ์แบบขั้นสุด",
            "มักละเลยตัวเอง เพราะมัวแต่ใส่ใจคนอื่น"
        ]
    },
    "section37": {
        "heading": "ชอบความระทึก",
        "description": "คนแสวงหาความสมบูรณ์แบบประเภท ชอบความระทึก",
        "list": [
            "ที่ตั้งแห่งการประเมินภายนอก x เน้นป้องกัน",
            "แก้ปัญหาเฉพาะหน้าได้ดี",
            "มีแนวโน้มที่จะผัดวันประกันพรุ่งเมื่อทำงานสำคัญ",
            "กลัวควมล้มเหลวและการประเมิน"
        ]
    },
    "section38": {
        "heading": "ปลอดภัยไว้ก่อน",
        "description": "คนแสวงหาความสมบูรณ์แบบประเภท ปลอดภัยไว้ก่อน",
        "list": [
            "ที่ตั้งแห่งการประเมินภายใน x เน้นป้องกัน",
            "ทำงานละเอียดรอบคอบและตั้งใจ",
            "มักหลีกเลี่ยงความเปลี่ยนแปลงหรือความท้ากาย",
            "รักษาสภาพที่เป็นอยู่"
        ]
    },
    "section39": {
        "heading": "มุ่งเน้นการเติบโต",
        "description": "คนแสวงหาความสมบูรณ์แบบประเภท มุ่งเน้นการเติบโต",
        "list": [
            "ที่ตั้งแห่งการประเมินภายใน x เน้นพัฒนา",
            "เป็นคนมั่นใจและมีความเป็นผู้นำเชิงรุก",
            "ประเภทของคนแสวงหาความสมบูรณ์แบบที่มีความสุขที่สุดในตะวันตก"
        ]
    },
    "section40": {
        "heading": "แสวงหาความสมบูรณ์แบบ",
        "content": "ความสมบูรณ์แบบ ไม่ใช่สิ่งเล็กน้อย แต่ความสมบูรณืแบบเกิดขึ้นจากสิ่งเล็กน้อย"
    },
    "section41": {
        "heading": "แด่คุณ…. ที่อยากให้ทุกอย่างเพอร์เฟกต์",
        "content": "หวังว่าเนื้อหาสรุปนี้ จะมีประโยชน์ และอย่าลืมไปหาหนังสือ Four Perfectionists มาอ่านกันด้วยนะครับ บทความนี้ แด่คุณ…. ที่อยากให้ทุกอย่างเพอร์เฟกต์ *-*"
    }
}