import { defineEventHandler } from 'h3'

export default defineEventHandler(() => {
  return [
    {
      id: 1,
      title: {
        en: 'University of Phayao',
        th: 'มหาวิทยาลัยพะเยา',
      },
      period: '2021 — 2025',
      description: {
        en: 'Computer Engineering, Graduated with a GPA of 3.81 (First-Class Honors)',
        th: 'วิศวกรรมคอมพิวเตอร์ เกรดเฉลี่ย 3.81 (เหรียญทอง เกียรตินิยมอันดับ 1)',
      },
      remark: {
        en: '',
        th: 'กิจกรรมระหว่างเรียน',
      },
      content: [
        {
          title: { en: ' ', th: 'คณะกรรมการองค์การนิสิต' },
          description: { en: ' ', th: 'ดำรงตำแหน่งคณะกรรมการองค์การนิสิตฝ่ายเทคโนโลยีสารสนเทศและการสื่อสาร ทำหน้าที่ตั้งแต่การเป็นแกนนำในการทำสื่อการหาเสียง จนถึงการผลักดันการจัดกิจกรรมทางออนไลน์' },
        },
        {
          title: { en: ' ', th: 'ประธานชั้นปี สาขาวิศวิศวกรรมคอมพิวเตอร์' },
          description: { en: ' ', th: 'ได้รับการคัดเลือกจากเพื่อนๆในสาขา ให้ดำรงตำแหน่งประธานชั้นปี สาขาวิศวกรรมคอมพิวเตอร์ รับผิดชอบในการประสานงานระหว่างชั้นปี จัดกิจกรรม เป็นตัวแทนชั้นปีในการเข้าร่วมกิจกรรมต่างๆ' },
        },
        {
          title: { en: ' ', th: 'ผู้ช่วยสอน TA' },
          description: { en: ' ', th: 'ได้เป็นผู้ช่วยสอน TA ในหลายๆวิชา และยังได้เข้าร่วมอบรม สำหรับการเป็นผู้ช่วยสอน ในวิชาของมหาวิทยาลัย เพื่อสามารถแบ่งเบาภาระอาจารย์ในการสอน และช่วยเหลือน้องๆในการเรียน' },
        },
        {
          title: { en: ' ', th: 'ผู้ร่วมจัดตั้งพรรค 20DALE มหาวิทยาลัยพะเยา' },
          description: { en: ' ', th: 'ผู้ร่วมจัดตั้งพรรค 20DALE มหาวิทยาลัยพะเยา เพื่อเป็นกระบอกเสียงสำหรับนิสิต และเป็นอาสาสมัครในการจัดกิจกรรมต่างๆในมหาวิทยาลัย ร่วมถึงนอกมหาวิทยาลัยอีกด้วย' },
        },
        {
          title: { en: ' ', th: 'เข้าร่วมการแข่งขัน Startup Thailand League' },
          description: { en: ' ', th: 'เข้ารอบ 200 ทีมสุดท้าย สู่การแข่งขัน Startup Thailand League ระดับประเทศ โดยผมเป็นหัวหน้าทีมในการแข่งขัน และเป็นคนนำเสนอไอเดีย (Pitching) ต่อคณะกรรมการ' },
        },
        {
          title: { en: ' ', th: 'เข้าร่วมการแข่งขัน TESA Top Gun' },
          description: { en: ' ', th: 'เข้าร่วมการแข่งขัน TESA Top Gun เป็นรายการการแข่งขันด้านสมองกลฝังตัว ที่ใหญ่ที่สุดในประเทศไทย ผมเป็นหัวหน้าทีมในการนำทีมจากมหาวิทยาลัยเข้าร่วมการแข่งขันและได้รับ เหรียญเงิน' },
        },
        {
          title: { en: ' ', th: 'ชนะเลิศการประกวดโครงงาน (Project)' },
          description: { en: ' ', th: 'ชนะเลิศการประกวดโครงงาน ในสาขาวิศวกรรมคอมพิวเตอร์ ด้วยโครงงานที่ได้พัฒนาร่วมกับบริษัท เพื่อแก้ไขปัญหาในบริษัท การประกวดโครงงานมีคณะกรรมการเป็นตัวแทนจากบริษัทต่างๆ' },
        },
      ],
    },
    {
      id: 2,
      title: {
        en: 'Measai Vocational College',
        th: 'วิทยาลัยอาชีวศึกษาแม่สาย',
      },
      period: '2018 — 2021',
      description: {
        en: 'Chinese Language School (High School)',
        th: 'โรงเรียนสอนภาษาจีน มัธยมศึกษาตอนปลาย',
      },
      remark: {
        en: '',
        th: 'กิจกรรมระหว่างเรียน',
      },
      content: [
        {
          title: { en: '', th: 'รองประธานนักเรียน' },
          description: { en: '', th: 'ดำรงตำแหน่งรองประธานนักเรียน วิทยาลัยอาชีวศึกษาแม่สาย (ภาคภาษาจีน) เป็นแกนนำในการหาเสียงก่อนที่จะได้ดำรงตำแหน่งรองประธานนักเรียน หลังจากได้ดำรงตำแหน่ง ได้ผลักดันการจัดกิจกรรมต่างๆภายในวิทยาลัย' },
        },
      ],
    },
    {
      id: 3,
      title: {
        en: 'Watthumpla Witthayakhom School',
        th: 'โรงเรียนวัดถ้ำปลาวิทยาคม',
      },
      period: '2018 — 2021',
      description: {
        en: 'Science-Math Program',
        th: 'แผนกวิทย์-คณิต',
      },
      remark: {
        en: '',
        th: 'กิจกรรมระหว่างเรียน',
      },
      content: [
        {
          title: { en: '', th: 'ประธานนักเรียน' },
          description: { en: '', th: 'ดำรงตำแหน่งประธานนักเรียน เป็นตัวแทนโรงเรียนในการเข้าร่วมกิจกรรมต่างๆจากทาง สพม. จัดกิจกรรมต่างๆภายในโรงเรียน และเป็นกระบอกเสียงให้กับนักเรียนในโรงเรียนเพื่อสะท้อนถึงปัญหาต่างๆ ต่อผู้บริหารสถานศึกษา' },
        },
        {
          title: { en: '', th: 'ประกวดสิ่งประดิษฐ์และนวัตกรรม' },
          description: { en: '', th: 'ชนะเลิศและได้เป็นตัวแทนจังหวัดในการแข่งขันประกวดสิ่งประดิษฐ์และนวัตกรรม' },
        },
      ],
    },
    {
      id: 4,
      title: {
        en: 'Santiwana School',
        th: 'โรงเรียนสันติวนา',
      },
      period: '2015 — 2018',
      description: {
        en: 'Graduated with a GPA of 3.50',
        th: 'เกรดเฉลี่ย 3.50',
      },
      remark: {
        en: 'Studied at the lower secondary level',
        th: 'ศึกษาในระดับมัธยมศึกษาตอนต้น',
      },
      content: [
        {
          title: { en: '', th: 'การแข่งขันเครื่องบินพลังยาง' },
          description: { en: '', th: 'เข้าร่วมการแข่งขันเครื่องบินพลังยาง ประเภทการแข่งขันปล่อยอิสระ' },
        },
      ],
    },
    {
      id: 5,
      title: {
        en: 'Banphadang School',
        th: 'โรงเรียนบ้านผาแดง',
      },
      period: '2007 — 2015',
      description: {
        en: 'Graduated with a GPA of 3.25',
        th: 'เกรดเฉลี่ย 3.25',
      },
      remark: {
        en: 'Studied at the kindergarten and elementary levels',
        th: 'ศึกษาในระดับอนุบาลและประถมศึกษา',
      },
      content: [
        {
          title: { en: '', th: 'การแข่งขันอัจฉริยภาพทางคณิตศาสตร์' },
          description: { en: '', th: 'ชนะเลิศการแข่งขันอัจฉริยภาพทางคณิตศาสตร์ ระดับเขตพื้นที่การศึกษา' },
        },
        {
          title: { en: '', th: 'การแข่งขันโครงงานวิทยาสาสตร์ ประเภทสิ่งประดิษฐ์' },
          description: { en: '', th: 'เป็นตัวแทนการแข่งขันการแข่งขันโครงงานวิทยาสาสตร์ ประเภทสิ่งประดิษฐ์ ระดับจังหวัด' },
        },
      ],
    }
  ]
})
