{
    "title": "Soft Xpense : ระบบขออนุมัติจ่ายเงินแบบดิจิทัลสำหรับองค์กร",

    "image1Description": "ระบบขออนุมัติจ่ายเงินแบบดิจิทัลสำหรับองค์กร",

    "section1": {
        "heading": "แรงบันดาลใจ",
        "content": "Soft Xpense เป็นระบบบริหารจัดการค่าใช้จ่ายภายในองค์กรที่ครอบคลุมการเบิกจ่ายทุกประเภท ตั้งแต่ค่าเดินทางไปจนถึงเงินสดย่อยของสาขา อย่างไรก็ตาม ผมพบว่าระบบยังมีช่องว่างสำคัญคือการเบิกจ่ายให้บุคคลภายนอก (Vendor) ซึ่งเดิมต้องดำเนินการด้วยเอกสารกระดาษผ่านช่องทางออฟไลน์ทั้งหมด ทำให้ติดตามสถานะได้ยาก เกิดความล่าช้า และเสี่ยงต่อการตกหล่นของข้อมูล ผมจึงต้องการเปลี่ยนกระบวนการนี้ให้เข้าสู่ระบบดิจิทัล (Digitization) เพื่อสร้างมาตรฐานการเบิกจ่ายให้ครบวงจรและโปร่งใสมากขึ้น"
    },

    "section2": {
        "heading": "แนวคิดและการออกแบบ",
        "content": "ผมได้รับมอบหมายให้เป็นผู้รับผิดชอบหลักในการพัฒนาโมดูล 'PRQ' โดยเริ่มจากการทำ User Research ร่วมกับแผนกบัญชีและการเงินเพื่อทำความเข้าใจ Flow การทำงานที่แท้จริง จากนั้นจึงออกแบบขั้นตอนการอนุมัติ (Approval Workflow) และระบบแจ้งเตือนผ่านอีเมลที่สามารถติดตามสถานะแบบ Real-time ได้ ไฮไลท์สำคัญคือการออกแบบระบบ Interface ข้อมูลให้เชื่อมต่อกับระบบบัญชีโดยอัตโนมัติ เพื่อลดภาระงานของเจ้าหน้าที่ (Manual Entry) และช่วยให้การสรุปรายงานย้อนหลังมีความแม่นยำและรวดเร็วยิ่งขึ้น"
    },

    "section3": {
        "heading": "ความท้าทายและทางแก้",
        "content": "ความท้าทายสูงสุดคือช่องว่างด้านความรู้ในสายงาน (Domain Knowledge) เนื่องจากระบบบัญชีและการเงินมีศัพท์เฉพาะทางที่ซับซ้อน ในช่วงแรกผมประสบปัญหาในการตีความความต้องการของผู้ใช้งาน ผมจึงใช้วิธีบันทึกรายละเอียดการประชุมอย่างถี่ถ้วนเพื่อนำมาถอดบทเรียนและย่อยข้อมูลหลังจบการประชุม พร้อมทั้งจัดเตรียมประเด็นคำถามเชิงลึกเพื่อ Re-check ความเข้าใจในครั้งถัดไป นอกจากนี้ผมยังตัดสินใจศึกษาต่อในวิชาบัญชีและการเงินเพิ่มเติม เพื่อให้สามารถสื่อสารกับ Stakeholders และออกแบบระบบที่ตอบโจทย์มาตรฐานบัญชีได้อย่างมืออาชีพ"
    },

    "section4": {
        "heading": "โอกาสในการพัฒนาต่อยอด",
        "content": "โปรเจกต์นี้ไม่เพียงแต่ถูกนำไปใช้งานจริงในองค์กร แต่ยังได้รับการต่อยอดเป็นวิทยานิพนธ์สาขาวิศวกรรมคอมพิวเตอร์ และได้รับรางวัลชนะเลิศ (คะแนนสูงสุด) จากการประกวดผลงานที่มีคณะกรรมการจาก 7 บริษัทชั้นนำและคณาจารย์ผู้ทรงคุณวุฒิเป็นผู้ตัดสิน ความสำเร็จนี้พิสูจน์ให้เห็นถึงประสิทธิภาพของ Solution ที่ผมพัฒนาขึ้น ซึ่งปัจจุบันถูกใช้เป็นต้นแบบในการพัฒนาผลิตภัณฑ์ใหม่ของบริษัท และยังเป็นเครื่องยืนยันถึงความมุ่งมั่นในการเรียนรู้แบบข้ามสายงาน (Cross-functional) ของผมได้เป็นอย่างดี"
    },

    "gallery": {
        "heading": "รูปเพิ่มเติม"
    }  
}