{
  "title": "NB-IoT (Narrow Brand Internet Of Things) คืออะไร ?",

  "image1Description": "NB-IOT",
  "image2Description": "Internet Of Things",
  "image3Description": "Internet Of Things (WiFi)",
  "image4Description": "Sendor Communication Application",
  "image5Description": "What is NB-IoT",
  "image6Description": "Narrow Band Internet Of Things",
  "image7Description": "NB-IOT in Thai",
  "image8Description": "Devio NB-Shield",
  "image9Description": "True NB-IoT Shield",
  "image10Description": "จุดเด่น ของ NB — IOT",
  "image11Description": "NB-IOT ในการติดตั้งเครื่องตรวจจับไฟป่า",
  "image12Description": "ระบุตำแหน่งรถเมล์ของมหาวิทยาลัยพะเยา",
  "image13Description": "NB-IOT ในการสั่งเปิดแอร์บนรถยนต์",
  "image14Description": "NB-IOT Motor Tacker",
  "image15Description": "ประโยชน์ของ NB-IOT Motor Tacker",
  "image16Description": "NB-IOT ใกล้กว่าที่คุณคิด ?",

  "section1": {
    "heading": "เกริ่นนำ",
    "content01": "หลังจากเรารู้จัก IoT แล้ว ในบทความนี้เรามาทำความรู้จักกับ NB — IoT กัน",
    "content02": "เมื่อพูดถึง IoT เราจะคิดถึงการนำอุปกรณ์เชื่อต่อเข้ากับ Internet (WiFi) ซึ่งในบางครั้งอุปกรณ์ตั้งอยู่ในพื้นที่ห่างไกล หรือไม่สามารถเชื่อต่อกับ WiFi ได้ NB — IoT จึงเกิดมาเพื่อแก้ปัญหานี้"
  },

  "section2": {
    "heading": "Internet Of Things",
    "content": "IoT หมายถึงการนำเอา อุปกรณ์อิเล็กทรอนิกส์ต่างๆ เชื่อมโยงกัน ส่งข้อมูลถึงกับด้วยอินเทอร์เน็ต หรือส่งผ่าน WiFi ที่เรานิยมใช้กันนั่นเอง"
  },

  "section3": {
    "heading": "Internet Of Things (WiFi)",
    "content": "จากรูป เป็นภาพจำลองของการนำเอาอุปกรณ์ต่างๆ เชื่อต่อกับ Internet หรือ WiFi ที่เราใช้ภายในบ้าน หรือสถานที่ทำงาน"
  },

  "section4": {
    "heading": "Sendor Communication Application",
    "content": "IoT ประกอบด้วย Sensor ซึ่งทำหน้าที่ในการตรวจจับ รับรู้เหตุการณ์ที่เกิดขึ้นต่างๆ Communication คือวิธีในการสื่อสาร เช่น Bluetooth หรือ WiFi ที่เรารู้จักกัน ก็เป็นหนึ่งในช่องทางการติดต่อสื่อสารของอุปกรณ์ IoT นอกจากนี้ยังมี Cellular ที่เราใช้สำหรับให้มือถือของเราสามารถใช้งาน Internet กับผู้ให้บริการได้ ก็จัดอยู่ในวิธีการติดต่อสื่อสารของ IoT เหมือนกัน แต่อาจจะไม่ได้รับความนิยมมากเท่ากับ WiFi Application เป็นการแสดงผลข้อมูล สั่งงานอุปกรณ์ IoT ที่เราเชื่อมต่อไว้"
  },

  "section5": {
    "heading": "What is NB-IoT",
    "content": "จากการรู้จักว่า Cellular ก็เป็นหนึ่งในวิธีการติดต่อสื่อสารของอุปกรณ์ IoT ซึ่งเราเรียกวิธีการติดต่อสื่อสารนั้นว่า NB-IoT ย่อมาจาก Narrow Brand Internet of Things แปลว่า มาตรฐานระบบโครงข่ายที่ใช้พลังงานต่ำ โดยผ่านสัญญาณโทรศัพท์เคลื่อนที่ หรืออธิบายสั้นๆง่ายๆก็คือ การใช้สัญญาณโทรศัพท์ในการสื่อสารระหว่างอุปกรณ์ IoT"
  },
  
  "section6": {
    "heading": "Narrow Band Internet Of Things",
    "content01": "การใช้ Narrow Brand Internet Of Things มีอยู่ 3 แบบคือ In-brand Guard-brand และ Standalone",
    "content02": "In-brand หมายถึงเราจะใช้สัญญาณเดียวกับสัญญาณที่เราใช้กันในชีวิตประจำวันในการติดต่อสื่อสารของอุปกรณ์ IoT เช่น เราใช้อินเตอร์เน็ตในการดูวิดีโอบนโซเชียลมีเดียต่างๆ ซึ่งอุปกรณ์ IoT ก็จะใช้ช่องทางเดียวกันในการติดต่อสื่อสาร ทำให้ In-brand สามารถติดต่อสื่อสารกันได้เร็วที่สุด แต่ก็มีค่าใช้จ่ายที่มากตามมาด้วย",
    "content03": "Guard-brand คือช่องว่างระหว่างสัญญาณอินเตอร์เน็ตที่เราใช้ในชีวิตประจำวัน ในการรับส่งข้อมูลต่างๆมักจจะมีช่องว่างของข้อมูล Guard-brand คือการนำส่งข้อมูลของอุปกรณ์ IoT ผ่านช่องว่างเหล่านั้น และเรานิยมใช้ Guard-brand ในการส่งข้อมูลของ Sensor ต่างๆ เพราะเพียงพอในการส่งข้อมูลที่เป็นตัวเลขหรืออักษร และมีค่าใช้จ่ายที่ไม่สูง",
    "content04": "Standalone ก็ตามชื่อเลย คือการตั้งสัญญาณขึ้นมาสำหรับการรับส่งติดต่อสื่อสาร โดยไม่ไปยุ่งกับสัญญาณอื่นๆเลย"
  },

  "section7": {
    "heading": "NB-IOT in Thai",
    "content": "ผู้ให้บริการ NB-IoT ในไทย โดยหลักๆมีของ AIS และ True ที่ให้บริการเป็นรายปี และมีบอร์ดให้ใช้งานเป็นของตนเอง"
  },

  "section8": {
    "heading": "Devio NB-Shield",
    "content": "Devio NB-Shield ซึ่งเป็นบอร์ด NB-IoT ของ AIS เป็น Shield ที่สามารถต่อเข้ากับ Microcontroller ได้เช่น Arduino UNO เป็นต้น โดยราคา Shield อยู่ที่ 1,047 บาท และค่าบริการอยู่ที่ 350 บาท/ปี มีความเร็วการ Downlink อยู่ที่ 24 kbps ความเร็วการ Uplink อยู่ที่ 15.625 kbps"
  },
  
  "section9": {
    "heading": "True NB-IoT Shield",
    "content": "True NB-IoT Shield ซึ่งเป็นบอร์ด NB-IoT ของ True เป็น Shield ที่สามารถต่อเข้ากับ Microcontroller ได้เช่น Arduino UNO เป็นต้น โดยราคา Shield อยู่ที่ 1,150 บาท และค่าบริการอยู่ที่ 330 บาท/ปี มีความเร็วการ Downlink อยู่ที่ 24 kbps ความเร็วการ Uplink อยู่ที่ 15.625 kbps"
  },

  "section10": {
    "heading": "จุดเด่น ของ NB — IOT",
    "description": "จุดเด่นที่สำคัญของ NB — IOT",
    "list": [
      "ต่อยอดมาจากระบบการสื่อสารอินเตอร์เน็ตเซลลูลาร์ LTE",
      "ใช้พลังงานไฟฟ้าต่ำ Uplink ใช้งานแบตเตอรี่ได้นานถึง 10 ปี",
      "รองรับปริมาณอุปกรณ์ loT สูงสุดในระดับแสนตัวต่อสถานี",
      "รัศมีการเชื่อมต่อกระจายได้มากกว่า 10 ก.ม. ต่อสถานี",
      "พัฒนาได้อย่างรวดเร็ว เพราะใช้ร่วมกับ 4G ในปัจจุบันได้"
    ]
  },

  "section11": {
    "heading": "NB-IOT ในการติดตั้งเครื่องตรวจจับไฟป่า",
    "content": "ตัวอย่างการใช้งาน NB-IOT ในการติดตั้งเครื่องตรวจจับไฟป่า เนื่องจากในป่าลึกไม่มีสัญญาณ WiFi ทำให้ต้องใช้ NB-IOT เข้ามาแก้ไขปัญหานี้ โดยการใช้ NB-IOT ในการสั่งสัญญาณการตรวจจับ ควัญ ความร้อนต่างๆ เป็นต้น"
  },

  "section12": {
    "heading": "ระบุตำแหน่งรถเมล์ของมหาวิทยาลัยพะเยา",
    "content": "ระบบการระบุตำแหน่งรถเมล์ของมหาวิทยาลัยพะเยา สามารถใช้ NB-IOT ในการระบุตำแหน่งได้ โดยการอ่านค่า GPS และส่งข้อมูลผ่านระบบ NB-IOT ทำให้สามารถแสดงตำแหน่งรถเมล์ได้แบบ Realtime ยังสามารถนำข้อมูลตำแหน่งรถเมล์วิเคราะห์หาเวลาที่คาดว่ารถเมล์จะเดินทางถึงป้ายรถเมล์ต่างๆได้อีกด้วย ซึ่งปัจจุบันมหาวิทยาลัยพะเยาใช้เทคโนโลยี ที่มีชื่อว่า LoRa"
  },

  "section13": {
    "heading": "NB-IOT ในการสั่งเปิดแอร์บนรถยนต์",
    "content": "การใช้งาน AIS NB-IOT Devio ในการสั่งเปิดแอร์บนรถยนต์ ทำให้เราสามารถสั่งเปิดแอร์บนรถยนต์ผ่านมือถือของเราได้ โดยเราสามารถเปิดแอร์จากที่ไหนก็ได้ เพียงแค่มี Internet เป็นการนำเอาเทคโนโลยีเข้ามาแก้ไขปัญหาในชีวิตประจำวัน ที่ทั้งตอบโจทย์ และเพิ่มความสะดวกสบายสุดๆ"
  },

  "section14": {
    "heading": "NB-IOT Motor Tacker",
    "content": "NB-IOT Motor Tacker สำหรับใครที่มีรถจักรยานยนต์ ต้องการติดตามการเคลื่อที่ของรถจักรยานยนต์ อุปกรณื NB-IOT Motor Tacker สามารถช่วยระบบตำแหน่งของรถจักรยานยนต์ของเราได้ และยังสามารถติดตามการแจ้งเตื่อนเมื่อรถสั่น แจ้งเตือนเมื่อรถเคลื่อนที่ แจ้งเตือนเมื่อรถเคลื่อนที่ด้วยความเร็วเกินที่กำหนดไว้ แจ้งเตือนเมื่ออุณหภูมิเกินกว่าที่กำหนดไว้ แจ้งเตือนเมื่อรถเข้าออกเขตพื้นที่ ที่เรากำหนดไว้ จะเห็นว่าเราสามารถนำนำเอาอุปกรณ์ NB-IOT มาแก้ไขปัญหา อำนวยความสะดวกต่างๆให้เราชีวิตประจำวันของเราได้มากกว่าที่เราคิด"
  },

  "section15": {
    "heading": "ประโยชน์ของ NB-IOT Motor Tacker",
    "description": "NB — IOT MOTOR TACKER",
    "list": [
      "รถยนต์/มอเตอร์ไซค์",
      "GPS ระบุพิกัดปัจจุบัน และเส้นทางที่เคยเดินทาง",
      "เมื่อรถสั่น (เมื่อขยับรถ) หรือรถเคลื่อนที่",
      "รถล้ม หรือคว่ำ",
      "กำหนดความเร็ว",
      "อุณหภูมิสูงเกินที่กำหนด",
      "เมื่อรถเข้าออกนอกพื้นที่ (100M — 10KM)"
    ]
  },

  "section16": {
    "heading": "NB-IOT ใกล้กว่าที่คุณคิด ?",
    "content": "จบไปแล้วครับกับหัวข้อของ NB-IOT หากมีข้อมูลที่ขาดตกบกพร่องไปสามารถร่วมแสดงความคิดเห็น แชร์ แลกเปลี่ยน ตกชม กันได้นะครับ หวังว่าบทความนี้จะเป็นประโยชน์ต่อผู้อ่านทุกคนนะครับ เป็นกำลังใจให้นะครับ"
  }
}
