{
    "title": "คู่บัญชี คืออะไร ?",
    "image1Description": "ระบบคู่บัญชีคืออะไร",
    "image2Description": "ระบบบัญชีเดี่ยว",
    "image3Description": "การบันทึกบัญชี ระบบบัญชีเดี่ยว",
    "image4Description": "ปัญหาของระบบบัญชีเดี่ยว",
    "image5Description": "ระบบบัญชีคู่คืออะไร",
    "image6Description": "การบันทึกบัญชี ระบบบัญชีคู่",
    "image7Description": "การบันทึกบัญชี ระบบบัญชีคู่ จำนวนบัญชีไม่เท่ากัน",
    "image8Description": "สมุดรายวันทั่วไป",
    "image9Description": "หมวดบัญชี บอกอะไรกับเรา",
    "image10Description": "หมวดบัญชี สินทรัพย์",
    "image11Description": "หมวดบัญชี หนี้สิน",
    "image12Description": "หมวดบัญชี ทุน(ส่วนของเจ้าของ)",
    "image13Description": "หมวดบัญชี รายได้",
    "image14Description": "หมวดบัญชี ค่าใช้จ่าย",
    "image15Description": "การบันทึก เครดิต เดบิต",
    "image16Description": "การใช้นิ้วมือในการจำการบันทึก เครดิต เดบิต",
    "image17Description": "ตัวอย่างการบันทึกบัญชี",
    "image18Description": "ตัวอย่างการบันทึกบัญชี",
    "image19Description": "ตัวอย่างบัญชีแยกประเภท",
    "image20Description": "ตัวอย่างการบันทึกบัญชี",
    "image21Description": "บัญชีเรื่องง่ายๆ (หรือเปล่า)",


    "section1": {
        "heading": "บทความนี้เรามาทำความรู้จัก ระบบคู่บัญชี Double Entry System กับเถอะ",
        "content": "บทความนี้เรามาทำความรู้จักเกี่ยวกับระบบบัญชีคู่ Double Entry System ซึ่งเราอาจจะเคยได้ยินคุ้นหูมาบ้างเกี่ยวกับ บัญชีคู่ คู่บัญชี เครดิต เดบิต แต่ถ้าเราได้ทำงานในที่เกี่ยวข้องกับบัญชี เราก็อาจจะยังไม่รู้ว่า ระบบบัญชีคู่ คืออะไร มีประโยชน์อย่างไร บทความนี้เราจะมาเรียนรู้ไปพร้อมกัน"
    },

    "section2": {
        "heading": "ระบบบัญชีเดี่ยว",
        "content": "ก่อนที่จะเรียนรู้เรื่องบัญชีคู่ เราต้องมาทำความรู้จักระบบบัญชีเดี่ยวก่อน ระบบบัญชีเดี่ยว Single entry bookkeeping or single — entry system เป็นการบัญทึกบัญชีเพียงด้านเดียว หรือนิยมเรียกว่าเป็นการบันทึกบัญชีที่ไม่สมบูรณ์ตามระบบบัญชีคู่ เช่น การบันทึกเฉพาะการรับเงินสด การบันทึกบัญชีเฉพาะการจ่ายเงินสด โดยไม่บันทึกบัญชีการซื้อ หรือการขาย จะเลือกบันทึกเฉพาะบัญชีที่เห็นว่าสำคัญ เราจะทราบว่าได้รับเงินสด จ่ายเงินสด แต่ไม่ทราบว่าได้รับเงินสดเนื่องจากอะไร (อะไรลดลง/อะไรเพิ่มขึ้น) จ่ายเงินสดเนื่องจากอะไร (อะไรลดลง/อะไรเพิ่มขึ้น)"
    },

    "section3": {
        "heading": "ตัวอย่างการบันทึกบัญชีเดี่ยว เราจะสนใจแค่บัญชีที่เราเห็นว่าสำคัญ",
        "content01": "Company A ทำการค้าขายกับ Company B โดย Company A ต้องการขายสินค้าให้กับ Company B และ Company B ต้องการชำระค่าสินค้าด้วยเงินสด",
        "content02": "ในมุมของ Company A จะบันทึกแค่ว่าได้รับเงินสด เพราะสนใจแค่ว่าขายสินค้าแล้วได้รับเงินหรือยัง แต่ Company A จะไม่ทราบเลยว่าสินค้าเหลือเท่าไหร่ ลดลงไปเท่าไหร่ เพราะไม่มีการบันทึกไว้ และอาจจะไม่สามารถติดตามรายการได้ด้วยว่า ยอดเงินสดที่รับเข้ามาเป็นการขายสินค้าอะไร กี่ชิ้น",
        "content03": "ในมุมของ Company B ที่ต้องการซื้อสินค้า สนใจเพียงว่าได้รับสินค้ามาแล้วหรือยัง จึงทำการบันทึกเพียงแค่ว่าได้รับสินค้ามาแล้วจำนวนเท่าไหร่ แต่ไม่ได้บันทึกว่าเงินสดลดลงเท่าไหร่"
    },

    "section4": {
        "heading": "ปัญหาของระบบบัญชีเดี่ยว",
        "content": "หลังจากทำความรู้จักกับบัญชีเดี่ยวแล้ว ทำให้เราเห็นช่องโหว่ของระบบบัญชีเดี่ยวมากมาย เช่น การบันทึกบัญชีทางเดียวอาจทำให้เกิดข้อผิดพลาดได้ ทำให้เกิดการฉ้อโกงได้ เป็นการบันทึกบัญชีที่ไม่สมบูรณ์ มีปัญหาในการบันทึกบัญชีเพิ่มทุนระหว่างปี อีกทั้งยังไม่สามารถติดตามยอดค้างรับ ค้างจ่ายได้"
    },

    "section5": {
        "heading": "ระบบบัญชีคู่คืออะไร",
        "content01": "ระบบบัญชีคู่ จึงเข้ามาแก้ไขปัญหาต่างๆของระบบบัญชีเดี่ยว โดยระบบบัญชีคู่จะทำการบันทึกบัญชีใน 2 ด้านเสมอ คือ ด้านเดบิต และด้านเครดิต ในจำนวนเงินที่เท่ากัน แต่ไม่จำเป็นต้องมีจำนวนบัญชีที่เท่ากัน เช่น",
        "content02": "หากเราซื้อสิ้นค้าจากบริษัทแห่งหนึ่งเป็นจำนวนเงิน 2,000 บาท เราก็ควรที่จะได้สินค้าที่มีมูลค่า 2,000 ก็จะบันทึกบัญชี เดบิต 2,000 เครดิต 2,000 ในจำนวนเงินที่เท่ากัน",
        "content03": "เราซื้อสินค้าจากบริษัทแห่งหนึ่ง 2,000 บาท โดยจ่ายเป็นเงินสด 1,000 บาท และจ่ายเป็นเงินเชื่อ 1,000 บาท หมายถึง เราได้สินค้ามูลค่า 2,000 บาท เราชำระเป็นเงินสด 1,000 บาท และเราติดหนี้ 1,000 บาท ทำให้จำนวนของบัญชีไม่เท่ากัน แต่ยอดเงินรวมยังคงเท่ากันเป็นต้น",
        "content04": "การบันทึกบัญชีแบบบัญชีคู่ที่ต้องบันทึก 2 ด้านเสมอ เพื่อป้องกันปัญหาการรวมรวมข้อมูล สามารถติดตามการทำรายการ และง่ายต่อการตรวจสอบความถูกต้องของบัญชี"
    },

    "section6": {
        "heading": "การบันทึกบัญชี ระบบบัญชีคู่",
        "content01": "ตัวอย่างในการบันทึกบัญชีแบบบัญชีคู่ เช่น Company A ทำการค้าขายกับ Company B โดย Company A ต้องการขายสินค้าให้กับ Company B และ Company B ต้องการชำระค่าสินค้าด้วยเงินสด",
        "content02": "ในมุมของ Company A จะบันทึกว่าได้รับเงินสด และมีสินค้าที่ลดลง",
        "content03": "ในมุมของ Company B ก็จะบันทึกว่า เงินสดลดลง และได้รับสินค้าเพิ่มขึ้น ทำให้เกิดการบันทึกแบบเป็นคู่",
        "content04": "Company A เงินสดเพิ่ม สินค้าลด",
        "content05": "Company B สินค้าเพิ่ม เงินสดลด"
    },

    "section7": {
        "heading": "ตัวอย่างการบันทึกบัญชีคู่ ที่มีจำนวนบัญชีไม่เท่ากัน",
        "content01": "Company A เงินสดเพิ่ม / ลูกหนี้เพิ่ม / สินค้าลด",
        "content02": "Company B สินค้าเพิ่ม / เจ้าหนี้เพิ่ม / เงินสดลด"
    },

    "section8": {
        "heading": "สมุดรายวันทั่วไป",
        "description": "จากตัวอย่างวันที่ 1 มกราคม ปี 2559 บริษัทแห่งหนึ่งได้ทำการซื้ออุปกรณ์สำนักงานเป็นเงินสดจำนวนเงิน 20,000 บาท ทำให้มีการบันทึกบัญชีเป็น",
        "list": [
            "เดบิต อุปกรณ์สำนักงาน จำนวนเงิน 20,000 บาท",
            "เครดิต เงินสด จำนวนเงิน 20,000 บาท"
        ]
    },

    "section9": {
        "heading": "หมวดบัญชี บอกอะไรกับเรา",
        "content": "หลักจากเรารู้แล้วว่าการบันทึกบัญชีแบบระบบบัญชีคู่คืออะไร มีการบันทึกอย่างไร แต่ก็ยังมีข้อสงสัยว่า แล้วอะไรที่จะบันทึกที่เดบิต อะไรที่จะบันทึกที่เครดิต คำตอบของคำถามนี้มีความเกี่ยวข้องกับหมวดบัญชี หมวดบัญชีคือการจัดหมวดหมู่ให้กับบัญชี โดยแบ่งออกเป็น สินทรัพย์ หนี้สิน ทุน(ส่วนของเจ้าของ) รายได้ และค่าใช้จ่าย เราสามารถหางบกำไรขาดทุนจาก หมวดรายได้ และหมวดค่าใช้จ่าย และยังสามารถหางบแสดงฐานะทางการเงิน (งบดุล) จากหมวดสินทรัพย์ หมวดหนี้สิน และหมวดทุนได้"
    },

    "section10": {
        "heading": "หมวดบัญชี สินทรัพย์",
        "content01": "หมวดสินทรัพย์แบ่งออกเป็น สินทรัพย์หมุนเวียน และ สินทรัพย์ไม่หมุนเวียน",
        "content02": "สินทรัพย์หมุนเวียน หมายถึง สินทรัพย์ที่สามารถเปลี่ยนเปลี่ยนเป็นเงินสดได้เร็ว (ปกติภายใน 1 ปี) สินทรัพย์ที่มีสภาพคล่อง ประกอบด้วย",
        "content03": "เงินสด (เงินฝาก) / วัสดุสำนักงาน / สินค้าคงเหลือ / ลูกหนี้การค้า / ตั๋วรับเงิน / เงินลงทุนระยะสั้น",
        "content04": "สินทรัพย์ไม่หมุนเวียน หมายถึง สินทรัพย์ที่มีไว้ในการครอบครองระยะเวลายาวนานกว่า 1 ปี รวมถึงสินทรัพย์ที่ไม่มีตัวตน ประกอบด้วย",
        "content05": "ที่ดิน / รถยนต์ / เครื่องจักร / ลิขสิทธิ์ / สิทธิบัตร / เงินลงทุนระยะยาว / เงินให้กู้ยืมระยะยาว"
    },

    "section11": {
        "heading": "หมวดบัญชี หนี้สิน",
        "content01": "หนี้สิน แบ่งออกเป็น หนี้สินหมุนเวียน และ หนี้สินไม่หมุนเวียน",
        "content02": "หนี้สินหมุนเวียน หมายถึง หนี้สินระยะสั้นที่ต้องชำระภายใน 1 ปี",
        "content03": "เจ้าหนี้การค้า / ตั๋วเงินจ่าย / ค่าเช่ารับล่วงหน้า / ภาษีค้างจ่าย / เงินปันผลค้างจ่าย / ค่า..ค้างจ่าย",
        "content04": "หนี้สินไม่หมุนเวียน หมายถึง หนี้สินที่มีระยะเวลาการชำระคืนเกินกว่า 1 ปี หรือเกินรอบระยะเวลาการดำเนินงานปกติของกิจการ",
        "content05": "เงินกู้ยืมระยะยาว / หุ้นกู้ระยะยาว / หนี้สินภาระผูกพัน / หนี้ตามสัญญาเช่า / หนี้สินอื่นๆ / หนี้เกิน 1 ปี"
    },

    "section12": {
        "heading": "หมวดบัญชี ทุน(ส่วนของเจ้าของ)",
        "content01": "ทุน (ส่วนของเจ้าของ) เป็นเงินที่นักลงทุนนำเงินตนเองเข้ามาใช้ในกิจการ",
        "content02": "สินทรัพย์ = หนี้สิน + ส่วนของเจ้าของ (ทุน)",
        "content03": "บัญชีทุน / ถอนใช้ส่วนตัว / ทุนหุ้นสามัญ / กำไรสะสม"
    },

    "section13": {
        "heading": "หมวดบัญชี รายได้",
        "description": "รายได้ (การเพิ่มขึ้นของสินทรัพย์ หรือลดลงของหนี้สิน)",
        "list": [
            "ประโยชน์เชิงเศรษฐกิจเพิ่มขึ้น ยอดขาย รายได้",
            "การเพิ่มมูลค่าของสินทรัพย์",
            "การลดลงของหนี้ ปรับโครงสร้างหนี้",
            "ทุนเพิ่ม สินทรัพย์เพิ่ม หนี้สินลด",
            "ไม่รวมเงินลงทุน เงินขายหุ้นเพิ่มทุน"
        ]
    },

    "section14": {
        "heading": "หมวดบัญชี ค่าใช้จ่าย",
        "description": "ค่าใช้จ่าย (การลดลงของสินทรัพย์ หรือเพิ่มขึ้นของหนี้สิน)",
        "list": [
            "ซื้อสินค้า จ่ายเงินเดือน จ่ายค่า…..",
            "มูลค่าสินทรัพย์ลดลง เช่น ที่ดินมูลค่าลดลง",
            "การเพิ่มขึ้นของหนี้สิน เช่น อัตราแลกเปลี่ยน",
            "ทุนลดลง สินทรัพย์ลดลง หนี้สินเพิ่มขึ้น",
            "ไม่รวมการจ่ายเงินปันผลให้กับเจ้าของ"
        ]
    },

    "section15": {
        "heading": "การบันทึก เครดิต เดบิต",
        "content01": "สินทรัพย์เพิ่ม เดบิต สินทรัพย์ลด เครดิต",
        "content02": "หนี้สินเพิ่ม เครดิต หนี้สินลด เดบิต",
        "content03": "ทุนเพิ่ม เดรดิต ทุนลด เดบิต",
        "content04": "รายได้เพิ่ม เดรดิต รายได้ลด เดบิต",
        "content05": "ค่าใช้จ่ายเพิ่ม เดบิต ค่าใช้จ่ายลด เดรดิต"
    },

    "section16": {
        "heading": "การใช้นิ้วมือในการจำการบันทึก เครดิต เดบิต",
        "content01": "สิ่งที่เราต้องจำเลยคือ แต่ละนิ้วแทนด้วยอะไร และต้องจำว่าโดยปกติแล้วจะแทนด้วยเดบิต หรือเครดิต ซึ่งก็คือ นิ้วโป้งและนิ้วก้อยแทนด้วยเดบิต นอกจากนั้นแทนด้วยเครดิต",
        "content02": "สินทรัพย์ แทนด้วยนิ้วโป้ง หากนิ้วกางออกปกติ หมายถึงสินทรัพย์เพิ่ม หากหักนิ้วเข้ามาหมายถึงสินทรัพย์ลด หากสินทรัพย์เพิ่ม ให้เพิ่มด้านเดิม หมายถึงเพิ่มเดบิต หากสินทรัพย์ลด ให้กลับด้านหมายถึงเครดิต",
        "content03": "และจำแบบนี้ในทุกๆนิ้ว หากเพิ่มให้เพิ่มด้านเดิม หากลด(หักนิ้ว) ให้เพิ่มด้านตรงข้าม"
    },

    "section17": {
        "heading": "ตัวอย่างการบันทึกบัญชี",
        "description": "บริษัท ABC ซื้ออุปกรณ์สำนักงาน 20,000 บาทเป็นเงินสด",
        "list": [
            "อุปกรณ์สำนักงาน เพิ่มขึ้น หมวด สินทรัพย์",
            "เงินสดลดลง หมวด สินทรัพย์"
        ]
    },

    "section18": {
        "heading": "ตัวอย่างการบันทึกบัญชี",
        "description": "บริษัท ABC ซื้ออุปกรณ์สำนักงาน 20,000 บาทเป็นเงินสด",
        "list": [
            "สินทรัพย์เพิ่ม ลง เดบิต",
            "ส่วนสินทรัพย์ลด ลง เครดิตที่"
        ]
    },

    "section19": {
        "heading": "ตัวอย่างบัญชีแยกประเภท",
        "content": "บัญชีแยกประเภทเราจะใช้สำหรับบันทึก ประเภทของบัญชีนั้นๆ เช่นดังตัวอย่างเป็นเลขบัญชี 101 บัญชีเงินสด เราจะบันทึกก็ต่อเมื่อมีการเพิ่มขึ้น หรือลดลงของบัญชีเงินสดเท่านั้น ทำให้เราสามารถทราบถึงสถานการณ์เงินสดของบริษัทได้"
    },

    "section20": {
        "heading": "ตัวอย่างการบันทึกสมุดรายวันทั่วไป",
        "content": "จะบันทึกรายการที่เกิดขึ้น ณ วันนั้นๆ เช่นดังตัวอย่างเป็นการซื้ออุปกรณ์สำนักงาน จำนวนเงิน 20,000 บาท เป็นเงินสด เป็นต้น"
    },

    "section21": {
        "heading": "บัญชี เป็นเพียง เรื่อง ง่ายๆ (หรือเปล่า)",
        "content": "สรุปความเข้าใจของระบบคู่บัญชี ฉบับ Software Developer หากมีข้อมูลที่ผิดพลาด สามารถร่วมแสดงความคิดเห็น แชร์ แลกเปลี่ยนกันได้ครับ เพราะบัญชีมันเป็นเรื่อง ง่ายๆ …. แหละ *-*"
    }
}