{
    "title": "สรุปหนังสือ ATOMIC HABITS",
    "image1Description": "หนังสือ Atomic Habits เพราะชีวิตดีได้กว่าที่เป็น",
    "image2Description": "การสร้างนิสัยที่ดีไม่ได้มองที่เป้าหมาย",
    "image3Description": "การสร้างนิสัยที่ดี โดยดูที่กระบวนการ",
    "image4Description": "วิธีการสร้างนิสัยที่ดี",
    "image5Description": "ทำให้เห็นชัดเจน",
    "image6Description": "ทำใหน่าดึงดูดใจ",
    "image7Description": "ทำให้รู้สึกง่าย",
    "image8Description": "ทำให้น่าพึงพอใจ",
    "image9Description": "ชีวิตดีขึ้นวันล่ะ 1 เปอร์เซ็นต์",
    "image10Description": "เพราะชีวิตคุณดีได้กว่าที่เป็น",
    "section1": {
        "heading": "Atomic Habits เพราะชีวิตดีได้กว่าที่เป็น",
        "content": "บทความนี้เราจะมาแชร์เกี่ยวกับหนังสือ ATOMIC HABITS เพราะชีวิตดีได้กว่าที่เป็น นับว่าเป็นหนังสือที่นักอ่านทุกคนต้องเคยได้ยิน ต้องเคยได้อ่าน หนังสือเล่มนี้เป็นเส้นทางสู่คำตอบว่าเราจะสร้างนิสัยที่ดีได้อย่างไร เราะจะมีชีวิตที่ดีกว่าที่เป็นได้อย่างไร"
    },
    "section2": {
        "heading": "การสร้างนิสัยที่ดีไม่ได้มองที่เป้าหมาย",
        "content": "โดยปกติในการสร้างนิสัยที่ดี เรามักจะมองที่เป้าหมายเป็นหลัก เช่น ฉันจะลดความอ้วน เราจะมองที่เป้าหมายว่า ฉันจะลดความอ้วน เรามองที่เป้าหมายจนลืมส่วนที่สำคัญที่สุด นั่นคือกระบวนการในการสู่เป้าหมายนั้นๆ ดังนั้นการสร้างนิสัยที่ได้ ไม่ได้มองที่เป้าหมาย แต่ให้มองที่กระบวนการ"
    },
    "section3": {
        "heading": "การสร้างนิสัยที่ดี โดยดูที่กระบวนการ",
        "content": "กระบวนการ ที่เราควรจะให้ความสำคัญยิ่งกว่าเป้าหมาย เริ่มจากการสร้าง พฤติกรรมเล็กๆให้เกิดขึ้น เมื่อทำพฤติกรรมเดิมซ้ำๆจะเกิดขึ้นเป็นนิสัย นิสัยที่ถูกสร้างขึ้นจากพฤติกรรมเล็กๆนี้จะนำพาสู่การเปลี่ยนชีวิตไปในทางที่ดีขึ้น เพราะการจะเปลี่ยนชีวิตให้ดีขึ้นได้นั้น เริ่มจากการเปลี่ยนแปลงพฤติกรรมเล็กๆในชีวิตประจำวันของเรา"
    },
    "section4": {
        "heading": "วิธีการสร้างนิสัยที่ดี",
        "description": "วิธีในการสร้างนิสัยที่ดี ในหนังสือ ATOMIC HABITS มีอยู่ 4 ขั้นตอนคือ",
        "list": [
            "ปัจจัยกระตุ้น -> ต้องทำให้เกิดปัจจัยกระตุ้นที่จะทำให้เกิดพฤติกรรมเล็กๆนี้ชัดเจน",
            "ความปรารถนา -> ต้องทำให้ความเกิดความดึงดูดใจ เกิดความปรารถนาในการทำ",
            "การตอบสนอง -> ต้องทำให้ง่าย ง่ายต่อการตอบสนอง",
            "รางวัล -> ต้องทำให้เกิดความพึงพอใจ จาการกระทำพฤติกรรมเล็กๆ"
        ]
    },
    "section5": {
        "heading": "ทำให้เห็นชัดเจน",
        "content": "ปัจจัยกระตุ้น -> ต้องทำให้เกิดปัจจัยกระตุ้นที่จะทำให้เกิดพฤติกรรมเล็กๆนี้ชัดเจน"
    },
    "section6": {
        "heading": "เราต้องทำให้พฤติกรรมที่เรากำลังจะทำนี้ชัดเจน ว่าเราจะทำอะไร ที่ไหน เวลาไหน",
        "content": "เช่น ฉันจะกระโดดตบเป็นเวลา 30 นาที ตอน 6 โมงเช้าที่หน้าบ้าน ซึ่งบอกทั้งกิจกรรมที่จะทำ บอกเวลาที่จะทำ และบอกสถานที่อย่างชัดเจน"
    },
    "section7": {
        "heading": "เราต้องเกิดการต่อยอดนิสัย เป็นการสร้างพฤติกรรมให้เกิดขึ้นต่อเนื่องกัน",
        "content": "เช่น หลังจากตื่นนอนตอนเช้า ฉันจะแปลงฟันทันที เป็นการสร้างพฤติกรรมว่าทุกวันที่ตื่นนอนสิ่งแรกที่ต้องทำเลยคือการ แปรงฟันทันที เป็นต้น"
    },
    "section8": {
        "heading": "เราต้องออกแบบสิ่งแวดล้อมให้อำนวยต่อพฤติกรรมที่จะเกิดขึ้น",
        "content": "เช่น ถ้าคุณอยากดื่มน้ำให้มากขึ้น ให้เติมน้ำใส่ขวดแล้ววางทั่วบ้าน เป็นการสร้างสิ่งแวดล้อมให้อำนวยต่อพฤติกรรมที่เราอยากจะเป็น"
    },
    "section9": {
        "heading": "ทำให้น่าดึงดูดใจ",
        "content": "ความปรารถนา -> ต้องทำให้ความเกิดความดึงดูดใจ เกิดความปรารถนาในการทำ"
    },
    "section10": {
        "heading": "ในการทำให้พฤติกรรมน่าดึงดูด เราควรจัดคู่สิ่งที่เราอยากทำ กับสิ่งที่เราต้องทำเข้าด้วยกัน",
        "content": "เช่น หลังจากที่ฉันเคลียร์งานเสร็จ ฉันจะดูทีวี เราจะตั้งหน้าตั้งตารอช่วงเวลาที่เราจะได้ดูทีวี และเกิดพฤติกรรมการเครียร์งานให้เสร็จ ซึ่งเป็นพฤติกรรมที่ดี"
    },
    "section11": {
        "heading": "การสร้างความเป็นส่วนหนึ่ง เพื่อให้เกิดความน่าดึงดูดใจ",
        "content": "เช่น ถ้าคุณอยากอ่านหนังสือ ก็ให้เข้าไปอยู่ในกลุ่มที่รีวิวหนังสือ เราจะเจอแต่สภาพแวดล้อม สื่อ ที่เกี่ยวกับหนังสือ จนเกิดความสนใจในการอ่านหนังสือ"
    },
    "section12": {
        "heading": "การสร้างแรงจูงใจ เชื่อมโยงกับความรู้สึกด้านบวก",
        "content": "เช่น การวิ่งตอนเช้า ให้คิดว่าไปสูดอากาศบริสุทธิ์เจอสาวๆใส่ชุดวิ่ง (อันนี้น่าจะใช้ได้ผล) เป็นการนำเอาพฤติกรรมที่เราอยากทำ เชื่อมโยงกับความรู้สึกด้านบวก เราจะเริ่มรู้สึกว่าอากาศตอนเช้าเหมาะกับการวิ่งมากๆ จนลืมไปเลยว่าการวิ่งนี้เหนี่อยแค่ไหน"
    },
    "section13": {
        "heading": "ทำให้รู้สึกง่าย",
        "content": "การตอบสนอง -> ต้องทำให้ง่าย ง่ายต่อการตอบสนอง"
    },
    "section14": {
        "heading": "ทำให้รู้สึกง่าย โดยการลดอุปสรรคที่จะทำให้สร้างพฤติกรรมที่ดี",
        "content": "เช่น ใส่ชุดวิ่งนอนเลย เพื่อตื่นขึ้นมาแล้วสามารถวิ่งได้เลย เป็นการลดอุปสรรคในการสร้างพฤติกรรมการวิ่ง"
    },
    "section15": {
        "heading": "ทำให้รู้สึกง่าย โดยการสร้างสิ่งแวดล้อมที่ดีในการสร้างพฤติกรรมที่ดี",
        "content": "เช่น วางผักไว้บนโต๊ะอาหาร และในตู้เย็น เป็นการสร้างสิ่งแวดล้อมที่ทำให้เราสามารถเข้าถึงผักได้ง่ายขึ้น เราสามารถหยิบกินได้เลย ง่ายๆ"
    },
    "section16": {
        "heading": "ทำให้รู้สึกง่าย โดยการใช้กฎ 2 นาทีในการสร้างพฤติกรรมที่ดี",
        "content": "เช่น จะอ่านหนังสือ 1 ชั่วโมง เปลี่ยนเป็น เริ่มอ่านหนังสือเพียง 1 หน้า เป็นการย่อยสิ่งที่ยากๆ สิ่งที่ใช้เวลานาน เป็นสิ่งทีสามารถทำได้ในเวลา 2 นาที เพราะการอ่านหนังสือ 1 ชั่วโมง อาจจะรู้สึกใช้เวลานาน รู้สึกยาก แต่ถ้าเราบอกว่าเราจะเริ่มอ่านหนังสือเพียง 1 หน้า ซึ่งอาจจะใช้เวลาเพียง 2 นาที เราจะเริ่มต้นได้ง่ายกว่า"
    },
    "section17": {
        "heading": "ทำให้น่าพึงพอใจ",
        "content": "รางวัล -> ต้องทำให้เกิดความพึงพอใจ จาการกระทำพฤติกรรมเล็กๆ"
    },
    "section18": {
        "heading": "ทำให้เกิดความพึงพอใจโดยการติดตามผลของนิสัย",
        "content": "เช่น ทำตารางปฎิทินง่ายๆ แล้วกากบาท ทำให้เห็นความก้าวหน้าของพฤติกรรม เป็นการติดตามผลของนิสัยและเกิดความพึงพอใจจากการเห็นความก้าวหน้าของพฤติกรรม"
    },
    "section19": {
        "heading": "ให้รางวัลกับตัวเองในทันที เพื่อเป็นการทำให้เกิดความน่าพึงพอใจ",
        "content": "เช่น อยากเลิกกินกาแฟแพง ลองเติมเงินเข้าบัญชีแทน โดยการเอาค่ากาแฟมาเก็บออมแทน แล้วเอาเงินเก็บนี้ซื้อของรางวัลตอบแทนตนเอง หรือหากเลิกกาแฟโดยตรงไม่ได้ เราอาจจะเริ่มจากดื่มกาแฟที่มีราคาถูกลง เก็บเงินส่วนต่างของการแฟที่ปกติเราดื่มกาแฟแพง แล้วนำเงินส่วนต่างนี้มาซื้อรางวัลให้กับตนเอง เป็นการทำให้เกิดความพึงพอใจจาการเปลี่ยนแปลงพฤติกรรมไปในแนวทางที่เราอยากจะเป็น และดีขึ้น"
    },
    "section20": {
        "heading": "อย่าพลาดพลั้งเป็นครั้งที่สอง",
        "content": "หากเราผิดพลาดเป็นครั้งแรกแล้ว เราควรจะระมัดระวังมากกว่านี้อย่าให้เกิดขึ้นเป็นครั้งที่สอง หากเราลืมในครั้งแรก ต้องมั่นใจว่าจะดึงตัวเองกลับมาในทันที"
    },
    "section21": {
        "heading": "ชีวิตดีขึ้นวันล่ะ 1 เปอร์เซ็นต์",
        "content": "1 เปอร์เซ็นต์ เป็นตัวเลขที่น้อยมากๆ ตามกฎของการเป็นคนที่ดีขึ้นเพียงวันล่ะ 1 เปอร์เซ็นต์ เราพบว่าใน 1 ปี เราจะดีกว่าเราในวันนี้มากถึง 37.78 เท่า ดังนั้นหากเราเปลี่ยนแปลงตัวเองเพียงเล็กน้อย เพียงวันล่ะ 1 เปอร์เซ็นต์ แค่นี้เราก็จะกลายเป็นเราในเวอร์ชันที่ดีกว่าเดิมถึง 37.78 เท่า"
    },
    "section22": {
        "heading": "ATOMIC HABITS เพราะชีวิตดีได้กว่าที่เป็น",
        "content": "บทความสรุปนี้ เพราะชีวิตคุณเองก็ดีได้กว่าที่เป็น หวังว่าจะเป็นแรงบัลดาลใจให้กับหลายๆคนได้ อย่าลืมไปหาหนังสือ ATOMIC HABITS มาดองกันด้วยนะครับ *-*"
    }
}