{
    "title": "การตรวจสอบเลขบัตรประชาชน ว่าเป็นเลขจริง หรือเลขปลอม",
    "image1Description": "ตรวจสอบเลขบัตรประชาชน",
    "image2Description": "ภาพจาก กรมการปกครอง กระทรวงมหาดไทย",
    "section1": {
        "heading": "รู้หรือไม่",
        "content": "รู้หรือไม่ เราสามารถตรวจสอบเลขประจำตัวประชาชน 13 หลัก ด้วยตนเองได้ว่าเลขทั้ง 13 หลักนี้เป็นเลขประจำตัวประชาชนปลอม หรือเป็นเลขประจำตัวประชาชนจริง"
    },
    "section2": {
        "heading": "เลขประจำตัวประชาชน 13 หลักของเรา แบ่งออกเป็น 5 ส่วนคือ",
        "content01": "ส่วนที่ 1 มีจำนวน 1 หลัก หลักแรก หมายถึง ประเภทของบุคคลที่ถือบัตรประชาชน ซึ่งมีทั้งหมด 8 ประเภท",
        "content02": "ส่วนที่ 2 มีจำนวน 4 หลัก หมายถึงสำนักทะเบียนที่ทำการออกเลขประจำตัวประชาชน แบ่งออกเป็น หลักที่ 2 - 3 หมายถึง จังหวัด หลักที่ 4 - 5 หมายถึง อำเภอ/เขต/เทศบาล/เมือง",
        "content03": "ส่วนที่ 3 และส่วนที่ 4 มีจำนวทั้งหมด 7 หลัก หมายถึง ลำดับของบุคคลในแต่ละประเภทของแต่ละสำนักทะเบียน",
        "content04": "ส่วนที่ 5 มี 1 หลัก หมายถึงเลขสำหรับตรวจสอบความถูกต้องของเลขประจำตัวประชาชนทั้งหมด"
    },
    "section3": {
        "heading": "ตัวเลขสำหรับตรวจสอบ",
        "content": "เมื่อเรารู้แล้วว่าส่วนที่ 5 ของเลขประจำตัวประชาชน หรือหลักสุดท้ายของเลขประจำตัวประชาชน เป็นหลักสำหรับตรวจสอบความถูกต้องของเลขประจำตัวประชาชนทั้งหมด หรือก็คือ ตัวเลขหลักที่ 13 เป็นตัวเลขสำหรับตรวจสอบเลข 12 หลักก่อนหน้าทั้งหมด"
    },
    "section4": {
        "heading": "การหาค่าของเลขหลักที่ 13",
        "content": "เมื่อเรารู้แล้วว่าหลักที่ 13 คือหลักตรวจสอบ เราก็สามารถหาค่าของเลขหลักที่ 13 ได้และสามารถรู้ได้ว่าตัวเลขก่อนหน้า 12 เลขเป็นตัวเลขที่ถูกต้องหรือไม่ ทำให้เราสามารถรู้ว่าตัวเลขบัตรประชาชนทั้ง 13 หลัก เป็นตัวเลขที่ถูกต้องหรือไม่"
    },

    "section5": {
        "heading": "ตัวอย่าง Algorithm ในการหาค่าหลักที่ 13 หรือการตรวจสอบเลขบัตรประจำตัวประชาชนว่าถูกต้องหรือไม่",
        "content01": "ตัวอย่าง Algorithm ในภาษา Python",
        "content02": "ตัวอย่าง Algorithm ในภาษา C#",
        "content03": "ตัวอย่าง Algorithm ในภาษา TypeScript"
    },


    "section6": {
        "heading": "เลขประจำตัวประชาชน 13 หลักของเราปลอดภัยแค่ไหน ?",
        "content": "จบไปแล้วครับกับการตรวจสอบเลขประจำตัวประชาชน หวังว่าบทความนี้จะเป็นประโยชน์ต่อผู้อ่านทุกคนนะครับ"
    }
}