{
  "title": "NAS คืออะไร ? RAID คืออะไร ?",

  "image1Description": "NAS Network Attached Storage",
  "image2Description": "Network Attached Storage",
  "image3Description": "Synology NAS",
  "image4Description": "NAS Connect",
  "image5Description": "NAS",
  "image6Description": "RAID",
  "image7Description": "Redundant Array Of Independent Disks",
  "image8Description": "RAID 0",
  "image9Description": "RAID 1",
  "image10Description": "RAID 5",
  "image11Description": "RAID 6",
  "image12Description": "RAID 10",
  "image13Description": "Synology Hybrid RAID",
  "image14Description": "NAS + RAID",

  "section1": {
    "heading": "NAS Network Attached Storage",
    "content01": "บทความนี้เรามาทำความรู้จัก NAS (network Attached Storage) ไปพร้อมกันครับ",
    "content02": "เพื่อให้เห็นถึงความสำคัญของ NAS เราต้องทำความรู้จักเกี่ยวกับ Cloud Storage ก่อนครับ Cloud Storage คือการเก็บข้อมูลบน Cloud หรือเรียนกันว่าการเก็บข้อมูลไว้บนอินทอร์เน็ต แต่เราไม่สามารถรู้ได้เลยว่าข้อมูลที่เราเก็บไว้บน Cloud นั้น ถูกเก็บไว้บน Sever ที่ไหนบนโลกนี้ ส่งผลให้อาจมีความเสี่ยงในเรื่องของความปลอดภัยของข้อมูล",
    "content03": "NAS เข้ามาแก้ไขปัญหานี้โดย NAS ก็คืออุปกรณ์จัดเก็บข้อมูลชนิดหนึ่ง คล้ายกับ External Hard Disk แต่จะสามารถแชร์ข้อมูลไว้บนเครือข่ายได้ ถ้าจะเปรียบเทียบง่ายๆ NAS ก็คือ Cloud Storage แบบหนึ่ง แต่เราเป็นเจ้าของ Hardware เองเลย ถ้าเราปิดเครื่อง Hardware เราก็จะไม่สามารถเข้าถึงข้อมูลผ่านเครือข่ายได้ เราจึงสามารถรักษาความปลอดภัยของข้อมูลเราได้"
  },

  "section2": {
    "heading": "Network Attached Storage",
    "content": "ถ้าให้สรุปนิยามของ NAS แบบสั้นๆกระชับ NAS คือ อุปกรณ์จัดเก็บข้อมูล บนเครือข่ายรูปแบบหนึ่ง"
  },

  "section3": {
    "heading": "Synology NAS",
    "content": "และนี่คือตัวอย่างหน้าตา NAS ของ Synology ซึ่งจะมีหลายขนาดให้เลือกตามความต้องการใช้งาน และมีระบบในการจัดการ Hard Disk ที่เป็นจุดเด่นเฉพาะตัวของ Synology เองอีกด้วย"
  },

  "section4": {
    "heading": "NAS Connect",
    "content": "ในการเชื่อมต่อ NAS เข้ากับ Internet ดังรูปตัวอย่าง เป็นการนำเอา NAS ต่อเข้ากับ Router เสมือนอุปกรณ์คอมพิวเตอร์เครื่องหนึ่ง จากนั้นก็สามารถเข้าถึงข้อมูลบน NAS ได้จาก Internet ทั่วทุกมุมโลก"
  },

  "section5": {
    "heading": "ทำไมเราถึงต้องใช้ NAS ?",
    "content01": "NAS ช่วยเพิ่มพื้นที่ในการจัดเก็บข้อมูล เช่น ในคอมพิวเตอร์ของเราอาจมีพื้นที่ในการเก็บข้อมูลที่จำกัด การใช้ NAS จึงเป็นอีกทางเลือกหนึ่งในการเพิ่มพื้นที่ในการจัดเก็บข้อมูล และยังสามารถเข้าถึงข้อมูล แชร์ข้อมูล ได้สะดวกเพิ่มขึ้นอีกด้วย",
    "content02": "NAS สามารถเข้าถึงได้ง่าย เมื่อผู้ใช้งานจำเป็นต้องใช้ข้อมูลเดียวกัน ทุกคนก็สามารถใช้งานข้อมูลบน NAS พร้อมกันได้เลย",
    "content03": "NAS สามารถควมคุมสิทธิ์การเข้าถึงข้อมูล โดยสามารถกำหนดได้ว่า ใครสามารถเข้าถึงข้อมูลอะไรได้บ้าง เพิ่มความปลอดภัยให้กับข้อมูลบน NAS",
    "content04": "NAS สามารถสตรีมวิดีโอได้ NAS สามารถใช้งานเสมือน Hard Disk ได้ นอกจากนี้ยังสามารถใช้ในการบันทึกวิดีโอจากกล้องวงจรได้อีกด้วย",
    "content05": "NAS สามารถสำรองข้อมูลอัตโนมัติ โดยมีระบบในการสำรองข้อมูลจาก Hard Disk ลูกหนึ่ง ไปยัง Hard Disk อีกลูกหนึ่งได้ และเมื่อ Hard Disk ลูกใดลูกหนึ่งเสีย ก็ยังมี Hard Disk ที่สำรองข้อมูลไว้ ทำให้สามารถกู้ข้อมูลกลับมาได้ทั้งหมด",
    "content06": "NAS สามารถใช้สำหรับรองรับการใช้งาน ระบบมัลติมีเดียภายในบ้านของเราได้ หรืออีกคำนิยามของ NAS คือ NAS เป็นระบบคลาวด์ส่วนตัวและศูนย์มัลติมีเดีย",
    "content07": "NAS มีความปลอดภัยสูง เนื่องจากเราเป็นผู้ควบคุม Hardware เอง ดังนั้นเราก็เป็นคนควบคุมข้อมูลทั้งหมดบน NAS ของเรา เสมือนเราเป็นเจ้าของข้อมูลเลยแบบ 100%",
    "content08": "NAS สามารถใช้งานผ่านออนไลน์ได้ เราสามารถเข้าถึง NAS ผ่านระบบ Internet ได้จากทั่วทุกมุมโลก"
  },

  "section6": {
    "heading": "NB",
    "content": "หลักจากเรารู้จัก NAS แล้ว และยังรู้อีกด้วยว่า NAS คือการนำเอา Hard Disk หลายๆตัวมาต่อเข้ากัน คำถามคือแล้วเราจะบริหารจัดการ Hard Disk เหล่านั้นได้หรือไม่ จะบริหารจัดการข้อมูลใน Hard Disk หลายๆตัวได้ยังไง เรามาเรียนรู้เรื่องของ RAID ไปพร้อมกันครับ"
  },
  
  "section7": {
    "heading": "Redundant Array Of Independent Disks",
    "content": "RAID ย่อมาจาก Redundant Array Of Independent Disks การต่อดิสก์หลายตัวให้ทำงานร่วมกัน หมายถึงการนำเอา Hard Disk หลายๆตัวต่อเข้ากันและการทำให้ Hard Disk สามารถทำงานร่วมกันได้"
  },

  "section8": {
    "heading": "RAID 0",
    "content": "RAID 0 ดังภาพด้านบน จะเห็นว่าข้อมูลถูกแบ่งเก็บใน Disk ทั้งสองตัว เป็นการนำเอาข้อมูลมากระจายเก็บบน Disk ทุกตัว RAID 0 นี้ไม่เหมาะสมในการเก็บข้อมูลในระยะยาว เนื่องจากไม่มีการสำรองข้อมูล ข้อดีคือ ประสิทธิภาพในการค้นหาข้อมูลจะเร็วกว่าการเก็บข้อมูลไว้ใน Disk เดียว เพราะเราสามารถค้นหาข้อมูลจาก Disk หลายๆตัวได้พร้อมๆกัน แต่ข้อเสียก็คือ Disk ห้ามเสียเด็ดขาดเพราะจะทำให้ข้อมูลไม่สมบูรณ์ ไม่ครบถ้วน แต่ก็จะได้ความจุเท่ากับความจุของ Disk ทั้งหมดรวมกัน"
  },

  "section9": {
    "heading": "RAID 1",
    "content": "RAID 1 ดังภาพด้านบน เป็นการเก็บข้อมูลแบบมีการสำรองข้อมูล เหมาะกับการเก็บข้อมูลสำคัญ เพราะเมื่อ Disk ใด Disk หนึ่งเสีย ก็ยังจะมีการสำรองข้อมูลบน Disk ที่ยังไม่เสียหาย ทำให้เราสามารถสำรองข้อมูลใหม่ได้ แต่ข้อเสียคือจะได้ความจุน้อยลงและได้จำนวนความจุเท่ากับ จำนวนความจุทั้งหมด หารด้วย 2"
  },

  "section10": {
    "heading": "RAID 5",
    "content": "RAID 5 ดังภาพด้านบน (RAID 5 ต้องมี Disk อย่างน้อย 3 ตัว) จะเห็นว่าข้อมูลชุด A มีการเก็บไว้ที่ Disk 0 — Disk 3 คือ A1 A2 A3 และ Ap (Parity) ความหายคือ Disk 0 Disk 1 และ Disk 2 เป็นการต่อแบบ RAID 0 มีความเร็วทั้งการอ่าน และการเขียน ส่วน Disk 3 เก็บ Ap (Parity) คือการเก็บ Parity ในการกูคือข้อมูลของชุด A เป็น RAID ที่นิยมมากที่สุด เพราะได้ทั้งความปลอดภัยและความจุที่เยอะ Disk สามารถเสียได้ 1 Disk โดยข้อมูลไม่สูญหาย เนื่องจากยังสามารถกูคือข้อมูลจาก Ap (Parity) ได้ ข้อเสียคือเราจะเสียพื้นที่ Disk 1 ลูก ในการจัดเก็บ Ap (Parity) และความจุรวมทั้งหมดจะได้เท่ากับ ความจุของ Disk x (จำนวน Disk — 1)"
  },

  "section11": {
    "heading": "RAID 6",
    "content": "RAID 6 ดังภาพด้านบน RAID 6 จะมีการทำงานเหมือนกับ RAID แต่จะเก็บ Ap ไว้ที่ Disk 2 ลูก เหมาะกับข้อมูลที่มีความสำคัญมากๆ ข้อดีคือ Disk สามารถเสียได้สูงสุด 2 ลูกโดยที่ยังสามารถกู้คืนข้อมูลได้ ข้อเสียคือเราจะเสียพื้นที่ Disk 2 ลูกในการเก็บ Ap และความจุรวมทั้งหมดจะได้เท่ากับ ความจุของ Disk x (จำนวน Disk — 2)"
  },

  "section12": {
    "heading": "RAID 10",
    "content": "RAID 10 ดังภาพด้านบน เป็นการนำเอากาต่อแบบ RAID 1 กับการต่อแบบ RAID 0 จะมีทั้งการสำรองข้อมูล และมีประสิทธิภาพในการอ่านเขียน ทำให้สามารถอ่านเขียนได้เร็ว และยังมีการสำรองข้อมูลไว้ด้วย ข้อเสียคือจะสูญเสียความจุไปครึ่งหนึ่ง เนื่องจากต้องทำการสำรองข้อมูล และความจุรวมจะเท่ากับ Disk x จำนวน Disk / 2"
  },

  "section13": {
    "heading": "Synology Hybrid RAID",
    "content": "SHR RAID ย่อมาจาก Synology Hybrid Raid เป็นเทคโนโลยี RAID ของทาง Synology ซึ่งทำให้เราสามารถใส่ Disk ความจุที่ไม่เท่ากันได้"
  },

  "section14": {
    "heading": "NAS + RAID",
    "content": "จบไปแล้วครับกับหัวข้อของ NAS และ RAID หากมีข้อมูลที่ขาดตกบกพร่องไปสามารถร่วมแสดงความคิดเห็น แชร์ แลกเปลี่ยน ติชม กันได้นะครับ หวังว่าบทความนี้จะเป็นประโยชน์ต่อผู้อ่านทุกคนนะงับบบบบ"
  }
}
