{
  "title": "IoT Internet of Things คืออะไร ?",

  "image1Description": "INTERNET OF THINGS",
  "image2Description": "Machine To Machine",
  "image3Description": "IoT != Software JOIN Hardware",
  "image4Description": "What is Internet of Things",
  "image5Description": "Example Internet of Things",
  "image6Description": "Smart City",
  "image7Description": "เราอยู่ในยุคของ Smart….",
  "image8Description": "สรุปเปรียบเทียบ Internet Of Thing",
  "image9Description": "แล้วคุณ ให้คำนิยามของ IoT ว่าอย่างไร ?",

  "section1": {
    "heading": "เกริ่นนำ",
    "content": "ในยุคที่เศรษฐกิจโลกถูกขับเคลื่อนด้วยเทคโนโลยีอย่างรวดเร็วนี้ คงปฏิเสธว่า IoT กลายเป็นส่วนหนึ่งของชีวิตประจำวันเราไปแล้ว แต่ก็อาจเป็นเรื่องใหม่สำหรับหลายคน บทความนี้จะพาคุณไปสัมผัส เรียนรู้ และท่องไปยังโลกของ IoT Internet of Things"
  },

  "section2": {
    "heading": "Iot คืออะไร",
    "content": "IoT ย่อมาจากคำว่า Internet of Things หรือในภาษาไทยเราอาจเคยเห็นคนเรียกว่า อินเทอร์เน็ตทุกสรรพสิ่ง อินเทอร์เน็ตในทุกสรรพสิ่ง อินเทอร์เน็ตประสานสรรพสิ่ง อินเทอร์เน็ตในทุกสิ่ง และชื่อเรียกอื่นๆอีกมากมาย ไม่ว่าชื่อจะมีความแตกต่างกันมากเพียงใด หัวใจหลักของ IoT เลยก็คือ อินเทอร์เน็ต และ ทุกสิ่ง (สรรพสิ่ง) หากเราได้ยิน 2 คำหลักๆนี้ เราสามารถตีความหมายได้เลยว่า สิ่งนี้คือ IoT Internet of Things เพราะทุกสรรพสิ่งจะเชื่อต่อเข้าหากันด้วยอินเทอร์เน็ต"
  },

  "section3": {
    "heading": "Machine To Machine",
    "content": "หากจะให้มองภาพของ IoT แบบง่ายๆเลย IoT คือการเชื่อมโยงอุปกรณ์อัจฉริยะต่างๆ ผ่านอินเทอร์เน็ต การเชื่อมโยงระหว่าง Machine To Machine ซึ่ง Machine อาจเป็นเครื่องอะไรบางอย่างที่เรารู้จักหรือใช้กันในชีวิตประจำวันอยู่แล้ว แต่อาจยังไม่มีความสามารถในการเชื่อต่อกับอินเตอร์เน็ต การที่เราทำให้ Machine เครื่องหนึ่งสามารถสื่อสารกับ Machine อีกเครื่องหนึ่งผ่านอินเตอร์เน็ตได้ เช่น Smart Home, Smart City, Smart Device นั่นคือจุดเริ่มต้นกับยุคสมัยของอินเทอร์เน็ตในทุกสรรพสิ่ง"
  },

  "section4": {
    "heading": "IoT != Software JOIN Hardware",
    "content01": "หากบอกว่า IoT คือการที่ Machine สามารถสื่อสารกับ Machine ได้ แสดงว่า Machine ก็หมายถึง Hardware และ Software หรือเปล่า ?",
    "content02": "หลายคนอาจเข้าใจผิดว่า IoT คือ อุปกรณ์ Hardware ที่มี Software เป็นโปรแกรมหรือชุดคำสั่ง IoT = Hardware + Software",
    "content03": "แต่ในความเป็นจริงแล้ว IoT ไม่ได้ประกอบด้วยเพียง Hardware ที่เป็นอุปกรณ์ต่างๆและ Software สำหรับโปรแกรมชุดคำสั่งเท่านั้น IoT ยังประกอบด้วย Connectivity เป็นมาตรฐานในการเชื่อต่อข้อมูลต่างๆสำหรับอุปกรณ์ Data ข้อมูลต่างๆที่ได้จากอุปกรณ์ เป็นข้อมูลในการติดต่อสื่อสารอาจเก็บไว้บน Cloud เพื่อสามารถนำมาประยุกต์ใช้งานต่อไปได้ และ Intelligence AI เพื่อเพิ่มความสามารถให้กับระบบและนำข้อมูลต่างๆที่เก็บไว้บน Cloud ไปใช้ประโยชน์ได้สูงสุด"
  },

  "section5": {
    "heading": "What is Internet of Things",
    "content01": "อุปกรณ์เบื้องต้นสำหรับเรียนรู้และพัฒนา IoT ที่ง่ายต่อการเรียนรู้ พัฒนา และได้รับความนิยมเลยก็คือ บอร์ด Raspberry Pi และ บอร์ด Arduino บอร์ดนี้ก็เสมือนเครื่องคอมพิวเตอร์ขนาดเล็กที่เอาไว้ประมวลผลข้อมูลต่างๆและทำงานตามโปรแกรมที่เราได้กำหนดไว้",
    "content02": "คอมพิวเตอร์ที่เราใช้งานอยู่ประจำทุกวันนั้น เราต้องมีการต่อเมาส์ คีย์บอร์ด สำหรับ Input ข้อมูล และต่อจอแสดงผลสำหรับ Output ข้อมูล ในบอร์ด Raspberry Pi และ บอร์ด Arduino ก็เหมือนกัน โดยข้อมูล Input อาจเป็นข้อมูลจาก Senser อะไรบ้างอย่าง เช่น การตรวจจับการเคลื่อนไหว การวัดอุณหภูมิ การวัดความเข้มแสง เป็นต้น เมื่อบอร์ดได้รับข้อมูล Input แล้ว บอร์ดจะทำการประมวลผลข้อมูลและทำงานตามโปรแกรมที่เราได้กำหนดไว้ เราอาจตั้งค่าข้อมูล Output เป็นการสั่งการให้ Servo ทำงาน หรือมอเตอร์ทำงานเป็นต้น"
  },

  "section6": {
    "heading": "Example Internet of Things",
    "description": "ตัวอย่างระบบ IoT ในชีวิตประจำวัน",
    "list": [
      "Smart Home",
      "Smart Wearable",
      "Smart City",
      "Smart Grids",
      "Connected Car",
      "Smart Retail",
      "Smart Supply chain",
      "Smart Farming"
    ]
  },

  "section7": {
    "heading": "Smart City",
    "content": "ปัจจุบัน IoT ไม่ได้เป็นเพียงแนวคิดเท่านั้น แต่เกิดขึ้นจริงแล้วในหลายประเทศ และต้นแบบการประยุกต์ใช้ IoT เป็นเมือง Smart City ของโลกเลยก็คือ บาร์เซโลน่า โดยระบบ Smart Parking สามารถสร้างมูลค่าได้มากถึง 50 ล้านเหรียญต่อปี และ Smart Light สามารถสร้างมูลค่าได้มากถึง 37 ล้านเหรียญต่อปี นอกจากนี้ยังมีระบบอื่นๆอีกเช่น ระบบรดน้ำต้นไม้ โดยตรวจวัดจากเซนเซอร์วัดความชื้นในดิน วัดอุณหภูมิ วัดแสดงอาทิตย์ เพื่อคำนวณหาปริมาณน้ำที่เหมาะสม ระบบจัดการขยะอัจฉริยะ การติดเซนเซอร์ในถึงขยะ เมื่อขยะเต็มจะส่งสัญญาณให้รถเก็บขยะทราบ ระบจักรยานสาธารณะ การให้บริการจักรยานสาธารณะผ่านแอปพลิเคชันในมือถือ ระบบโดยสารประจำทาง การใช้รถไฮบริดในการลดมลภาวะ การใช้ IoT ในการติดตามเส้นทางเดินรถ เพื่อสามารถบอกเวลาของรถคันถัดไปได้"
  },

  "section8": {
    "heading": "เราอยู่ในยุคของ Smart….",
    "content01": "หากเราลองสังเกต IoT ที่อยู่ในชีวิตประจำวันของเรา ตั้งแต่ตื่นนอนจนเข้านอนเราจะพบว่า IoT อยู่รอบๆตัวเราจริงๆ",
    "content02": "เมื่อเราตื่นตอน อุปกรณ์ IoT สามารถตรวจจับการตื่นนอนของเราพร้อมทั้งสั่งการ เปิดไฟ เปิดม่าน ต้มกาแฟ เปิดทีวี อัตโนมัติได้ เมื่อเราออกจากบ้านไปทำงาน เราสามารถเช็ครอบรถ ตำแหน่งรถ จากระบบ IoT ที่ติดไว้บนรถได้ เราสามารถล็อกประตูบ้าน/เปิดล็อกประตูบ้าน ปิดแอร์ ราวเก็บผ้าเมื่อฝนตก สั่งงานผ่านมือถือได้ เราสามารถแกนนิ้วแทนการใช้กุญแจ รับการแจ้งเตือนเมื่อกล้องวงจรตรวจจับความผิดปกติ ระบบปรับแสง เปิดไฟ เปิดแอร์อัตโนมัติ จะเห็นได้ว่าเราเข้าสู่ยุคของ IoT แล้วจริงๆ ถึงแม้เราอาจจะไม่รู้ตัว"
  },

  "section9": {
    "heading": "สรุปเปรียบเทียบ Internet Of Thing",
    "content": "ถึงแม้ว่า IoT จะมีข้อดีอยู่มากมาย แต่ก็ยังมีข้อจำกัดอยู่หลายๆอย่าง เช่น อุปกรณ์จำเป็นต้องพึ่งพา Internet ต้องคำนึงถึงความปลอดภัยของข้อมูล และอาจมีข้อผิดพลาดเนื่องจากอุปกรณ์ได้ (Hardware)"
  },

  "section10": {
    "heading": "แล้วคุณ ให้คำนิยามของ IoT ว่าอย่างไร ?",
    "content": "จบไปแล้วครับกับหัวข้อของ IoT หากมีข้อมูลที่ขาดตกบกพร่องไปสามารถร่วมแสดงความคิดเห็น แชร์ แลกเปลี่ยน ตกชม กันได้นะครับ หวังว่าบทความนี้จะเป็นประโยชน์ต่อผู้อ่านทุกคนนะครับ เป็นกำลังใจให้นะครับ"
  }
}
