{
    "title": "Work Assign Tracking : ระบบบริหารจัดการงานก่อสร้างด้วยแนวคิด Agile และ Mds",

    "image1Description": "แพลตฟอร์มบริหารจัดการงานก่อสร้างที่เปลี่ยนแผนงานที่ซับซ้อนให้เป็น Task รายวัน เพื่อการควบคุมงบประมาณและเวลาที่แม่นยำ",
    
    "section1": {
        "heading": "แรงบันดาลใจ",
        "content": "การบริหารงานก่อสร้างมักประสบปัญหาความซับซ้อนและควบคุมได้ยาก ผมจึงนำประสบการณ์จากการพัฒนาซอฟต์แวร์มาประยุกต์ใช้ โดยนำแนวคิดการจัดการแบบ Man-days (Mds) มาย่อยงานใหญ่ให้กลายเป็น Task ที่ต้องจบภายใน 1 วัน พร้อมระบบวางแผนและประเมินผลทุก 1-2 สัปดาห์ (Sprint) เพื่อให้การบริหารงานก่อสร้างสามารถควบคุมได้ทั้งกรอบเวลาและงบประมาณอย่างมีประสิทธิภาพสูงสุด"
    },

    "section2": {
        "heading": "แนวคิดและการออกแบบ",
        "content": "ระบบถูกออกแบบมาเพื่อการวางแผนเชิงรุก โดยประกอบด้วยฟีเจอร์การสร้าง Task และ Sub-task การจัดการฐานข้อมูลแรงงาน และการ Assign งานรายบุคคล มี Dashboard สรุปแผนงานภาพรวม (Master Plan) เทียบกับงานที่ทำได้จริงในแต่ละวัน ระบบสามารถตรวจสอบประวัติการทำงานย้อนหลังของแรงงานแต่ละคน พร้อมสรุปสถิติการใช้ทรัพยากรบุคคลและเวลา เพื่อวิเคราะห์ว่าโครงการกำลังดำเนินไปตามแผนหรือล่าช้ากว่าที่กำหนด"
    },

    "section3": {
        "heading": "ความท้าทายและทางแก้",
        "content": "ความท้าทายหลักคือสภาพหน้างานจริงที่มักมีการเปลี่ยนแปลงแผนกะทันหันและความไม่สะดวกในการใช้งานคอมพิวเตอร์ ผมจึงออกแบบระบบให้มีความยืดหยุ่นสูง (High Flexibility) และรองรับการใช้งานผ่านมือถือเพื่อความคล่องตัว นอกจากนี้ผมยังได้ทดสอบสมมติฐานก่อนพัฒนาจริงด้วยการใช้ระบบบันทึกภาพกระดานวางแผนรายวัน เพื่อรวบรวม Data Point มาวิเคราะห์หาจุดที่เกิดปัญหาบ่อยที่สุด ทำให้การพัฒนาระบบสามารถแก้ปัญหาได้ถูกจุดและใช้งานได้จริงในสภาวะหน้างานที่กดดัน"
    },

    "section4": {
        "heading": "โอกาสในการพัฒนาต่อยอด",
        "content": "ในอนาคตระบบนี้สามารถยกระดับสู่ 'Integrated Construction Management' ที่รวบรวมระบบลงเวลาทำงานออนไลน์ (E-Attendance) การคำนวณ OT และค่าแรงอัตโนมัติ ไปจนถึงการบริหารจัดการงบประมาณค่าวัสดุอุปกรณ์แบบครบวงจร เพื่อให้ข้อมูลทุกส่วนของโครงการก่อสร้างถูกจัดเก็บอย่างเป็นระบบระเบียบในที่เดียว ช่วยให้ผู้บริหารสามารถตัดสินใจบนพื้นฐานของข้อมูล (Data-Driven Decision) ได้อย่างแม่นยำ"
    },

    "gallery": {
        "heading": "รูปเพิ่มเติม"
    }   
}