{
    "title": "Give Me My Money : ระบบบริหารจัดการหนี้สินและดอกเบี้ยแบบบุคคลต่อบุคคล",

    "image1Description": "เว็บแอปพลิเคชันสำหรับติดตามสถานะการกู้ยืมและคำนวณดอกเบี้ยแบบไดนามิกเพื่อสร้างวินัยทางการเงิน",
    
    "section1": {
        "heading": "แรงบันดาลใจ",
        "content": "โปรเจกต์นี้เริ่มต้นจาก Pain Point ในการบริหารจัดการการยืมเงินระหว่างบุคคล (Peer-to-Peer Lending) ซึ่งมักพบปัญหาเรื่องความเกรงใจและการติดตามสถานะหนี้ที่ไม่มีมาตรฐาน ผมจึงมีแนวคิดที่จะสร้างระบบเพื่อเปลี่ยนการยืมเงินแบบเดิมให้เป็นรูปแบบ 'สินเชื่อย่อยที่มีกลไกดอกเบี้ย' เพื่อสร้างวินัยทางการเงินและลดความอึดอัดใจของทั้งสองฝ่าย โดยมุ่งเน้นการแก้ปัญหาความซับซ้อนในการคำนวณเมื่อมีการยืมเพิ่มและทยอยคืนหลายครั้งในเวลาที่ต่างกัน (Staggered Transactions) ซึ่งต้องมีการปันส่วนยอดชำระไปที่ดอกเบี้ยก่อนเงินต้น (Interest-first Allocation) ทำให้การจดบันทึกทั่วไปทำได้ยากและเสี่ยงต่อความผิดพลาด"
    },

    "section2": {
        "heading": "แนวคิดและการออกแบบ",
        "content": "ผมได้เปลี่ยนผ่านการทำงานจาก Excel Template ที่ใช้งานยาก มาสู่การพัฒนาเป็น Responsive Web Application ที่เข้าถึงได้ง่ายผ่านมือถือ โดยหัวใจของระบบคือ 'Dynamic Interest Engine' ที่ทำหน้าที่บันทึกทุก Transaction อย่างละเอียด ระบบสามารถคำนวณยอดหนี้คงเหลือแยกเงินต้นและดอกเบี้ยแบบ Real-time ณ วันที่ทำรายการ ช่วยให้ผู้ใช้งานเห็นภาพรวมของกระแสเงินทุน (Capital) ยอดค้างชำระทั้งหมด และผลกำไรจากดอกเบี้ยที่ได้รับอย่างชัดเจนภายใต้อินเตอร์เฟซที่เรียบง่ายและตรวจสอบได้"
    },

    "section3": {
        "heading": "ความท้าทายและทางแก้",
        "content": "ความท้าทายสำคัญคือการออกแบบระบบจัดเก็บข้อมูล (Data Persistence) ที่ต้องรักษาสมดุลระหว่างความสะดวกและความปลอดภัยของข้อมูลส่วนบุคคล ผมจึงเลือกแนวทาง 'Serverless Data Portability' โดยให้ผู้ใช้สามารถส่งออกและนำเข้าไฟล์ข้อมูล (Portable Data File) เพื่อใช้งานในครั้งถัดไป วิธีนี้ช่วยลดต้นทุนด้านฐานข้อมูลและเพิ่มความเป็นส่วนตัวของข้อมูลผู้ใช้ได้อย่างสูงสุด นอกจากนี้ยังเน้นความโปร่งใสด้วยฟีเจอร์ 'Payment Report' ที่สรุปยอดการคำนวณออกมาในรูปแบบรูปภาพที่แชร์ต่อได้ทันที เพื่อสร้างมาตรฐานและความน่าเชื่อถือในการเรียกเก็บเงิน"
    },

    "section4": {
        "heading": "โอกาสในการพัฒนาต่อยอด",
        "content": "ในอนาคต ระบบนี้สามารถยกระดับสู่การเป็น 'Credit Scoring Analytics' โดยนำข้อมูลประวัติการชำระเงินมาวิเคราะห์พฤติกรรม (Behavioral Finance) เช่น ความตรงต่อเวลาหรือยอดชำระเฉลี่ย เพื่อนำมาคำนวณเป็นคะแนนเครดิตประกอบการตัดสินใจพิจารณาวงเงินในครั้งถัดไป รวมถึงการเพิ่มระบบแจ้งเตือนอัตโนมัติเมื่อใกล้ถึงกำหนดชำระ ซึ่งจะช่วยให้ระบบมีความสมบูรณ์ในฐานะเครื่องมือบริหารจัดการความเสี่ยง (Risk Management) สำหรับการกู้ยืมในระดับบุคคลอย่างเต็มรูปแบบ"
    },

    "gallery": {
        "heading": "รูปเพิ่มเติม"
    }   
}