{
    "title": "S-Power : ระบบลา (Line LIFF) สำหรับองค์กร",

    "image1Description": "ระบบลา (Line LIFF) สำหรับองค์กร",

    "section1": {
        "heading": "แรงบันดาลใจ",
        "content": "S-Power เป็นระบบหลักในการ Tracking การทำงานและบริหารจัดการการลาของพนักงาน ซึ่งเดิมทีถูกจำกัดให้ใช้งานได้เฉพาะบนเว็บเบราว์เซอร์เท่านั้น ในสถานการณ์จริง เช่น การลาป่วยฉุกเฉิน พนักงานมักประสบปัญหาความไม่สะดวกในการเข้าถึงระบบผ่านคอมพิวเตอร์ ผมจึงได้รับมอบหมายให้เป็นผู้รับผิดชอบในการยกระดับประสบการณ์การใช้งาน (UX) โดยเปลี่ยนรูปแบบการลางานและการอนุมัติให้สามารถทำได้ง่ายๆ ผ่านสมาร์ทโฟน เพื่อให้สอดคล้องกับพฤติกรรมการใช้งานจริงและเพิ่มความรวดเร็วในการสื่อสารภายในองค์กร"
    },

    "section2": {
        "heading": "แนวคิดและการออกแบบ",
        "content": "ผมเลือกใช้เทคโนโลยี LINE LIFF (LINE Front-end Framework) แทนการพัฒนา Native App เพื่อลดความซับซ้อนในการติดตั้งและการดูแลรักษาบน App Store/Play Store โดยดึงจุดแข็งที่พนักงานทุกคนใช้ LINE ในการสื่อสารอยู่แล้วมาประยุกต์ใช้ ออกแบบหน้าเว็บเป็น Responsive ที่เชื่อมต่อกับอัตลักษณ์ของผู้ใช้ (User Mapping) ทำให้พนักงานสามารถล็อกอินและลางานได้ทันทีผ่านห้องแชท พร้อมระบบแจ้งเตือนผ่าน Line Flex Message ที่มีดีไซน์สวยงามและอ่านข้อมูลง่าย เพื่อให้หัวหน้างานสามารถกดอนุมัติการลาได้จากหน้าจอมือถือโดยตรง"
    },

    "section3": {
        "heading": "ความท้าทายและทางแก้",
        "content": "ความท้าทายหลักคือข้อจำกัดของโควตาการส่งข้อความบน LINE Official Account แบบฟรี ซึ่งหากมีการใช้งานจำนวนมากอาจทำให้ต้นทุนสูงขึ้น ผมจึงแก้ไขปัญหาด้วยการออกแบบระบบแจ้งเตือนแบบ 'Dual Channel' โดยใช้ Email เป็นช่องทางหลักควบคู่ไปกับ Flex Message การทำเช่นนี้ช่วยให้ระบบยังคงทำงานได้อย่างสมบูรณ์และเชื่อถือได้แม้ในกรณีที่โควตาข้อความ LINE เต็ม เป็นการบริหารจัดการทรัพยากรที่มีอยู่อย่างจำกัดให้เกิดประสิทธิภาพสูงสุด (Cost Optimization) โดยไม่กระทบต่อ Workflow ของผู้ใช้งาน"
    },

    "section4": {
        "heading": "โอกาสในการพัฒนาต่อยอด",
        "content": "ปัจจุบันระบบลาผ่าน LIFF ถูกใช้งานจริงและกลายเป็นมาตรฐานใหม่ของบริษัทในการสื่อสารเรื่องงาน โดยมีการพัฒนาส่วนเสริมอย่างต่อเนื่อง เช่น ระบบ Check-in หน้างาน และการตรวจสอบภารกิจ (Task Tracking) ของทีมแบบ Real-time ข้อมูลที่รวบรวมได้จากการลาและการทำงานจะถูกนำไปวิเคราะห์ร่วมกันเพื่อใช้ในการบริหารจัดการทรัพยากรบุคคล (Resource Management) ต่อไป ซึ่งพิสูจน์ให้เห็นว่าการเลือกใช้เทคโนโลยีที่ถูกจุดสามารถสร้าง Impact ให้กับองค์กรได้มหาศาลภายใต้ต้นทุนที่เหมาะสม"
    },  

    "gallery": {
        "heading": "รูปเพิ่มเติม"
    }  
}