{
    "title": "Corporate Storyteller: บันทึกภาพสะท้อนวัฒนธรรมและภาพลักษณ์องค์กร",

    "image1Description": "การบันทึกภาพบรรยากาศกิจกรรมและการผลิตวิดีโอคอนเทนต์ภายในบริษัท",
    
    "section1": {
        "heading": "ที่มาและความตั้งใจ",
        "content": "ผมเชื่อว่าภาพถ่ายและวิดีโอคือเครื่องมือสื่อสารที่ทรงพลังที่สุดในการเล่าเรื่องวัฒนธรรมองค์กร (Company Culture) ความตั้งใจของผมคือการเป็นผู้บันทึกช่วงเวลาสำคัญและถ่ายทอดบรรยากาศความสุข ความสำเร็จ และความเป็นมืออาชีพของบริษัท เพื่อใช้เป็นสื่อกลางในการสร้างความผูกพันภายในและสร้างภาพลักษณ์ที่ดีต่อบุคคลภายนอกที่เข้ามาศึกษาดูงาน"
    },

    "section2": {
        "heading": "บทบาทและการลงมือทำ",
        "content": "ผมรับหน้าที่เป็นช่างภาพและผู้ผลิตวิดีโอคอนเทนต์ (Video Creator) ประจำกิจกรรมต่างๆ ตั้งแต่การต้อนรับคณะศึกษาดูงานและนักศึกษาฝึกงาน การบันทึกภาพกิจกรรมสันทนาการและการท่องเที่ยวประจำปี ไปจนถึงการดูแลกระบวนการผลิตวิดีโอคอนเทนต์แบบครบวงจร ตั้งแต่การวางสคริปต์ (Scriptwriting) การจัดหามุมกล้องที่สื่อความหมาย จนถึงการถ่ายทำจริง เพื่อให้ได้เนื้อหาที่ตรงตามโจทย์ของแต่ละกิจกรรมมากที่สุด"
    },

    "section3": {
        "heading": "ความท้าทาย",
        "content": "ความท้าทายสำคัญคือการ 'จับจังหวะ' (Candid Moments) ที่สื่อถึงอารมณ์ความรู้สึกที่แท้จริงของผู้เข้าร่วมงาน ท่ามกลางสภาพแวดล้อมที่ควบคุมยาก เช่น แสงในสถานที่ หรือความรวดเร็วของเหตุการณ์ นอกจากนี้ยังต้องใช้ทักษะการกำกับและสื่อสารเพื่อให้ผู้ถูกถ่ายรู้สึกผ่อนคลายและเป็นธรรมชาติ รวมถึงการวางโครงเรื่องวิดีโอให้กระชับ แต่น่าสนใจในเวลาที่มีจำกัด"
    },

    "section4": {
        "heading": "ผลลัพธ์และเกิดการเรียนรู้",
        "content": "ผลงานภาพถ่ายและวิดีโอของผมถูกนำไปใช้เป็นสื่อหลักในช่องทางสื่อสารภายในและ Social Media ของบริษัท ซึ่งช่วยเสริมสร้าง Employer Branding ให้แข็งแกร่งยิ่งขึ้น ประสบการณ์นี้ทำให้ผมเรียนรู้ทักษะการเล่าเรื่องผ่านภาพ (Visual Storytelling) และการสื่อสารเชิงสร้างสรรค์ผ่านสคริปต์วิดีโอ ซึ่งช่วยให้ผมสามารถถ่ายทอดคุณค่าของงานและองค์กรออกมาได้อย่างชัดเจนและมีศิลปะ"
    },

    "gallery": {
        "heading": "คลังภาพกิจกรรมและตัวอย่างผลงานวิดีโอคอนเทนต์"
    }  
}