{
    "title": "Unified Corporate Live Streaming: เชื่อมต่อการสื่อสารองค์กรผ่านระบบไลฟ์สดเต็มรูปแบบ",

    "image1Description": "การควบคุมระบบถ่ายทำ ตัดต่อ และการสตรีมมิ่งกิจกรรมผ่าน Microsoft Teams",
    
    "section1": {
        "heading": "ที่มาและความตั้งใจ",
        "content": "ในองค์กรที่มีสาขากระจายตัวอยู่ทั่วประเทศ การสื่อสารกิจกรรมภายในให้พนักงานทุกคนได้รับรู้และมีส่วนร่วมพร้อมกันเป็นเรื่องสำคัญมาก ผมจึงได้รับมอบหมายให้ดูแลระบบ Live Stream สำหรับกิจกรรมบริษัท โดยมีเป้าหมายหลักคือการทลายข้อจำกัดด้านสถานที่ และสร้างประสบการณ์การรับชมที่ลื่นไหลเหมือนพนักงานทุกคนนั่งอยู่ในห้องเดียวกัน (Inclusive Experience) ตั้งแต่เริ่มจนจบโครงการ"
    },

    "section2": {
        "heading": "บทบาทและการลงมือทำ",
        "content": "ผมรับผิดชอบดูแลระบบ Production แบบครบวงจร (End-to-End) ตั้งแต่การออกแบบโครงสร้างระบบภาพและเสียงภายในห้องจัดงาน (On-site) ไปจนถึงการจัดการระบบ Streaming ผ่าน Microsoft Teams เพื่อส่งสัญญาณไปยังสาขาต่างๆ นอกจากนี้ยังควบตำแหน่ง Content Creator ในการบันทึกภาพและตัดต่อวิดีโอเพื่อใช้เป็นสื่อประชาสัมพันธ์หลักภายในกิจกรรม ช่วยเพิ่มความน่าสนใจและทำให้เนื้อหาของกิจกรรมถูกถ่ายทอดออกมาได้อย่างเป็นมืออาชีพ"
    },

    "section3": {
        "heading": "ความท้าทาย",
        "content": "ความท้าทายสำคัญคือการบริหารจัดการความเสถียรของสัญญาณภาพและเสียงแบบ Real-time ซึ่งต้องทำงานร่วมกับระบบ Network ขององค์กรเพื่อให้มั่นใจว่าการเข้าชมพร้อมกันจำนวนมากจะไม่เกิดปัญหาทางเทคนิค นอกจากนี้ยังต้องแก้ปัญหาเฉพาะหน้าในส่วนของ Audio Feedback และการ Sync ลำดับภาพและสไลด์ให้ตรงกับเนื้อหาที่วิทยากรกำลังนำเสนอ เพื่อให้ผู้ชมทั้งทางออนไลน์และออนไซต์ได้รับข้อมูลที่ถูกต้องแม่นยำที่สุด"
    },

    "section4": {
        "heading": "ผลลัพธ์และเกิดการเรียนรู้",
        "content": "ระบบ Live Stream นี้ช่วยให้พนักงานตามสาขาต่างๆ สามารถเข้าถึงกิจกรรมของบริษัทได้แบบ 100% เพิ่มอัตราการมีส่วนร่วม (Engagement) ของพนักงานได้อย่างมีนัยสำคัญ จากการทำงานนี้ผมได้พัฒนาทักษะการเป็น Video Director และความเข้าใจเชิงลึกในระบบ Hybrid Event ซึ่งเป็นทักษะที่จำเป็นอย่างยิ่งในยุคการทำงานแบบ Digital Transformation ทำให้ผมมั่นใจในการวางระบบสื่อสารมัลติมีเดียที่ซับซ้อนในอนาคต"
    },

    "gallery": {
        "heading": "เบื้องหลังการควบคุมระบบ Hybrid Event และผลงานการตัดต่อวิดีโอ"
    }  
}