{
    "title": "Design Thinking for Startup: ปฏิรูปกระบวนการคิด เพื่อสร้างผลิตภัณฑ์ที่ตอบโจทย์ผู้ใช้จริง",

    "image1Description": "การเวิร์กชอปกระบวนการ Design Thinking ร่วมกับวิทยากรผู้เชี่ยวชาญในแวดวง Startup",
    
    "section1": {
        "heading": "ที่มาและความตั้งใจ",
        "content": "การสร้างซอฟต์แวร์ที่ประสบความสำเร็จไม่ได้เริ่มจาก Code ที่สวยงาม แต่เริ่มจาก 'ความเข้าใจในปัญหา' ของผู้ใช้อย่างลึกซึ้ง ผมจึงเข้าร่วมรับการอบรมหัวข้อ Design Thinking เพื่อเรียนรู้หลักการคิดแบบเป็นระบบสำหรับการพัฒนา Software Startup โดยตั้งเป้าหมายที่จะนำกระบวนการนี้มาใช้ตรวจสอบ (Validate) ไอเดียของผมว่าสามารถตอบโจทย์ทางธุรกิจและแก้ปัญหา (Pain Points) ให้กับผู้ใช้งานได้จริงหรือไม่ ก่อนที่จะเริ่มลงมือพัฒนา"
    },

    "section2": {
        "heading": "บทบาทและการลงมือทำ",
        "content": "ผมได้ลงมือฝึกฝนตามกระบวนการ Design Thinking อย่างครบวงจร ตั้งแต่ขั้นตอน Empathize เพื่อเข้าใจปัญหา, Define เพื่อระบุประเด็นสำคัญ, จนถึงขั้น Ideate เพื่อระดมสมองหาทางออกที่สร้างสรรค์ โดยผมได้นำไอเดียโครงการ Startup ของตัวเองมาวิเคราะห์จุดด้อยผ่านมุมมองของวิทยากรผู้มีประสบการณ์จริง เพื่อเฟ้นหาแนวทางการปรับปรุงและกำหนดข้อมูลที่จำเป็นต้องค้นคว้าเพิ่มเติม เพื่อให้มั่นใจว่ารากฐานของ Product นั้นแข็งแกร่งพอที่จะแข่งขันได้ในตลาด"
    },

    "section3": {
        "heading": "ความท้าทาย",
        "content": "ความท้าทายที่สำคัญที่สุดคือการ 'ละทิ้งความเชื่อเดิม' (Unlearn) และความมั่นใจในไอเดียแรกของตัวเอง เพื่อเปิดรับข้อมูลใหม่ๆ จากการทำ User Research การต้องกล้ายอมรับว่าไอเดียบางส่วนอาจจะยังไม่ตอบโจทย์ (Not Work) และต้องพร้อมที่จะปรับปรุง (Pivot) ตามหลักการ Design Thinking เป็นแบบทดสอบทางความคิดที่ช่วยให้ผมมองเห็นจุดบอดและช่องว่างที่เคยมองข้ามไปได้อย่างชัดเจน"
    },

    "section4": {
        "heading": "ผลลัพธ์และเกิดการเรียนรู้",
        "content": "การอบรมครั้งนี้มอบ 'เข็มทิศ' ในการพัฒนาผลิตภัณฑ์ให้กับผมอย่างล้ำค่า ผมได้รับความเข้าใจว่าผลิตภัณฑ์ที่ยอดเยี่ยมคือจุดตัดของความต้องการของผู้ใช้ (Desirability), ความเป็นไปได้ทางเทคนิค (Feasibility) และความยั่งยืนทางธุรกิจ (Viability) ประสบการณ์นี้ไม่เพียงแต่พัฒนาทักษะการคิดเชิงสร้างสรรค์ของผม แต่ยังทำให้ผมสามารถออกแบบ Framework ในการพัฒนา Product อื่นๆ ในอนาคตให้เป็นระบบและลดความเสี่ยงจากการลงทุนที่สูญเปล่าได้"
    },

    "gallery": {
        "heading": "ภาพกิจกรรมการระดมสมองและการสร้างต้นแบบไอเดีย (Prototyping)"
    }  
}