{
    "title": "The Dual Finalist: การผ่านเข้ารอบ 12 ทีมสุดท้าย ด้วย 2 ไอเดียเชิงกลยุทธ์ในโครงการ Tuek Som Garage",

    "image1Description": "ความสำเร็จในการนำเสนอไอเดียที่ผ่านการคัดเลือกสู่รอบ 12 ทีมสุดท้ายจากผู้เข้าแข่งขันทั่วทั้งองค์กร",
    
    "section1": {
        "heading": "ที่มาและความตั้งใจ",
        "content": "จากโครงการ Tuek Som Garage ที่เปิดรับไอเดียนวัตกรรมกว่า 130 โครงการทั่วทั้งกลุ่มบริษัท ผมตั้งเป้าหมายที่จะนำเสนอโซลูชันที่ไม่เพียงแค่แก้ปัญหาในปัจจุบัน แต่ต้องมีศักยภาพในการเติบโตเป็นธุรกิจใหม่ได้ ด้วยความตั้งใจที่จะพิสูจน์ว่าแนวคิดที่ผ่านการวิเคราะห์มาอย่างดีจะสามารถตอบโจทย์คณะกรรมการและองค์กรได้จริง ผมจึงทุ่มเทให้กับการวางโครงสร้างไอเดียที่เน้นทั้งนวัตกรรมและความเป็นไปได้ในเชิงพาณิชย์"
    },

    "section2": {
        "heading": "บทบาทและการลงมือทำ",
        "content": "ผมรับหน้าที่เป็น Leader ในการปั้นไอเดียตั้งแต่วันแรก โดยผลงานของผมสามารถฝ่าด่านการคัดเลือกที่เข้มข้นจนผ่านเข้ารอบ 12 ทีมสุดท้ายได้ถึง 2 ไอเดีย ซึ่งนับเป็นสัดส่วนที่สูงมากเมื่อเทียบกับจำนวนผู้ส่งทั้งหมด หน้าที่ถัดมาของผมคือการจัดตั้งทีม (Team Formation) เพื่อระดมสมองและเตรียมพร้อมสำหรับการเข้าสู่กระบวนการ Bootcamp อบรมเข้มข้น และการพัฒนาตัวแบบธุรกิจ (MVP) เพื่อเตรียมตัวเข้าสู่รอบ Pitching ในระดับถัดไป"
    },

    "section3": {
        "heading": "ความท้าทาย",
        "content": "ความท้าทายสำคัญคือการบริหารจัดการ '2 โครงการ' พร้อมกันในมาตรฐานระดับสูง เพราะแต่ละไอเดียมีกลุ่มเป้าหมายและโมเดลธุรกิจที่ต่างกันสิ้นเชิง ผมต้องใช้ทักษะการบริหารเวลา (Time Management) และการคิดเชิงวิเคราะห์ (Analytical Thinking) เพื่อลงลึกในรายละเอียดของทั้งสองทีมอย่างเท่าเทียมกัน รวมถึงการสร้างความเชื่อมั่นให้กับสมาชิกในทีมเพื่อให้ทุกคนมองเห็นภาพเป้าหมายเดียวกันภายใต้แรงกดดันของการแข่งขัน"
    },

    "section4": {
        "heading": "ผลลัพธ์และเกิดการเรียนรู้",
        "content": "การที่ไอเดียของผมได้รับเลือกถึง 2 ใน 12 ทีมสุดท้าย เป็นบทพิสูจน์ถึงทักษะการออกแบบโมเดลธุรกิจ (Business Design) ที่แม่นยำและการมองเห็นโอกาสที่ผู้อื่นอาจมองข้าม ประสบการณ์นี้สอนให้ผมเรียนรู้ถึงความสำคัญของการทำ Validation หรือการตรวจสอบสมมติฐานทางธุรกิจ และพัฒนาทักษะการเป็นผู้นำที่ต้องขับเคลื่อนนวัตกรรมไปพร้อมๆ กับการสร้างขวัญและกำลังใจให้กับทีมงาน"
    },

    "gallery": {
        "heading": "ภาพประกาศผลผู้เข้ารอบ 12 ทีมสุดท้ายและการฟอร์มทีมทำงาน"
    }  
}