{
    "title": "Tuek Som Garage: เบื้องหลังการขับเคลื่อน Startup Incubator ภายในองค์กร",

    "image1Description": "บรรยากาศการจัดงานแข่งขันและระบบ Production ในโครงการ Tuek Som Garage",
    
    "section1": {
        "heading": "ที่มาและความตั้งใจ",
        "content": "Tuek Som Garage เป็นโครงการบ่มเพาะ Startup ภายในกลุ่มบริษัทที่เปิดโอกาสให้พนักงานส่งไอเดียเพื่อแก้ปัญหาทางธุรกิจและสร้างผลิตภัณฑ์ใหม่ โดยมีเป้าหมายคัดเลือกไอเดียที่ยอดเยี่ยมที่สุดจากพนักงานทั่วประเทศมาพัฒนาเป็น Product จริง ความตั้งใจของผมในโปรเจกต์นี้คือการสร้างพื้นที่ (Platform) ทั้งในเชิงกายภาพและออนไลน์ เพื่อให้พนักงานที่มีไอเดียและผู้บริหารได้มาปฏิสัมพันธ์กันอย่างมีประสิทธิภาพที่สุด ท่ามกลางกระแสตอบรับที่ล้นหลามจากพนักงานที่ส่งไอเดียเข้ามามากกว่า 130 โครงการ"
    },

    "section2": {
        "heading": "บทบาทและการลงมือทำ",
        "content": "ผมรับหน้าที่เป็น STAFF หลักในส่วน Production และ Infrastructure ของโครงการ ตั้งแต่ช่วงการคัดเลือก 12 ทีมสุดท้าย ไปจนถึงช่วงการอบรมเข้มข้น (Bootcamp) ในหัวข้อต่างๆ เช่น การทำ MVP, Marketing และการเงิน บทบาทของผมคือการควบคุมดูแลระบบแสง สี เสียง บนเวทีเพื่อสร้างบรรยากาศที่กระตุ้นความคิดสร้างสรรค์ รวมถึงการจัดทำสื่อประชาสัมพันธ์โครงการ และที่สำคัญที่สุดคือการวางระบบ Live Streaming คุณภาพสูงเพื่อให้พนักงานในสาขาต่างจังหวัดสามารถเข้าร่วมสังเกตการณ์และรับฟังองค์ความรู้จากวิทยากรไปพร้อมๆ กับคนในส่วนกลางได้"
    },

    "section3": {
        "heading": "ความท้าทาย",
        "content": "ความท้าทายหลักคือการบริหารจัดการกิจกรรมที่มีความต่อเนื่องยาวนานและมีรายละเอียดซับซ้อน ตั้งแต่การจัดการคิววิทยากรหลายท่าน ไปจนถึงการจัดเตรียมสถานที่สำหรับการระดมสมองของทั้ง 12 ทีมในเวลาเดียวกัน นอกจากนี้ยังมีความท้าทายในด้านการสื่อสารให้พนักงานจำนวนมากเห็นภาพความคืบหน้าของโครงการอย่างต่อเนื่อง และการควบคุมมาตรฐานระบบออนไลน์ไม่ให้เกิดข้อผิดพลาดในช่วงเวลาสำคัญของการ Pitching ซึ่งเป็นวินาทีตัดสินของผู้เข้าแข่งขัน"
    },

    "section4": {
        "heading": "ผลลัพธ์และเกิดการเรียนรู้",
        "content": "โครงการประสบความสำเร็จอย่างสูงในการสร้างวัฒนธรรม Startup ภายในองค์กร โดยเราสามารถคัดเลือกไอเดียที่มีศักยภาพสูงสุดเข้าสู่กระบวนการพัฒนาเป็นผลิตภัณฑ์จริงได้สำเร็จ กิจกรรมนี้ทำให้ผมได้เรียนรู้กระบวนการสร้าง Business Unit ใหม่ตั้งแต่ศูนย์ (Zero to One) ผ่านมุมมองของ Startup และยังได้พัฒนาทักษะการจัดการงานระดับ Organizer ที่ต้องประสานงานกับผู้บริหารระดับสูงและคนจำนวนมาก ซึ่งเป็นรากฐานสำคัญในการบริหารจัดการโครงการเชิงกลยุทธ์ในอนาคต"
    },

    "gallery": {
        "heading": "บรรยากาศการอบรมและการแข่งขัน Pitching Day"
    }  
}