{
    "title": "Tuek Som Garage: ก้าวสู่ 10 ทีมสุดท้ายผ่านการสอบสัมภาษณ์และคัดเลือกโมเดลธุรกิจอย่างเข้มข้น",

    "image1Description": "บรรยากาศการสอบสัมภาษณ์นำเสนอแผนธุรกิจต่อคณะกรรมการผู้เชี่ยวชาญในโครงการ Tuek Som Garage",
    
    "section1": {
        "heading": "ที่มาและความตั้งใจ",
        "content": "การก้าวเข้าสู่รอบ 10 ทีมสุดท้ายของโครงการ Tuek Som Garage ไม่ใช่เพียงแค่การนำเสนอไอเดียที่น่าสนใจ แต่คือการพิสูจน์ความแข็งแกร่งของโมเดลธุรกิจและความเป็นไปได้ในการสร้าง Product จริง ผมมีความตั้งใจที่จะเปลี่ยนสมมติฐานให้กลายเป็นตัวเลขและแผนงานที่ชัดเจน เพื่อแสดงให้คณะกรรมการเห็นว่าแนวคิดที่ผมนำเสนอนั้นสามารถตอบโจทย์ทางธุรกิจของกลุ่มบริษัทได้จริงและมีความคุ้มค่าในการลงทุน"
    },

    "section2": {
        "heading": "บทบาทและการลงมือทำ",
        "content": "ในรอบคัดเลือกนี้ ผมได้รับบทบาทสำคัญในการเป็นผู้นำเสนอแผนธุรกิจ (Pitcher) โดยต้องเตรียมข้อมูลเชิงลึกในทุกมิติ ตั้งแต่การวิเคราะห์กลุ่มเป้าหมาย (Target Audience) ไปจนถึงแผนการสร้างรายได้ ผมได้เข้าสอบสัมภาษณ์ต่อหน้าคณะกรรมการผู้เชี่ยวชาญเพื่อตอบข้อซักถามเชิงลึกเกี่ยวกับจุดคุ้มทุน ความเสี่ยง และโอกาสในการขยายตัวของธุรกิจ จนสามารถชนะใจกรรมการและพาสมาชิกในทีมผ่านเข้าสู่รอบ 10 ทีมสุดท้ายได้สำเร็จ"
    },

    "section3": {
        "heading": "ความท้าทาย",
        "content": "ความท้าทายสูงสุดคือการรับมือกับการสอบสัมภาษณ์ที่เข้มข้น (Intensive Interview) ซึ่งต้องใช้ไหวพริบและการตัดสินใจที่เฉียบคมในการตอบคำถามเชิงเทคนิคและเชิงธุรกิจในเวลาที่จำกัด ผมต้องทำหน้าที่ในการรวบรวมข้อมูลดิบที่มีอยู่มาสรุปเป็น Key Messages ที่ทรงพลัง และต้องแสดงให้เห็นถึงความพร้อมของทีมที่จะเข้าสู่กระบวนการ Training และการลงมือพัฒนาจริงในระดับถัดไป"
    },

    "section4": {
        "heading": "ผลลัพธ์และเกิดการเรียนรู้",
        "content": "การผ่านเข้ารอบ 10 ทีมสุดท้ายถือเป็นการยืนยันศักยภาพในด้านการคิดเชิงกลยุทธ์ (Strategic Thinking) ของผมได้เป็นอย่างดี ประสบการณ์นี้ทำให้ผมได้เรียนรู้ความสำคัญของการทำ Market Survey และกระบวนการคิดแบบ Startup ที่เน้นความรวดเร็วแต่แม่นยำ นอกจากนี้ยังได้รับโอกาสอันล้ำค่าในการเข้าร่วม Bootcamp เพื่อรับการเทรนนิ่งจากวิทยากรระดับมืออาชีพ ซึ่งเป็นพื้นฐานสำคัญในการพัฒนา Product สู่ตลาดจริงต่อไป"
    },

    "gallery": {
        "heading": "ภาพความประทับใจจากการประกาศผล 10 ทีมสุดท้ายและการเตรียมตัวเข้าสู่รอบ Bootcamp"
    }  
}