{
    "title": "TaladHub Development: จากไอเดียสู่แพลตฟอร์มบริหารจัดการตลาดและอีเวนต์ครบวงจร",

    "image1Description": "ขั้นตอนการออกแบบและพัฒนา Full-stack Platform สำหรับระบบ TaladHub",
    
    "section1": {
        "heading": "ที่มาและความตั้งใจ",
        "content": "หลังจากประสบความสำเร็จในการนำทีมผ่านเข้าสู่รอบ 6 ทีมสุดท้ายของโครงการ Tuek Som Garage ผมได้ขับเคลื่อนโครงการเข้าสู่ช่วงการพัฒนา (Development Phase) อย่างเต็มรูปแบบ ภายใต้ชื่อ 'TaladHub' โดยตั้งเป้าหมายที่จะเปลี่ยนชุดข้อมูลและ Solution ที่ได้จากการลงพื้นที่จริง ให้กลายเป็นซอฟต์แวร์ที่ใช้งานได้จริง (Functional Product) เพื่อยกระดับมาตรฐานการบริหารจัดการตลาดและงานอีเวนต์ให้มีความเป็นดิจิทัลและมีประสิทธิภาพสูงสุด"
    },

    "section2": {
        "heading": "บทบาทและการลงมือทำ",
        "content": "ผมรับบทบาทควบทั้ง Product Owner (PO) และ Developer โดยเป็นผู้กำหนดทิศทางของผลิตภัณฑ์ (Product Roadmap) และรวบรวมทีมพัฒนาที่มีความเชี่ยวชาญ ผมได้ออกแบบและพัฒนาระบบในรูปแบบ Multi-platform ประกอบด้วย Web Platform สำหรับการบริหารจัดการหลังบ้านของเจ้าของตลาด และ LIFF (LINE Front-end Framework) เพื่อเป็นช่องทางหลักในการสื่อสารและให้บริการแก่พ่อค้าแม่ค้า รวมถึงผู้มาใช้บริการตลาด เพื่อให้ระบบสามารถเข้าถึงได้ง่ายและตอบโจทย์การใช้งานในสภาวะหน้างานจริง"
    },

    "section3": {
        "heading": "ความท้าทาย",
        "content": "ความท้าทายสำคัญคือการบริหารทรัพยากรและเวลาเพื่อให้ได้ผลิตภัณฑ์ที่มีคุณภาพภายใต้เส้นตายของการแข่งขัน ผมต้องตัดสินใจในเชิงเทคนิคที่ซับซ้อนเพื่อให้ระบบมีความเสถียร รองรับการใช้งานพร้อมกันจำนวนมาก และต้องมั่นใจว่า User Interface (UI) นั้นง่ายต่อการเรียนรู้สำหรับกลุ่มผู้ใช้งานที่หลากหลาย ตั้งแต่ผู้บริหารไปจนถึงพ่อค้าแม่ค้าหน้าแผง การรักษาสมดุลระหว่างฟีเจอร์ที่ต้องการ (Scope) และระยะเวลาที่จำกัด (Timeline) จึงเป็นบททดสอบทักษะการบริหารจัดการโปรเจกต์อย่างมาก"
    },

    "section4": {
        "heading": "ผลลัพธ์และเกิดการเรียนรู้",
        "content": "เราสามารถพัฒนาต้นแบบผลิตภัณฑ์ที่สมบูรณ์และพร้อมสำหรับการทดสอบใช้งานจริง (UAT) ได้สำเร็จ ซึ่งถือเป็นก้าวสำคัญที่จะนำไปสู่การแข่งขันในรอบถัดไป ประสบการณ์นี้ทำให้ผมได้พัฒนาทักษะการเป็น Full-stack Developer ที่มองเห็นภาพรวมของระบบ และทักษะการบริหารผลิตภัณฑ์ในฐานะ PO ที่ต้องคำนึงถึง Business Value เสมอ ผมได้เรียนรู้การทำงานร่วมกับทีมพัฒนาในรูปแบบ Agile และความภูมิใจสูงสุดคือการเห็นไอเดียที่เริ่มจากศูนย์ กลายเป็นระบบที่พร้อมช่วยเหลือผู้คนในอุตสาหกรรมตลาดได้จริงๆ"
    },

    "gallery": {
        "heading": "หน้าจอ Interface ของระบบ TaladHub และบรรยากาศการพัฒนาโปรเจกต์ร่วมกับทีม"
    }  
}