{
    "title": "New Year Event Staff: เบื้องหลังการสร้างความสุขผ่านระบบ Hybrid Event เต็มรูปแบบ",

    "image1Description": "การควบคุมระบบภาพ เสียง และการสตรีมมิ่งเพื่อเชื่อมต่อพนักงานทุกสาขาในกิจกรรม New Year Event",
    
    "section1": {
        "heading": "ที่มาและความตั้งใจ",
        "content": "กิจกรรมส่งท้ายปีเก่าต้อนรับปีใหม่ (New Year Event) เป็นกิจกรรมที่มุ่งสร้างความสัมพันธ์และความสุขให้กับพนักงานทั้งกลุ่มบริษัท ความตั้งใจของผมในบทบาท Staff คือการทำให้พนักงานทุกคน ไม่ว่าจะอยู่ที่สำนักงานหลักหรือสาขาต่างจังหวัด ได้รับประสบการณ์ความสนุกที่เท่าเทียมกันผ่านระบบออนไลน์และออนไซต์ที่ไร้รอยต่อ เพื่อเป็นการส่งท้ายปีด้วยบรรยากาศที่น่าประทับใจที่สุด"
    },

    "section2": {
        "heading": "บทบาทและการลงมือทำ",
        "content": "ผมรับหน้าที่เป็นแกนนำในการดูแลระบบ Production ทั้งหมด ตั้งแต่การควบคุมระบบเครื่องเสียง (Sound Engineer) การจัดการซาวด์เอฟเฟกต์และแสงสีบนเวที ไปจนถึงการควบคุมการถ่ายทอดสด (Live Streaming) นอกจากนี้ยังรับผิดชอบในส่วนของ 'Virtual Engagement' หรือการดูแลผู้เข้าร่วมผ่านช่องทางออนไลน์ โดยผมทำหน้าที่รันลำดับเหตุการณ์ (Show Runner) เพื่อให้การร่วมกิจกรรมระหว่างพนักงานในห้องส่งและพนักงานที่รับชมออนไลน์มีความลื่นไหลและมีส่วนร่วมอย่างต่อเนื่อง"
    },

    "section3": {
        "heading": "ความท้าทาย",
        "content": "ความท้าทายหลักคือการบริหารจัดการ 'จังหวะ' (Timing) ของงานให้ตรงกันระหว่างออนไซต์และออนไลน์ การจัดการกับเสียงสะท้อน (Audio Feedback) และการแก้ปัญหาเฉพาะหน้าทางเทคนิคเพื่อให้การสื่อสารระหว่างสาขาไม่สะดุด นอกจากนี้ยังต้องมีไหวพริบในการแทรกซาวด์เอฟเฟกต์และแสงสีให้เข้ากับบรรยากาศของกิจกรรมสดบนเวที เพื่อกระตุ้นความตื่นเต้นและสร้างอารมณ์ร่วมให้กับพนักงานตลอดทั้งงาน"
    },

    "section4": {
        "heading": "ผลลัพธ์และเกิดการเรียนรู้",
        "content": "กิจกรรมประสบความสำเร็จอย่างงดงาม พนักงานจากทุกสาขาสามารถเข้าร่วมลุ้นรางวัลและสนุกกับกิจกรรมได้พร้อมกันแบบ Real-time การทำงานครั้งนี้ช่วยให้ผมพัฒนาทักษะ 'Broadcasting & Audio Engineering' และการบริหารจัดการกิจกรรมแบบ Hybrid ที่มีความซับซ้อนสูง ทำให้ผมเข้าใจถึงความสำคัญของการใช้เทคโนโลยีเป็นสะพานเชื่อมความสัมพันธ์ของผู้คนในองค์กรขนาดใหญ่ได้เป็นอย่างดี"
    },

    "gallery": {
        "heading": "ภาพบรรยากาศการควบคุมระบบ Technical และการมีส่วนร่วมของพนักงานสาขา"
    }  
}