{
    "title": "Burgundy : ระบบตั้งค่าใช้จ่ายค้างจ่าย (Accrued) สำหรับองค์กร",

    "image1Description": "ระบบตั้งค่าใช้จ่ายค้างจ่าย (Accrued) สำหรับองค์กร",

    "section1": {
        "heading": "แรงบันดาลใจ",
        "content": "Burgundy เป็นผลิตภัณฑ์บริหารจัดการค่าใช้จ่ายที่ออกแบบมาเพื่อเชื่อมช่องว่างระหว่างพนักงานและฝ่ายบัญชี โดยโมดูล 'Accrued' (ค่าใช้จ่ายค้างจ่าย) ถูกพัฒนาขึ้นเพื่อแก้ปัญหาการติดตามยอดหนี้ค้างชำระกับ Vendor ที่มักตกหล่นและตรวจสอบได้ยาก ระบบนี้มุ่งเน้นการสร้าง Workflow การขออนุมัติที่มีมาตรฐาน มีระบบแจ้งเตือนผ่านอีเมล และการเตรียมข้อมูลสำหรับการทำ Interface ไปยังระบบบัญชี เพื่อให้องค์กรสามารถบริหารกระแสเงินสดและติดตามรายการย้อนหลังได้อย่างแม่นยำ"
    },

    "section2": {
        "heading": "แนวคิดและการออกแบบ",
        "content": "การออกแบบให้ความสำคัญกับ 'ความยืดหยุ่นของสายอนุมัติ' (Approval Workflow) ที่สามารถปรับเปลี่ยนตามมูลค่าของเอกสารและโครงสร้างองค์กร ตั้งแต่หัวหน้าทีมย่อยไปจนถึงหัวหน้าแผนก และขั้นตอนสุดท้ายที่ฝ่ายบัญชี โดยระบบรองรับสถานะการตรวจสอบ (Verify) และการส่งกลับไปแก้ไข (Revisable) นอกจากนี้ยังออกแบบระบบให้สามารถจำลองคู่บัญชีและ Export ข้อมูลเป็น Excel เพื่ออำนวยความสะดวกสูงสุดแก่เจ้าหน้าที่บัญชีในการบันทึกข้อมูลต่อ"
    },

    "section3": {
        "heading": "ความท้าทายและทางแก้",
        "content": "ความท้าทายหลักคือ 'ความซ้ำซ้อนของขั้นตอน' ในสายตาผู้ใช้งาน เนื่องจากปกติเมื่อมีการซื้อเชื่อ พนักงานจะทำรายการผ่านโมดูล PRQ อยู่แล้ว หากต้องมาสร้างเอกสาร Accrued แยกต่างหากจะกลายเป็นภาระงาน ผมจึงแก้ไขด้วยการออกแบบฟังก์ชัน Auto-Generation ให้ระบบสามารถสร้างเอกสารค่าใช้จ่ายค้างจ่ายพ่วงไปกับการสร้างเอกสาร PRQ ได้ทันที นอกจากนี้ยังให้ความสำคัญกับการคำนวณ 'หลายสกุลเงิน' (Multi-currency) ที่มีความอ่อนไหวเรื่องทศนิยมและอัตราแลกเปลี่ยน โดยเพิ่มระบบการคำนวณและ Validation ตรวจสอบยอดเงินก่อนบันทึก เพื่อป้องกันปัญหาบัญชีไม่สมดุล (Unbalanced)"
    },

    "section4": {
        "heading": "โอกาสในการพัฒนาต่อยอด",
        "content": "ในอนาคต ระบบนี้สามารถยกระดับไปสู่การเป็น Fully Automated Accounting Integration โดยการเชื่อมต่อแบบ Real-time API กับซอฟต์แวร์บัญชีชั้นนำต่างๆ เพื่อให้ข้อมูลอัปเดตถึงกันทันทีโดยไม่ต้องผ่าน Manual Interface ซึ่งจะช่วยเพิ่มความปลอดภัยในการสำรองข้อมูล (Backup) และช่วยให้ฝ่ายบริหารสามารถดูรายงานงบประมาณค้างจ่าย (Accrued Expense Report) แบบ Dashboard ได้ทันทีเพื่อประกอบการตัดสินใจทางธุรกิจ"
    },

    "gallery": {
        "heading": "รูปเพิ่มเติม"
    }  
}