{
    "title": "Active Directory Portal : ระบบบริหารจัดการตัวตนและสิทธิ์การเข้าถึงแบบ Self-Service",

    "image1Description": "แพลตฟอร์มจัดการรหัสผ่านและข้อมูลส่วนบุคคลผ่าน Web Interface และ API เพื่อเพิ่มประสิทธิภาพงาน IT Helpdesk",
    
    "section1": {
        "heading": "แรงบันดาลใจ",
        "content": "ในองค์กรระดับ Enterprise ระบบ Active Directory (AD) เปรียบเสมือนหัวใจหลักในการบริหารจัดการตัวตน (Identity) และสิทธิ์การเข้าถึงทรัพยากรในเครือข่าย แต่ปัญหาที่มักพบคือเมื่อนโยบายความปลอดภัยบังคับให้เปลี่ยนรหัสผ่านตามรอบเวลา หรือพนักงานลืมรหัสผ่าน ภาระงานทั้งหมดจะตกอยู่ที่ IT Helpdesk ทันที ผมจึงมีแนวคิดที่จะพัฒนา Self-Service Web Portal เพื่อเป็นตัวกลางให้พนักงานสามารถจัดการข้อมูลส่วนตัวและรีเซ็ตรหัสผ่านได้ด้วยตนเองอย่างปลอดภัย ช่วยลดคอขวดในการทำงานและเพิ่มความต่อเนื่องให้กับการดำเนินธุรกิจได้อย่างมีประสิทธิภาพ"
    },

    "section2": {
        "heading": "แนวคิดและการออกแบบ",
        "content": "ผมออกแบบระบบในลักษณะ Web Portal ที่ทำหน้าที่เป็น Middleware เชื่อมต่อกับฐานข้อมูล AD ผ่าน API ที่พัฒนาขึ้นโดยเฉพาะ โดยให้ความสำคัญกับ User-Friendly Interface เพื่อให้พนักงานทุกระดับใช้งานได้ง่าย ระบบนี้ช่วยให้พนักงานสามารถปรับปรุงข้อมูลส่วนบุคคลหรือดำเนินการรีเซ็ตรหัสผ่านใหม่ผ่านระบบออนไลน์ได้ทันที การออกแบบนี้ไม่เพียงแต่เพิ่มความสะดวก แต่ยังช่วยให้พนักงานเข้าถึงเครื่องมือจัดการตัวตนได้ตลอด 24 ชั่วโมง แม้ในช่วงที่ทำงานจากภายนอกสำนักงานหรือติดปัญหาไม่สามารถล็อกอินเข้าเครื่องคอมพิวเตอร์ตามปกติได้"
    },

    "section3": {
        "heading": "ความท้าทายและทางแก้",
        "content": "ความท้าทายสูงสุดคือการรักษาความปลอดภัยในระดับ 'Gatekeeper' เพราะหากช่องทางนี้ถูกโจมตีจะส่งผลกระทบต่อบัญชีรายชื่อในระบบ AD ทั้งองค์กร ผมจึงแก้ไขด้วยการยกระดับความปลอดภัยผ่านระบบยืนยันตัวตนหลายขั้นตอน (Multi-Factor Authentication - MFA) มาประยุกต์ใช้ในทุกการทำรายการ ไม่ว่าจะเป็นการยืนยันผ่านแอปพลิเคชัน Authenticator หรือทางอีเมล เพื่อป้องกันการสวมรอยและตรวจสอบให้แน่ใจว่าผู้ที่กำลังดำเนินการรีเซ็ตรหัสผ่านคือเจ้าของบัญชีตัวจริงเท่านั้น"
    },

    "section4": {
        "heading": "โอกาสในการพัฒนาต่อยอด",
        "content": "ในอนาคตระบบนี้สามารถยกระดับสู่การเป็น Unified Identity Management ที่รองรับทั้ง Microsoft AD เดิมและระบบสมัยใหม่บน Cloud อย่าง Azure AD (Entra ID) หรือ OpenLDAP เพื่อตอบโจทย์โครงสร้างแบบ Hybrid Cloud นอกจากนี้ยังมีแผนที่จะเพิ่มฟังก์ชัน Passwordless Login หรือการใช้ OTP (One-Time Password) ในการเข้าถึงหน้าเว็บ เพื่อสร้างสมดุลระหว่างความสะดวกและความปลอดภัยสูงสุด ช่วยให้องค์กรก้าวไปสู่มาตรฐานความปลอดภัยแบบ Zero Trust Architecture ได้อย่างสมบูรณ์"
    },

    "gallery": {
        "heading": "รูปเพิ่มเติม"
    }   
}