{
    "title": "Burgundy : OCR กรอกข้อมูลอัตโนมัติสำหรับการสร้างเอกสาร",

    "image1Description": "OCR กรอกข้อมูลอัตโนมัติสำหรับการสร้างเอกสาร",

    "section1": {
        "heading": "แรงบันดาลใจ",
        "content": "ปัญหาใหญ่ของการเบิกจ่ายในองค์กรคือ 'ความล่าช้าและข้อผิดพลาดจากการคีย์ข้อมูล' (Manual Entry) หากพนักงานมีใบแจ้งหนี้ 50 ใบ ต้องใช้เวลาเฉลี่ยกว่า 150 นาทีในการกรอกข้อมูล ซึ่งยังไม่รวมเวลาที่ผู้ตรวจสอบอีก 4 ส่วนงานต้องใช้ในการรีเช็คความถูกต้อง ผมจึงมีแนวคิดที่จะใช้เทคโนโลยี OCR เข้ามาปรับเปลี่ยนกระบวนการนี้ให้เป็นระบบกึ่งอัตโนมัติ เพื่อลดภาระงานของพนักงาน ลดข้อผิดพลาดในการลงรหัสค่าใช้จ่าย และทำให้กระบวนการอนุมัติ (Approval Cycle) รวดเร็วขึ้นหลายเท่าตัว"
    },

    "section2": {
        "heading": "แนวคิดและการออกแบบ",
        "content": "ระบบถูกออกแบบให้ใช้งานง่ายเพียงแค่ 'ถ่ายรูปและอัปโหลด' โดยใช้เวลาประมวลผลไม่เกิน 2 นาทีต่อเอกสาร และรองรับการประมวลผลพร้อมกันหลายใบ (Parallel Processing) จุดเด่นคือการนำค่า Confidence Score มาแสดงผลเพื่อให้ผู้ใช้โฟกัสการตรวจสอบเฉพาะจุดที่ระบบไม่มั่นใจ พร้อมระบบ Tracking ที่ระบุว่าข้อมูลส่วนใดผ่านการแก้ไขด้วยมือแล้ว ช่วยให้ผู้ตรวจสอบในลำดับถัดไปทำงานได้รวดเร็วขึ้นโดยไม่ต้องตรวจสอบซ้ำในจุดที่ถูกต้องแล้ว"
    },

    "section3": {
        "heading": "ความท้าทายและทางแก้",
        "content": "ความท้าทายที่สุดคือ OCR อ่านข้อความได้ แต่ไม่สามารถระบุ 'รหัสค่าใช้จ่ายบัญชี' ได้เนื่องจากข้อมูลนี้ไม่มีในใบแจ้งหนี้ ผมจึงแก้ไขโดยการสร้าง Logic ชั้นสูงด้วยการนำ Tax ID ไปค้นหารหัสประเภทธุรกิจ (TSIC) จากกรมสรรพากร แล้วนำมาคำนวณร่วมกับรหัสหน่วยงานและหัวข้อการเบิก ผ่านโมเดล Machine Learning ที่เราฝึกฝน (Train) จากชุดข้อมูลการตั้งค่า (Configuration) เพื่อทำนายรหัสค่าใช้จ่ายที่ถูกต้องโดยอัตโนมัติ ทำให้ระบบไม่เพียงแค่อ่านออก แต่ยัง 'เข้าใจ' บริบททางบัญชีด้วย"
    },

    "section4": {
        "heading": "โอกาสในการพัฒนาต่อยอด",
        "content": "โปรเจกต์นี้สามารถต่อยอดเป็น Microservice แยกเฉพาะสำหรับการสกัดข้อมูลเอกสาร (Data Extraction Service) ที่ระบบอื่นๆ ในองค์กรสามารถเรียกใช้งานผ่าน API ได้ โดยแยกส่วนการอ่านข้อมูล (OCR) และส่วนการจับคู่ข้อมูลบัญชี (Account Mapping) ออกจากกัน เพื่อความยืดหยุ่นในการนำไปประยุกต์ใช้กับเอกสารประเภทอื่นๆ ในอนาคต เช่น สัญญาจ้าง หรือใบสั่งซื้อ ซึ่งจะช่วยยกระดับองค์กรสู่การเป็น Data-Driven Organization อย่างเต็มรูปแบบ"
    },  

    "gallery": {
        "heading": "รูปเพิ่มเติม"
    }  
}