{
    "title": "Detect Electric Meter Model : ระบบตรวจจับตำแหน่งและวิเคราะห์ตัวเลขมิเตอร์ไฟฟ้าอัจฉริยะ",

    "image1Description": "การใช้ Object Detection เพื่อระบุพิกัดชุดตัวเลขบนมิเตอร์ไฟฟ้า ก่อนเข้าสู่กระบวนการอ่านค่าดิจิทัล",
    
    "section1": {
        "heading": "แรงบันดาลใจ",
        "content": "หนึ่งในส่วนประกอบที่สำคัญที่สุดของระบบอ่านมิเตอร์อัตโนมัติ คือความสามารถในการระบุตำแหน่งของชุดตัวเลขได้อย่างถูกต้อง เพราะก่อนที่เราจะแปลงภาพเป็นข้อมูลได้ เราจำเป็นต้องรู้ก่อนว่า 'ข้อมูลนั้นอยู่ที่จุดใด' ผมจึงมุ่งเน้นพัฒนาโมเดลสำหรับการตรวจจับตำแหน่งตัวเลข (Number Localization) บนหน้าปัดมิเตอร์ไฟฟ้า ซึ่งถือเป็นหัวใจสำคัญที่จะตัดสินความแม่นยำของระบบทั้งหมดในขั้นตอนถัดไป"
    },

    "section2": {
        "heading": "แนวคิดและการออกแบบ",
        "content": "ผมนำเทคโนโลยี Image Processing มาผสานเข้ากับ Object Detection โดยเริ่มจากการปรับสภาพแสงและสีของรูปภาพเพื่อดึงจุดเด่นของวัตถุออกมา จากนั้นจึงพัฒนาโมเดลผ่านกระบวนการ Training ด้วยชุดข้อมูลรูปภาพมิเตอร์ไฟฟ้าที่ผ่านการทำ Data Labeling อย่างละเอียด เพื่อระบุตำแหน่งของกรอบตัวเลขในสภาพแวดล้อมที่หลากหลาย ทำให้ระบบสามารถ 'โฟกัส' ไปที่เป้าหมายที่ต้องการได้อย่างแม่นยำก่อนเริ่มกระบวนการอ่านค่า"
    },

    "section3": {
        "heading": "ความท้าทายและทางแก้",
        "content": "ความท้าทายหลักของการอ่านค่าตัวเลขให้มีประสิทธิภาพสูง คือความสามารถในการตรวจจับตำแหน่งท่ามกลางความซับซ้อนของหน้าปัดมิเตอร์ที่มีตัวอักษรอื่นๆ ปนอยู่ ผมจึงแก้ไขโดยการเน้นการเพิ่มคุณภาพและปริมาณของข้อมูลที่ใช้ในการฝึกสอนโมเดล เพราะยิ่งข้อมูลครอบคลุมกรณีการใช้งานจริงมากเท่าไหร่ โมเดลก็จะยิ่งฉลาดและแยกแยะตำแหน่งชุดตัวเลขได้ดียิ่งขึ้น ซึ่งส่งผลโดยตรงต่อความแม่นยำของผลลัพธ์สุดท้ายที่ระบบจะแสดงผล"
    },

    "section4": {
        "heading": "โอกาสในการพัฒนาต่อยอด",
        "content": "ระบบนี้สามารถพัฒนาต่อยอดสู่การเป็น Universal Meter Reader ที่ไม่ได้จำกัดอยู่เพียงมิเตอร์ไฟฟ้าเท่านั้น แต่ยังครอบคลุมถึงมิเตอร์น้ำ มิเตอร์แก๊ส หรือเกจวัดค่าต่างๆ ในงานอุตสาหกรรม โดยใช้หลักการตรวจจับชุดตัวเลขที่เรียงต่อกัน (Number Sequence Detection) เพื่อสร้างมาตรฐานใหม่ในการจัดเก็บข้อมูลมิเตอร์ทุกรูปแบบให้เป็นดิจิทัลได้ทันทีเพียงแค่การสแกนผ่านกล้อง"
    },

    "gallery": {
        "heading": "รูปเพิ่มเติม"
    }   
}