{
    "title": "Covid-19 Tracker : แดชบอร์ดวิเคราะห์สถิติและการแพร่ระบาดอัจฉริยะ",

    "image1Description": "ระบบ Data Visualization ที่เชื่อมต่อกับ API ภาครัฐเพื่อรายงานสถานการณ์โรคระบาดแบบ Real-time",
    
    "section1": {
        "heading": "แรงบันดาลใจ",
        "content": "ในช่วงวิกฤตการณ์ COVID-19 ข้อมูลข่าวสารที่มีปริมาณมหาศาลและกระจัดกระจายทำให้ยากต่อการคัดกรองข้อเท็จจริง ผมเชื่อว่า 'ข้อมูลที่จับต้องได้' (Data as a Source of Truth) คือเครื่องมือที่ดีที่สุดในการสร้างความเชื่อมั่น ผมจึงมีแนวคิดที่จะพัฒนา Dashboard สำหรับรวบรวมสถิติการแพร่ระบาดอย่างเป็นระบบ เพื่อให้ประชาชนสามารถติดตามสถานการณ์ล่าสุดและนำข้อมูลไปใช้ประกอบการตัดสินใจในการป้องกันตนเอง รวมถึงวางแผนการใช้ชีวิตประจำวันได้อย่างแม่นยำและทันท่วงที"
    },

    "section2": {
        "heading": "แนวคิดและการออกแบบ",
        "content": "ผมออกแบบเว็บแอปพลิเคชันในรูปแบบ Data Visualization ที่เน้นความเรียบง่ายและประสิทธิภาพในการเข้าถึงข้อมูล โดยระบบสามารถแสดงผลข้อมูลแยกตามรายจังหวัดและภาพรวมระดับประเทศ ประกอบด้วยดัชนีชี้วัดสำคัญ 4 ส่วน คือ จำนวนผู้ติดเชื้อรายใหม่, ผู้ติดเชื้อสะสม, ผู้ที่รักษาหายแล้ว และจำนวนผู้เสียชีวิต พร้อมติดตั้งระบบค้นหาอัจฉริยะที่ช่วยให้ผู้ใช้งานสามารถเจาะลึกข้อมูลรายพื้นที่ได้ทันที เพื่อประเมินระดับความเสี่ยงในแต่ละพื้นที่ได้อย่างชัดเจน"
    },

    "section3": {
        "heading": "ความท้าทายและทางแก้",
        "content": "ความท้าทายหลักคือการจัดการข้อมูลที่ต้องมีความน่าเชื่อถือและอัปเดตอยู่เสมอ ผมจึงทำการ Integration ระบบเข้ากับ Open API ของกระทรวงสาธารณสุขเพื่อดึงข้อมูลจากแหล่งอ้างอิงของรัฐบาลโดยตรง อย่างไรก็ตาม ผมพบข้อจำกัดเรื่อง Latency ของ API และความเสี่ยงหากระบบต้นทางขัดข้อง ผมจึงได้วางโครงสร้างการรับส่งข้อมูลที่มีความยืดหยุ่น (Scalable Data Fetching) เพื่อให้ระบบสามารถประมวลผลและแสดงผลข้อมูลล่าสุดได้อย่างมีประสิทธิภาพแม้ในช่วงเวลาที่มีปริมาณการเข้าใช้งานพร้อมกันจำนวนมาก"
    },

    "section4": {
        "heading": "โอกาสในการพัฒนาต่อยอด",
        "content": "โปรเจกต์นี้สามารถยกระดับสู่การเป็น 'Public Health Surveillance Platform' หรือแพลตฟอร์มเฝ้าระวังโรคระบาดอัจฉริยะ โดยเพิ่มการแสดงผลเชิงพื้นที่ในรูปแบบ Heatmap เพื่อให้เห็นการกระจุกตัวของเชื้อโรคได้ชัดเจนยิ่งขึ้น นอกจากนี้ยังมีแผนที่จะปรับเปลี่ยนสถาปัตยกรรมจากการเรียกใช้ API โดยตรง เป็นการทำ Data Caching และ Storage ในฐานข้อมูลของตนเอง เพื่อเสริมสร้างความเสถียรของระบบ (High Availability) และรองรับการทำ Data Analytics เพื่อพยากรณ์แนวโน้มการระบาดในอนาคต"
    },

    "gallery": {
        "heading": "รูปเพิ่มเติม"
    }   
}