{
    "title": "TaladHub : OCR อ่านมิเตอร์ไฟฟ้า/มิเตอร์น้ำ",

    "image1Description": "OCR อ่านมิเตอร์ไฟฟ้า/มิเตอร์น้ำ",

    "section1": {
        "heading": "แรงบันดาลใจ",
        "content": "จากการศึกษาขั้นตอนการบริหารจัดการตลาดที่มีแผงค้าจำนวนมาก พบว่าการจดมิเตอร์น้ำ-ไฟแบบดั้งเดิมเป็นกระบวนการที่สร้างภาระงานมหาศาลและความเสี่ยงสูง ตัวอย่างเช่น ตลาดที่มี 100 แผงค้า เจ้าหน้าที่ต้องจดและคีย์ข้อมูลตัวเลขรวมกว่า 2,000 หลักลงในระบบ ซึ่งมีโอกาสเกิดความผิดพลาดได้ง่าย และมักถูกตั้งคำถามจากผู้เช่าเรื่องความโปร่งใสเนื่องจากไม่มีหลักฐานยืนยันค่ามิเตอร์ ณ ขณะจด ผมจึงเกิดแนวคิดที่จะเปลี่ยนจากการจดบันทึกด้วยมือ (Manual จด-คีย์) มาเป็นการใช้ภาพถ่ายเป็นหลักฐานหลัก เพื่อเพิ่มความแม่นยำและความน่าเชื่อถือให้กับระบบการเรียกเก็บเงิน"
    },

    "section2": {
        "heading": "แนวคิดและการออกแบบ",
        "content": "ผมออกแบบระบบโดยใช้แนวคิด 'Single Shot Capture' เปลี่ยนการกรอกข้อมูลเป็นการถ่ายรูปมิเตอร์เพื่อประมวลผลอัตโนมัติ โดยใช้เทคโนโลยี Object Detection ในการคัดแยกส่วนประกอบของภาพออกเป็น 2 ส่วน: 1) QR Code เพื่อระบุตัวตนมิเตอร์ แผงค้า และตลาดต้นสังกัด และ 2) ส่วนของตัวเลขมิเตอร์ (Digit Counter) โดยใช้โมดูล OCR ที่ผ่านการ Train เพื่ออ่านค่าตัวเลขแต่ละหลัก ข้อมูลที่ได้จะถูกนำมาคำนวณตามอัตราค่าบริการที่ตั้งค่าไว้ล่วงหน้า และแสดงผลในรูปแบบ Grid ที่คุ้นเคยคล้าย Excel เพื่อให้ผู้ใช้สามารถตรวจสอบความถูกต้องและดูระดับความเชื่อมั่น (Confidence Score) ของการอ่านค่าได้ทันที"
    },

    "section3": {
        "heading": "ความท้าทายและทางแก้",
        "content": "ความท้าทายหลักอยู่ที่คุณภาพของภาพถ่ายหน้างานจริง ซึ่ง QR Code อาจมีความละเอียดสูงจนอ่านยากหรือภาพไม่คมชัด ผมจึงแก้ไขด้วยการนำเทคนิค Image Processing มาช่วยปรับปรุงคุณภาพภาพถ่าย (Enhancement) ก่อนเข้าสู่โมเดลการอ่านค่า นอกจากนี้ยังออกแบบระบบให้รองรับความยืดหยุ่นในกรณีที่ AI ไม่มั่นใจ โดยจะแสดงสถานะให้เจ้าหน้าที่ตรวจสอบเป็นพิเศษ (Human-in-the-loop) เพื่อสร้างสมดุลระหว่างความสะดวกของระบบอัตโนมัติและความถูกต้องแม่นยำสูงสุดของข้อมูลทางบัญชี"
    },

    "section4": {
        "heading": "โอกาสในการพัฒนาต่อยอด",
        "content": "ปัจจุบันระบบรองรับการประมวลผลแบบ 1 รูปต่อ 1 มิเตอร์ แต่เป้าหมายถัดไปที่ผมกำลังพัฒนาคือ 'Multi-Meter Detection' หรือการถ่ายภาพมุมกว้างเพียงรูปเดียวแต่สามารถตรวจจับและอ่านค่ามิเตอร์หลายตัวพร้อมกันได้ ซึ่งจะช่วยลดระยะเวลาในการเดินสำรวจลงได้อีกหลายเท่าตัว นอกจากนี้ ข้อมูลภาพถ่ายมิเตอร์ย้อนหลังยังสามารถนำมาทำ Data Visualization เพื่อวิเคราะห์พฤติกรรมการใช้พลังงานในแต่ละโซนของตลาด ช่วยให้เจ้าของตลาดวางแผนการใช้ทรัพยากรไฟฟ้าและน้ำได้อย่างมีประสิทธิภาพมากขึ้นในอนาคต"
    },  

    "gallery": {
        "heading": "รูปเพิ่มเติม"
    }  
}