{
    "title": "Hello Secret : ระบบถอดรหัสภาษาและเครื่องมือสื่อสารความลับอัจฉริยะ",

    "image1Description": "เว็บแอปพลิเคชันที่ช่วยแก้ไขปัญหาการพิมพ์ผิดภาษาพร้อมระบบเข้ารหัสข้อความเพื่อความเป็นส่วนตัวสูงสุด",
    
    "section1": {
        "heading": "แรงบันดาลใจ",
        "content": "โปรเจกต์นี้เกิดจากการสังเกตปัญหาหลัก 2 ประการในการสื่อสารดิจิทัล ประการแรกคือปัญหาความผิดพลาดจากการลืมสลับภาษาบนคีย์บอร์ดที่ทำให้เสียเวลาในการสื่อสาร และประการที่สองคือความต้องการ 'ความเป็นส่วนตัวขั้นสูง' (Privacy Conversation) ในการส่งข้อมูลสำคัญผ่านแอปพลิเคชันแชททั่วไป ผมจึงริเริ่มพัฒนา 'Hello Secret' เพื่อเป็นเครื่องมือที่ช่วยทั้งการกู้คืนข้อความที่พิมพ์ผิดภาษา และเป็นช่องทางเข้ารหัสข้อมูลความลับเพื่อให้มั่นใจว่าใจความสำคัญจะรับรู้กันเพียงแค่ผู้ส่งและผู้รับตัวจริงเท่านั้น"
    },

    "section2": {
        "heading": "แนวคิดและการออกแบบ",
        "content": "ผมออกแบบแอปพลิเคชันให้รองรับการใช้งาน 2 โหมดหลัก โหมดแรกคือ 'Language Mapping' ที่ใช้อัลกอริทึมแปลงข้อความที่พิมพ์ผิดภาษาโดยอิงจากพิกัดตัวอักษรบนแป้นพิมพ์ และโหมดที่สองคือ 'Secret Encryption' ซึ่งเป็นระบบที่ให้ผู้ใช้สามารถเข้ารหัสข้อความ (Encryption) ก่อนส่งออกไป โดยผู้รับจำเป็นต้องนำรหัสลับเหล่านั้นกลับมาถอดรหัสผ่านเว็บแอปพลิเคชันด้วยอัลกอริทึมเดียวกัน จึงจะสามารถเข้าถึงเนื้อหาที่แท้จริงได้ เป็นการเพิ่มเลเยอร์ความปลอดภัยให้กับการสื่อสารในชีวิตประจำวัน"
    },

    "section3": {
        "heading": "ความท้าทายและทางแก้",
        "content": "ความท้าทายสำคัญคือการป้องกันผู้ไม่หวังดีสุ่มหาอัลกอริทึมเพื่อถอดรหัส (Brute-force) ผมจึงเพิ่มความปลอดภัยด้วยระบบ 'Symmetric Key' ที่กำหนดให้ผู้ใช้ต้องตั้งรหัสผ่านร่วมกันก่อนทำรายการ นอกจากนี้ผมยังเผชิญกับข้อจำกัดในการจัดการตัวอักษรพิเศษและ Emoji ที่มักทำให้รหัสเกิดความเพี้ยน ผมจึงใช้เทคนิค Data Encoding เพื่อให้มั่นใจว่าใจความสำคัญจะยังคงความสมบูรณ์และถูกต้อง 100% แม้จะผ่านการเข้ารหัสและถอดรหัสที่ซับซ้อนหลายขั้นตอน"
    },

    "section4": {
        "heading": "โอกาสในการพัฒนาต่อยอด",
        "content": "ในอนาคต 'Hello Secret' สามารถยกระดับสู่มาตรฐานความปลอดภัยสากลด้วยการนำ 'Time-based OTP Key' มาใช้ เพื่อให้รหัสผ่านเปลี่ยนไปตามเวลา เพิ่มความยากในการเข้าถึงข้อมูลย้อนหลัง รวมถึงฟีเจอร์ 'Burn-on-read' หรือการทำลายข้อมูลทันทีหลังการอ่านครั้งแรก เพื่อตอบโจทย์การสื่อสารระดับองค์กรหรือความลับส่วนบุคคลภายใต้แนวคิด 'ความลับต้องเป็นความลับตลอดไป' ช่วยสร้างมาตรฐานใหม่ในการรักษาความปลอดภัยของข้อมูลในโลกแชท"
    },

    "gallery": {
        "heading": "รูปเพิ่มเติม"
    }   
}