{
    "title": "Read Meter OCR : ระบบบูรณาการ AI เพื่อการอ่านค่ามิเตอร์และระบุตัวตนอัจฉริยะ",

    "image1Description": "การรวมโมเดล Object Detection และ OCR เข้าด้วยกันผ่าน Fast API เพื่อประมวลผลข้อมูลจากรูปภาพแบบครบวงจร",
    
    "section1": {
        "heading": "แรงบันดาลใจ",
        "content": "หลังจากที่ผมได้พัฒนาโมเดลเฉพาะทางมาแล้วหลายตัว ไม่ว่าจะเป็นการตรวจจับ QR Code หรือการระบุตำแหน่งตัวเลขบนหน้าปัดมิเตอร์ ผมจึงเห็นโอกาสในการนำองค์ความรู้เหล่านั้นมารวมกัน (System Integration) เพื่อสร้างโซลูชันที่สมบูรณ์แบบเพียงหนึ่งเดียว โดยเป้าหมายคือการสร้างระบบที่สามารถประมวลผลรูปภาพเพียงรูปเดียวแล้วดึงข้อมูลสำคัญทุกอย่างออกมาได้ ทั้งข้อมูลระบุตัวตนจาก QR Code และค่าตัวเลขจากการอ่านมิเตอร์"
    },

    "section2": {
        "heading": "แนวคิดและการออกแบบ",
        "content": "ผมเลือกใช้ Python Fast API เป็นแกนหลักในการพัฒนา API เพื่อรองรับการทำงานที่มีประสิทธิภาพสูง โดยกระบวนการเริ่มต้นจากการรับรูปภาพผ่าน API แล้วทำ Image Preprocessing เป็นภาพขาวดำเพื่อลด Noise จากนั้นระบบจะรันโมเดลขนานกันเพื่อตรวจจับ QR Code และตำแหน่งตัวเลข (Object Detection) ก่อนจะใช้เทคนิค OCR ในการดึงค่าข้อมูลออกมา ผลลัพธ์ที่ได้จะประกอบด้วยข้อมูลมิเตอร์และตัวเลขที่อ่านได้ พร้อมระบุค่าความมั่นใจ (Confidence Score) ในแต่ละหลักเพื่อให้ระบบปลายทางสามารถนำไปตรวจสอบความถูกต้องได้"
    },

    "section3": {
        "heading": "ความท้าทายและทางแก้",
        "content": "ความท้าทายหลักคือการจัดการกับข้อมูลที่ไม่สมบูรณ์ เช่น ภาพมืดเกินไป หรือการส่งภาพที่ไม่เกี่ยวข้องเข้าสู่ระบบ ผมจึงออกแบบกลไกการตรวจสอบข้อมูล (Validation Layer) โดยหากระบบไม่สามารถอ่านค่าส่วนใดส่วนหนึ่งได้ จะไม่มีการคาดเดาข้อมูลที่ผิดพลาด แต่จะส่งสถานะตอบกลับ (Status Code) พร้อมระบุประเภทของข้อผิดพลาดนั้นๆ เพื่อให้ผู้ใช้งานทราบและดำเนินการแก้ไขได้อย่างตรงจุด ช่วยให้ระบบมีความน่าเชื่อถือและตรวจสอบย้อนกลับได้"
    },

    "section4": {
        "heading": "โอกาสในการพัฒนาต่อยอด",
        "content": "เพื่อให้เกิดความยืดหยุ่นสูงสุดในการนำไปใช้งาน ผมได้เปลี่ยนจากระบบที่ติดตั้งตายตัว (Monolith) มาเป็นรูปแบบ API Service ที่มีการกำหนด API Key ในการสื่อสาร ซึ่งช่วยให้นักพัฒนาคนอื่นสามารถเชื่อมต่อบริการอ่านมิเตอร์นี้เข้ากับโปรเจกต์ต่างๆ ได้ทันที ในอนาคตมีแผนจะพัฒนาให้เป็น Universal OCR Service ที่รองรับมิเตอร์ทุกรูปแบบและเอกสารประเภทอื่นๆ โดยส่งข้อมูลกลับในรูปแบบ JSON มาตรฐาน เพื่อสร้าง Ecosystem ของการอ่านข้อมูลจากภาพที่สมบูรณ์แบบที่สุด"
    },

    "gallery": {
        "heading": "รูปเพิ่มเติม"
    }   
}