{
    "title": "myDAS : ระบบสแกน QR Code รับเอกสาร",

    "image1Description": "ระบบสแกน QR Code รับเอกสาร",

    "section1": {
        "heading": "แรงบันดาลใจ",
        "content": "ภายใต้โครงการ DAS (Digital Accounting System) ผมพบว่าขั้นตอนที่เป็นคอขวดที่สุดคือ 'การส่งมอบเอกสารต้นฉบับ' ให้กับฝ่ายบัญชี ซึ่งเดิมไม่มีระบบจัดการที่ชัดเจน พนักงานต้องเดินไปส่งเอกสารด้วยตนเองโดยไม่ทราบจุดรับหรือเจ้าหน้าที่ที่รับผิดชอบโดยตรง ส่งผลให้เอกสารสูญหาย ติดตามสถานะไม่ได้ และกระทบต่อความรวดเร็วในการบันทึกบัญชี ผมจึงริเริ่มพัฒนาสถานีรับเอกสารอัตโนมัติด้วย QR Code เพื่อสร้างตัวกลางที่เป็นระบบ (Systematic Hub) ในการเชื่อมโยงการส่งมอบเอกสารจากพนักงานสู่ฝ่ายบัญชีให้โปร่งใสและตรวจสอบได้ 100%"
    },

    "section2": {
        "heading": "แนวคิดและการออกแบบ",
        "content": "ระบบถูกออกแบบให้ใช้งานง่ายผ่าน 'Smart Station' พนักงานเพียงแค่นำเอกสารที่มี QR Code จากระบบมาสแกน ณ จุดรับเอกสาร ระบุชื่อผู้ส่งและเบอร์ติดต่อ จากนั้นระบบจะปรับสถานะเอกสารเป็น 'Submitted' และส่งอีเมลแจ้งเตือนเจ้าหน้าที่บัญชีทันที นอกจากนี้ผมยังได้ออกแบบระบบ Automated Reminder ที่จะแจ้งเตือนพนักงานที่มีเอกสารค้างส่งในช่วงเช้าของทุกวัน และสรุปรายการเอกสารที่ได้รับแล้ว ณ จุดส่งให้กับฝ่ายบัญชี เพื่อให้มั่นใจว่าเอกสารทุกฉบับจะถูกดำเนินการอย่างต่อเนื่อง"
    },

    "section3": {
        "heading": "ความท้าทายและทางแก้",
        "content": "ความท้าทายสำคัญคือการควบคุมความปลอดภัยของตัวเครื่อง (Physical Terminal Security) เนื่องจากเป็นจุดสาธารณะ ผมจึงออกแบบระบบในรูปแบบ 'Kiosk Mode' โดยจำกัดการเข้าถึงให้รันได้เฉพาะโปรแกรมรับเอกสารเพียงหน้าต่างเดียว ป้องกันการใช้งานผิดวัตถุประสงค์ด้วยการถอดคีย์บอร์ดออกเพื่อไม่ให้กด Command ต่างๆ ได้ และล็อคหน้าจอด้วยรหัสผ่านระดับ Admin สำหรับการเข้า-ออกโหมด Full Screen การออกแบบที่รัดกุมนี้ช่วยลดโอกาสเกิดช่องโหว่ด้านข้อมูล (Data Security) และป้องกันการแทรกแซงระบบจากปัจจัยภายนอกที่อาจเกิดขึ้นได้แม้เพียงน้อยนิด"
    },

    "section4": {
        "heading": "โอกาสในการพัฒนาต่อยอด",
        "content": "ในอนาคต ระบบนี้สามารถพัฒนาสู่ 'Autonomous Printing & Submission' เพื่อลดภาระการพิมพ์เอกสารของพนักงาน โดยหากพนักงานได้รับเอกสารต้นฉบับเป็นไฟล์อิเล็กทรอนิกส์ที่มีความปลอดภัยสูง (e-Document) ระบบจะสามารถรับไฟล์ผ่านออนไลน์และสั่งพิมพ์ที่สถานีรับเอกสารโดยอัตโนมัติ พร้อมปรับสถานะการรับส่งในทันที วิธีนี้จะช่วยรวมศูนย์ทั้งเอกสารกระดาษและเอกสารดิจิทัลไว้ที่จุดเดียว ช่วยเพิ่มประสิทธิภาพสูงสุดในกระบวนการรับส่งเอกสารขององค์กร"
    },  

    "gallery": {
        "heading": "รูปเพิ่มเติม"
    }  
}