{
    "title": "MarqGo : แพลตฟอร์มบริหารจัดการข้อมูลร้านค้าตลาดนัดแบบ Real-time",

    "image1Description": "Mobile Solution ที่ช่วยให้ผู้ซื้อค้นหาพิกัดร้านค้าและเมนูอาหารในตลาดนัด พร้อมระบบช่วยตัดสินใจ 'วันนี้กินอะไรดี'",
    
    "section1": {
        "heading": "แรงบันดาลใจ",
        "content": "การเดินตลาดนัดมักพบปัญหาความไม่แน่นอนของตำแหน่งร้านค้าและการเปิด-ปิดในแต่ละวัน รวมถึงปัญหาคลาสสิกของผู้บริโภคคือ 'ไม่รู้จะกินอะไรดี' ผมจึงเกิดแนวคิดพัฒนา MarqGo เพื่อเป็นแพลตฟอร์มที่เชื่อมโยงพ่อค้าแม่ค้ากับผู้ซื้อเข้าด้วยกัน โดยให้ร้านค้ามีโปรไฟล์ดิจิทัลที่สามารถระบุตำแหน่งล็อกขาย (Live Location) และอัปเดตสถานะการเปิดร้านพร้อมเมนูประจำวัน เพื่อเปลี่ยนประสบการณ์การเดินตลาดให้สะดวกและสนุกยิ่งขึ้น"
    },

    "section2": {
        "heading": "แนวคิดและการออกแบบ",
        "content": "ผมออกแบบระบบโดยแบ่งออกเป็นสองส่วนหลัก (Buyer & Seller Apps) โดยเน้นไปที่เวอร์ชัน MVP สำหรับฝั่งผู้ซื้อเพื่อใช้แสดงพิกัดร้านค้าที่เปิดให้บริการและเมนูเด่นก่อน จุดเด่นคือการนำเมนูจากร้านค้าต่างๆ มาสร้างเป็นฟีเจอร์ 'Random Menu Game' เพื่อช่วยแก้ปัญหาการตัดสินใจเลือกซื้ออาหาร เมื่อผู้ใช้ได้เมนูที่ต้องการ ระบบจะนำทางไปยังพิกัดร้านที่ขายเมนูนั้นๆ ทันทีผ่านแผนที่จำลองของตลาด"
    },

    "section3": {
        "heading": "ความท้าทายและทางแก้",
        "content": "ความท้าทายที่สำคัญคือการบริหารจัดการต้นทุนเซิร์ฟเวอร์ในช่วงเริ่มต้น (Development Cost) ผมจึงเลือกใช้กลยุทธ์ 'Backend as a Service (BaaS)' เพื่อลดภาระการวางโครงสร้างฐานข้อมูลที่ซับซ้อนในช่วงทดสอบ นอกจากนี้ เพื่อยืนยันความต้องการของตลาด (Market Validation) ผมได้เลือกเริ่มพัฒนาในรูปแบบ Web Application แทน Native App เพื่อความรวดเร็วในการกระจายตัวสู่ผู้ใช้และประหยัดงบประมาณในการพิสูจน์ไอเดียว่าข้อมูลพิกัดร้านค้าเป็นสิ่งที่ผู้บริโภคต้องการจริงหรือไม่"
    },

    "section4": {
        "heading": "โอกาสในการพัฒนาต่อยอด",
        "content": "ระบบนี้มีศักยภาพที่จะยกระดับสู่ 'Hyper-local SKU Search' ที่ครอบคลุมสินค้าทุกประเภทในตลาดนัด ไม่จำกัดเพียงแค่อาหาร โดยผู้ใช้สามารถค้นหาสินค้าเฉพาะเจาะจง (เช่น กรรไกร, ไขควง) เพื่อดูว่ามีร้านใดที่มีสินค้านี้ในสต็อกและตั้งอยู่ที่ล็อกไหน นอกจากนี้ยังมีแผนจะพัฒนาระบบสะสมแต้มและโปรโมชั่นร่วมกับตลาด เพื่อสร้าง Ecosystem ของตลาดนัดยุคใหม่ที่ขับเคลื่อนด้วยข้อมูล (Data-Driven Marketplace)"
    },

    "gallery": {
        "heading": "รูปเพิ่มเติม"
    }   
}