{
    "title": "Semi-Final Pitching: บทพิสูจน์ความสำเร็จจากการพัฒนา Product สู่การใช้งานจริง",

    "image1Description": "การนำเสนอความคืบหน้าของผลิตภัณฑ์ (Product Demo) ต่อหน้าคณะกรรมการ Project Manager ในรอบ Semi-Final",
    
    "section1": {
        "heading": "ที่มาและความตั้งใจ",
        "content": "ในรอบ Semi-Final ของโครงการ Tuek Som Garage โจทย์สำคัญไม่ได้อยู่ที่เพียงแค่ไอเดียอีกต่อไป แต่คือการพิสูจน์ว่าผลิตภัณฑ์ที่เราซุ่มพัฒนามานั้น 'ใช้งานได้จริง' และ 'แก้ปัญหาได้ตรงจุด' ความตั้งใจของผมในรอบนี้คือการแสดงให้เห็นถึงความคืบหน้าของระบบ TaladHub ที่ได้เปลี่ยนจากแผนภาพ (Blueprint) มาเป็นซอฟต์แวร์ที่พร้อมทำงาน เพื่อสร้างความมั่นใจให้กับคณะกรรมการว่าโปรเจกต์นี้มีศักยภาพเพียงพอที่จะต่อยอดเป็นธุรกิจจริงขององค์กร"
    },

    "section2": {
        "heading": "บทบาทและการลงมือทำ",
        "content": "ผมรับหน้าที่เป็นผู้นำเสนอความคืบหน้าของผลิตภัณฑ์ (Product Progress Report) ต่อหน้าคณะกรรมการซึ่งประกอบด้วยหัวหน้าทีมและ Project Manager มืออาชีพจากหลากหลายแผนก ผมได้ทำการ Demo ตัวระบบที่พัฒนาเสร็จสิ้นในส่วนสำคัญ โดยเน้นการโชว์ฟังก์ชันการทำงานที่ตอบโจทย์ Pain Points ของผู้ใช้งานจริงที่ได้ไปสำรวจมา รวมถึงการแสดงความพร้อมของโครงสร้างระบบ (Architecture) ที่สามารถรองรับการขยายตัวในอนาคต ทำให้คณะกรรมการเห็นถึงความเป็นไปได้ในการนำไป Deploy ใช้งานในสเกลที่ใหญ่ขึ้น"
    },

    "section3": {
        "heading": "ความท้าทาย",
        "content": "ความท้าทายในรอบนี้คือการตอบข้อซักถามเชิงเทคนิคและการบริหารจัดการโครงการจากผู้เชี่ยวชาญ (PM) ซึ่งเน้นเรื่องความเสถียร ความปลอดภัยของข้อมูล และความคุ้มค่าในการพัฒนา ผมต้องเตรียมข้อมูลเพื่อยืนยันว่าทุกฟีเจอร์ที่ใส่เข้าไปนั้นสร้าง Value ให้กับธุรกิจได้จริง ไม่ใช่เพียงแค่ฟังก์ชันที่ดูสวยงามแต่ไม่ได้ใช้งาน การรับมือกับคำวิจารณ์เชิงสร้างสรรค์จากคนทำงานสายโปรเจกต์โดยตรงช่วยให้ผมได้เห็นมุมมองการพัฒนาที่รอบด้านยิ่งขึ้น"
    },

    "section4": {
        "heading": "ผลลัพธ์และเกิดการเรียนรู้",
        "content": "ผลจากการนำเสนอที่ชัดเจนและ Product ที่จับต้องได้จริง ทำให้เราผ่านเข้าสู่รอบ Final Pitching ได้สำเร็จ ซึ่งเป็นด่านสุดท้ายที่จะต้องนำเสนอต่อผู้บริหารระดับสูง (Executive) ประสบการณ์ในรอบ Semi-Final นี้ทำให้ผมได้พัฒนาทักษะการทำ 'Product Validation' และการบริหารความคาดหวังของ Stakeholder ระดับบริหารจัดการ ผมได้เรียนรู้ว่าความสำเร็จของซอฟต์แวร์คือการที่มันสามารถแก้ปัญหาของผู้คนได้อย่างเรียบง่ายและทรงพลังที่สุด"
    },

    "gallery": {
        "heading": "ภาพการ Demo ผลิตภัณฑ์และการตอบข้อซักถามเชิงลึกในรอบ Semi-Final"
    }  
}