{
    "title": "SSG Harmony Friday Party: ผู้อยู่เบื้องหลังความบันเทิงและการเชื่อมต่อพนักงานผ่านระบบ Hybrid",

    "image1Description": "การควบคุมระบบแสง สี เสียง และการสตรีมมิ่งสดเพื่อสร้างบรรยากาศงานเลี้ยงสังสรรค์ SSG Harmony",
    
    "section1": {
        "heading": "ที่มาและความตั้งใจ",
        "content": "กิจกรรม Friday Party ภายใต้ธีม SSG Harmony จัดขึ้นเพื่อสร้างความผ่อนคลายและกระชับความสัมพันธ์ของพนักงานในกลุ่มบริษัท ความตั้งใจของผมในฐานะทีมงานฝ่ายเทคนิค (Staff) คือการทำให้กิจกรรมนี้เป็นพื้นที่แห่งความสุขที่พนักงานทุกคนสามารถเข้าถึงได้พร้อมกัน ไม่ว่าจะนั่งอยู่ในห้องจัดเลี้ยงหลัก หรือติดตามผ่านระบบออนไลน์จากสาขาต่างๆ ทั่วประเทศ"
    },

    "section2": {
        "heading": "บทบาทและการลงมือทำ",
        "content": "ผมรับผิดชอบหน้าที่เป็น 'Show Controller' ดูแลความเรียบร้อยเบื้องหลังทั้งหมด ตั้งแต่การออกแบบและควบคุมระบบแสงสีบนเวที การจัดลำดับคิวเพลง (Music Playback) ให้สอดคล้องกับบรรยากาศในแต่ละช่วง และที่สำคัญคือการดูแลระบบสตรีมมิ่งออนไลน์เพื่อให้พนักงานในห้องกระจายตามจุดต่างๆ และพนักงานต่างสาขาได้เห็นภาพและเสียงที่คมชัดเสมือนอยู่ในงานจริง นอกจากนี้ยังทำหน้าที่ประสานงานคิวช่วงพิธีการมอบรางวัลและกิจกรรม Kick-off ต่างๆ ให้ดำเนินไปตามกำหนดการอย่างแม่นยำ"
    },

    "section3": {
        "heading": "ความท้าทาย",
        "content": "ความท้าทายหลักคือการบริหารจัดการ 'ปัญหาหน้างาน' (Troubleshooting) ที่อาจเกิดขึ้นได้ทุกเมื่อในกิจกรรมสด เช่น การปรับจังหวะเสียงให้เข้ากับสถานการณ์บนเวที หรือการดูแลความเสถียรของสัญญาณภาพสตรีมมิ่ง ผมและทีมต้องทำงานด้วยความตื่นตัวสูง (High Alert) เพื่อให้ทุกลำดับขั้นตอนเป็นไปตามแผนที่วางไว้ และสามารถแก้ไขเหตุการณ์เฉพาะหน้าได้ทันทีโดยไม่ให้กระทบต่อความสนุกของผู้เข้าร่วมงาน"
    },

    "section4": {
        "heading": "ผลลัพธ์และเกิดการเรียนรู้",
        "content": "กิจกรรมดำเนินไปอย่างลื่นไหลและได้รับเสียงตอบรับที่ดีเยี่ยมจากพนักงาน ประสบการณ์นี้ช่วยพัฒนาทักษะ 'Live Production' และ 'Agile Problem Solving' ของผมให้แข็งแกร่งขึ้น ผมได้เรียนรู้ศิลปะของการทำงานเบื้องหลังที่ต้องใช้ความละเอียดรอบคอบและการประสานงานทีมที่เป็นหนึ่งเดียว เพื่อส่งมอบประสบการณ์ความประทับใจให้แก่ผู้คนจำนวนมากในเวลาเดียวกัน"
    },

    "gallery": {
        "heading": "ภาพบรรยากาศการควบคุมระบบเทคนิคเบื้องหลังความสำเร็จของงาน Friday Party"
    }  
}